#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function BP_Growth_HouseGlow.BP_Growth_HouseGlow_C.UserConstructionScript
struct ABP_Growth_HouseGlow_C_UserConstructionScript_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Growth_HouseGlow.BP_Growth_HouseGlow_C.EnablePortal
struct ABP_Growth_HouseGlow_C_EnablePortal_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Growth_HouseGlow.BP_Growth_HouseGlow_C.EnableHouseGlow
struct ABP_Growth_HouseGlow_C_EnableHouseGlow_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Growth_HouseGlow.BP_Growth_HouseGlow_C.ReceiveBeginPlay
struct ABP_Growth_HouseGlow_C_ReceiveBeginPlay_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Growth_HouseGlow.BP_Growth_HouseGlow_C.PortalStage1
struct ABP_Growth_HouseGlow_C_PortalStage1_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Growth_HouseGlow.BP_Growth_HouseGlow_C.PortalStage3
struct ABP_Growth_HouseGlow_C_PortalStage3_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Growth_HouseGlow.BP_Growth_HouseGlow_C.PortalStage4
struct ABP_Growth_HouseGlow_C_PortalStage4_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Growth_HouseGlow.BP_Growth_HouseGlow_C.PortalStage2
struct ABP_Growth_HouseGlow_C_PortalStage2_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Growth_HouseGlow.BP_Growth_HouseGlow_C.PortalStage5
struct ABP_Growth_HouseGlow_C_PortalStage5_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BP_Growth_HouseGlow.BP_Growth_HouseGlow_C.PortalStage6
struct ABP_Growth_HouseGlow_C_PortalStage6_Params
{
public:
};

// 0x11 (0x11 - 0x0)
// Function BP_Growth_HouseGlow.BP_Growth_HouseGlow_C.ExecuteUbergraph_BP_Growth_HouseGlow
struct ABP_Growth_HouseGlow_C_ExecuteUbergraph_BP_Growth_HouseGlow_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue;              // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_EqualEqual_FloatFloat_ReturnValue1;       // 0x7(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_FCeil_ReturnValue;                        // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchInteger_CmpSuccess;                   // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
