#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.Initialize
struct ULobbyPlayerAddPlayer_C_Initialize_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.ClearAllSelections
struct ULobbyPlayerAddPlayer_C_ClearAllSelections_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature
struct ULobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature
struct ULobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature
struct ULobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature_Params
{
public:
	class UCommonButton*                         Button;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.ForceHoveredState
struct ULobbyPlayerAddPlayer_C_ForceHoveredState_Params
{
public:
	bool                                         PlayerOnPodium;                                    // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.ForceUnhoveredState
struct ULobbyPlayerAddPlayer_C_ForceUnhoveredState_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.Construct
struct ULobbyPlayerAddPlayer_C_Construct_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.BndEvt__Athena_LFG_SuggestedPartyItem_v2_K2Node_ComponentBoundEvent_55_OnSuggestionMouseDown__DelegateSignature
struct ULobbyPlayerAddPlayer_C_BndEvt__Athena_LFG_SuggestedPartyItem_v2_K2Node_ComponentBoundEvent_55_OnSuggestionMouseDown__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.OnHotfixApplied
struct ULobbyPlayerAddPlayer_C_OnHotfixApplied_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.BndEvt__Athena_PartySuggestion_TempFix_K2Node_ComponentBoundEvent_13_OnSuggestionMouseDown__DelegateSignature
struct ULobbyPlayerAddPlayer_C_BndEvt__Athena_PartySuggestion_TempFix_K2Node_ComponentBoundEvent_13_OnSuggestionMouseDown__DelegateSignature_Params
{
public:
};

// 0x70 (0x70 - 0x0)
// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.ExecuteUbergraph_LobbyPlayerAddPlayer
struct ULobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5CB1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Variable;                                 // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Variable1;                                // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button2;                // 0x10(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                  CallFunc_GetContext_ReturnValue;                   // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                  CallFunc_GetContext_ReturnValue1;                  // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button1;                // 0x28(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x30(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_CustomEvent_PlayerOnPodium;                 // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsAnimationPlaying_ReturnValue;           // 0x39(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5CB2[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortFrontEndContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRuntimeOptions*                   CallFunc_GetRuntimeOptions_ReturnValue;            // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x50(0x10)(ZeroConstructor, NoDestructor)
	class UFortRuntimeOptions*                   CallFunc_GetRuntimeOptions_ReturnValue1;           // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_GetEnableXboxPartySuggestionTempFix_ReturnValue; // 0x68(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5CB3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        K2Node_Select_Default;                             // 0x6C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
