#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

namespace SDK
{
// 0xB2 (0x63A - 0x588)
// WidgetBlueprintGeneratedClass ShowdownEventTileInfo.ShowdownEventTileInfo_C
class UShowdownEventTileInfo_C : public UFortShowdownDetailView
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x588(0x8)(Transient, DuplicateTransient)
	class UWidgetAnimation*                      FocusPin;                                          // 0x590(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                      HideSocketShadow_Past;                             // 0x598(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                      HideSocketShadow;                                  // 0x5A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                      Focus;                                             // 0x5A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                      Focus_Ended;                                       // 0x5B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                      TransitionSize;                                    // 0x5B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                         CommonBorder_Date;                                 // 0x5C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                         CommonBorder_Score;                                // 0x5C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      CommonTextBlock_pts;                               // 0x5D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                 CommonWidgetSwitcher_EventPinState;                // 0x5D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                 CommonWidgetSwitcher_TimeFormat;                   // 0x5E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                 CommonWidgetSwitcher_TimeFormatTitle;              // 0x5E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      DateText;                                          // 0x5F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_Socket;                                      // 0x5F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ScaleBoxPin;                                       // 0x600(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      ScoreValue;                                        // 0x608(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownPin_C*                        ShowdownPin;                                       // 0x610(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      TimeDescriptionText;                               // 0x618(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      TimeDescriptionTextRelative;                       // 0x620(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                  SetEventState;                                     // 0x628(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         IsEnded;                                           // 0x638(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsPin;                                             // 0x639(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("ShowdownEventTileInfo_C");
		return Clss;
	}

	void RefreshDataBP();
	void EventAnimFocus(bool In);
	void EventStyleSocket();
	void EventAnimHover(bool In);
	void ExecuteUbergraph_ShowdownEventTileInfo(int32 EntryPoint, int32 CallFunc_GetBestEventScore_ReturnValue, bool Temp_bool_72ED84AB4C98074AA6535BB388508AA2_Variable, class FText CallFunc_Conv_IntToText_ReturnValue, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable1, bool Temp_bool_Variable, class FText Temp_text_Variable, float Temp_float_Variable, class FText Temp_text_Variable1, bool Temp_bool_0946E2F542D3E58D2DF5AD8828E70C6B_Variable, bool Temp_bool_350AB9004E0D10787BFA089D57BEC768_Variable, class FText Temp_text_Variable2, class FText Temp_text_Variable3, class FText Temp_text_Variable4, class FText Temp_text_Variable5, class FText Temp_text_Variable6, class FText Temp_text_Variable7, enum class EFortShowdownEventState Temp_byte_Variable2, bool Temp_bool_5E236A274A671720C9A584B56C9BC962_Variable, bool Temp_bool_Variable1, int32 Temp_int_Variable, int32 Temp_int_Variable1, bool Temp_bool_Variable2, bool Temp_bool_Variable3, float Temp_float_Variable1, bool Temp_bool_Variable4, bool Temp_bool_Variable5, bool Temp_bool_9045B955448D6CE77C8A75B37022249A_Variable, const struct FLinearColor& Temp_struct_Variable, const struct FLinearColor& Temp_struct_Variable1, bool Temp_bool_Variable6, enum class ESlateVisibility Temp_byte_Variable3, const struct FLinearColor& K2Node_Select_Default, enum class ESlateVisibility Temp_byte_Variable4, bool Temp_bool_94A9F2574E2E52B3531C0DBA00F4F08C_Variable, float Temp_float_Variable2, enum class ESlateVisibility Temp_byte_Variable5, enum class ESlateVisibility Temp_byte_Variable6, enum class ESlateVisibility Temp_byte_Variable7, enum class ESlateVisibility Temp_byte_Variable8, enum class ESlateVisibility Temp_byte_Variable9, enum class ESlateVisibility Temp_byte_Variable10, enum class EFortShowdownEventState Temp_byte_Variable11, bool Temp_bool_72783DB84378F07913227AA00BCCF2AB_Variable, class FText Temp_text_Variable8, class FText Temp_text_Variable9, class FText Temp_text_Variable10, class FText Temp_text_Variable11, class FText Temp_text_Variable12, enum class EFortShowdownEventState Temp_byte_Variable12, class FText Temp_text_Variable13, class FText Temp_text_Variable14, bool Temp_bool_5D4E88D247336B4B5CBE49B7FD8949B9_Variable, bool Temp_bool_Variable7, class FText Temp_text_Variable15, class FText Temp_text_Variable16, class FText Temp_text_Variable17, class FText Temp_text_Variable18, class FText Temp_text_Variable19, class FText Temp_text_Variable20, enum class EFortShowdownEventState Temp_byte_Variable13, enum class EFortShowdownEventState CallFunc_GetEventState_ReturnValue, class FText K2Node_Select1_Default, enum class ESlateVisibility K2Node_Select2_Default, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue1, bool CallFunc_EqualEqual_ByteByte_ReturnValue2, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue3, bool CallFunc_BooleanOR_ReturnValue1, enum class ESlateVisibility K2Node_Select3_Default, class FText K2Node_Select4_Default, float Temp_float_Variable3, bool Temp_bool_Variable8, float Temp_float_Variable4, bool Temp_bool_Variable9, float Temp_float_Variable5, bool K2Node_CustomEvent_In1, int32 K2Node_Select5_Default, bool Temp_bool_Variable10, class UWidgetAnimation* K2Node_Select6_Default, float CallFunc_PauseAnimation_ReturnValue, float CallFunc_GetStartTime_ReturnValue, float CallFunc_PauseAnimation_ReturnValue1, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_GetEndTime_ReturnValue, float CallFunc_PauseAnimation_ReturnValue2, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_GetStartTime_ReturnValue1, float K2Node_Select7_Default, bool CallFunc_LessEqual_FloatFloat_ReturnValue1, float CallFunc_PauseAnimation_ReturnValue3, float CallFunc_GetEndTime_ReturnValue1, float CallFunc_Add_FloatFloat_ReturnValue1, float CallFunc_Subtract_FloatFloat_ReturnValue1, float K2Node_Select8_Default, float Temp_float_Variable6, class UMaterialInstanceDynamic* CallFunc_GetDynamicMaterial_ReturnValue, bool Temp_bool_Variable11, class UWidgetAnimation* K2Node_Select9_Default, float CallFunc_PauseAnimation_ReturnValue4, float CallFunc_GetStartTime_ReturnValue2, float CallFunc_PauseAnimation_ReturnValue5, bool CallFunc_LessEqual_FloatFloat_ReturnValue2, float CallFunc_Add_FloatFloat_ReturnValue2, float CallFunc_GetEndTime_ReturnValue2, float CallFunc_PauseAnimation_ReturnValue6, float CallFunc_Subtract_FloatFloat_ReturnValue2, float CallFunc_GetStartTime_ReturnValue3, float K2Node_Select10_Default, bool CallFunc_LessEqual_FloatFloat_ReturnValue3, float CallFunc_PauseAnimation_ReturnValue7, float CallFunc_GetEndTime_ReturnValue3, float CallFunc_Add_FloatFloat_ReturnValue3, float CallFunc_Subtract_FloatFloat_ReturnValue3, float K2Node_Select11_Default, float Temp_float_Variable7, const class FString& CallFunc_GetEventId_ReturnValue, float CallFunc_PauseAnimation_ReturnValue8, float CallFunc_GetStartTime_ReturnValue4, float CallFunc_PauseAnimation_ReturnValue9, bool CallFunc_LessEqual_FloatFloat_ReturnValue4, float CallFunc_Add_FloatFloat_ReturnValue4, float CallFunc_GetEndTime_ReturnValue4, float CallFunc_Subtract_FloatFloat_ReturnValue4, float CallFunc_PauseAnimation_ReturnValue10, float CallFunc_GetStartTime_ReturnValue5, float CallFunc_PauseAnimation_ReturnValue11, bool CallFunc_LessEqual_FloatFloat_ReturnValue5, float CallFunc_Add_FloatFloat_ReturnValue5, float CallFunc_GetEndTime_ReturnValue5, enum class EFortShowdownPinState CallFunc_GetEventPinState_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue5, bool CallFunc_EqualEqual_ByteByte_ReturnValue4, float K2Node_Select12_Default, bool Temp_bool_Variable12, float CallFunc_PauseAnimation_ReturnValue12, float K2Node_Select13_Default, float CallFunc_GetStartTime_ReturnValue6, bool CallFunc_LessEqual_FloatFloat_ReturnValue6, float CallFunc_PauseAnimation_ReturnValue13, float CallFunc_Add_FloatFloat_ReturnValue6, float CallFunc_GetEndTime_ReturnValue6, float CallFunc_Subtract_FloatFloat_ReturnValue6, float CallFunc_PauseAnimation_ReturnValue14, float K2Node_Select14_Default, float CallFunc_GetStartTime_ReturnValue7, bool CallFunc_LessEqual_FloatFloat_ReturnValue7, float CallFunc_PauseAnimation_ReturnValue15, float CallFunc_Add_FloatFloat_ReturnValue7, float CallFunc_GetEndTime_ReturnValue7, float CallFunc_Subtract_FloatFloat_ReturnValue7, float K2Node_Select15_Default, bool K2Node_CustomEvent_In, const struct FDateTime& CallFunc_GetEventBeginTime_ReturnValue, class FText CallFunc_GetEventDateAsText_ReturnValue, int32 CallFunc_GetCurrentEventScore_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue1, class FText K2Node_Select16_Default);
	void SetEventState__DelegateSignature(enum class EFortShowdownEventState EventState);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
