#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function TimelineMarker.TimelineMarker_C.Construct
struct UTimelineMarker_C_Construct_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function TimelineMarker.TimelineMarker_C.BP_OnHovered
struct UTimelineMarker_C_BP_OnHovered_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function TimelineMarker.TimelineMarker_C.BP_OnUnhovered
struct UTimelineMarker_C_BP_OnUnhovered_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function TimelineMarker.TimelineMarker_C.BP_OnClicked
struct UTimelineMarker_C_BP_OnClicked_Params
{
public:
};

// 0x60 (0x60 - 0x0)
// Function TimelineMarker.TimelineMarker_C.ExecuteUbergraph_TimelineMarker
struct UTimelineMarker_C_ExecuteUbergraph_TimelineMarker_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFortReplayEventType              Temp_byte_Variable;                                // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_536C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            Temp_object_Variable;                              // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Temp_object_Variable1;                             // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Temp_object_Variable2;                             // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Temp_object_Variable3;                             // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortReplayContext*                    CallFunc_GetContext_ReturnValue;                   // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            K2Node_Select_Default;                             // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor;                      // 0x38(0x28)()
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
