#pragma once

// Name: Fortnite, Version: 1.9.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class FortniteGame.AIHotSpotSlot
// 0x0098 (0x00C0 - 0x0028)
class UAIHotSpotSlot : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	struct FTransform                                  LocalTransform;                                           // 0x0030(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              Height;                                                   // 0x0060(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5C];                                      // 0x0064(0x005C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.AIHotSpotSlot");
		return ptr;
	}

};


// Class FortniteGame.AIHotSpot
// 0x0188 (0x0510 - 0x0388)
class AAIHotSpot : public AActor
{
public:
	unsigned char                                      UnknownData00[0x188];                                     // 0x0388(0x0188) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.AIHotSpot");
		return ptr;
	}

};


// Class FortniteGame.AIHotSpotManagerProxy
// 0x0058 (0x0080 - 0x0028)
class UAIHotSpotManagerProxy : public UAIHotSpotManager
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0028(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.AIHotSpotManagerProxy");
		return ptr;
	}

};


// Class FortniteGame.FortInventorySortFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFortInventorySortFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortInventorySortFunctionLibrary");
		return ptr;
	}


	void STATIC_GetCriterionDisplayNameOfSortType();
};


// Class FortniteGame.FortBrushSizeFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFortBrushSizeFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortBrushSizeFunctionLibrary");
		return ptr;
	}


	void STATIC_ShrinkBrushSize();
	void STATIC_GrowBrushSize();
};


// Class FortniteGame.FortMultiSizeBrushAsset
// 0x0360 (0x0388 - 0x0028)
class UFortMultiSizeBrushAsset : public UDataAsset
{
public:
	struct FFortMultiSizeBrush                         Brush;                                                    // 0x0028(0x0360) (Edit, BlueprintVisible)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortMultiSizeBrushAsset");
		return ptr;
	}

};


// Class FortniteGame.BuildingActorHotSpotConfig
// 0x00F0 (0x0118 - 0x0028)
class UBuildingActorHotSpotConfig : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0xF0];                                      // 0x0028(0x00F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingActorHotSpotConfig");
		return ptr;
	}

};


// Class FortniteGame.FortAIHotSpotManager
// 0x0140 (0x01C0 - 0x0080)
class UFortAIHotSpotManager : public UAIHotSpotManagerProxy
{
public:
	unsigned char                                      UnknownData00[0x140];                                     // 0x0080(0x0140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAIHotSpotManager");
		return ptr;
	}

};


// Class FortniteGame.FortAIHotSpot
// 0x0028 (0x0538 - 0x0510)
class AFortAIHotSpot : public AAIHotSpot
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0510(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAIHotSpot");
		return ptr;
	}

};


// Class FortniteGame.FortMissionConfigData
// 0x0000 (0x0028 - 0x0028)
class UFortMissionConfigData : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortMissionConfigData");
		return ptr;
	}

};


// Class FortniteGame.FortMissionEventParams
// 0x0000 (0x0028 - 0x0028)
class UFortMissionEventParams : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortMissionEventParams");
		return ptr;
	}

};


// Class FortniteGame.FortStartMissionParams
// 0x0000 (0x0028 - 0x0028)
class UFortStartMissionParams : public UFortMissionEventParams
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortStartMissionParams");
		return ptr;
	}

};


// Class FortniteGame.FortItemCollectedParams
// 0x0018 (0x0040 - 0x0028)
class UFortItemCollectedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortItemCollectedParams");
		return ptr;
	}

};


// Class FortniteGame.FortItemDroppedParams
// 0x0018 (0x0040 - 0x0028)
class UFortItemDroppedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortItemDroppedParams");
		return ptr;
	}

};


// Class FortniteGame.FortItemCraftedParams
// 0x0018 (0x0040 - 0x0028)
class UFortItemCraftedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortItemCraftedParams");
		return ptr;
	}

};


// Class FortniteGame.FortEnemyKilledParams
// 0x0010 (0x0038 - 0x0028)
class UFortEnemyKilledParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortEnemyKilledParams");
		return ptr;
	}

};


// Class FortniteGame.FortEnemyDamagedParams
// 0x0018 (0x0040 - 0x0028)
class UFortEnemyDamagedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortEnemyDamagedParams");
		return ptr;
	}

};


// Class FortniteGame.FortNewPlayerParams
// 0x0008 (0x0030 - 0x0028)
class UFortNewPlayerParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortNewPlayerParams");
		return ptr;
	}

};


// Class FortniteGame.FortPlayerAbandonParams
// 0x0018 (0x0040 - 0x0028)
class UFortPlayerAbandonParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortPlayerAbandonParams");
		return ptr;
	}

};


// Class FortniteGame.FortPlayerExitParams
// 0x0008 (0x0030 - 0x0028)
class UFortPlayerExitParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortPlayerExitParams");
		return ptr;
	}

};


// Class FortniteGame.FortPlayerSpawnedParams
// 0x0008 (0x0030 - 0x0028)
class UFortPlayerSpawnedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortPlayerSpawnedParams");
		return ptr;
	}

};


// Class FortniteGame.FortPlayerDiedParams
// 0x0010 (0x0038 - 0x0028)
class UFortPlayerDiedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortPlayerDiedParams");
		return ptr;
	}

};


// Class FortniteGame.FortPlayerDBNOEnterParams
// 0x0010 (0x0038 - 0x0028)
class UFortPlayerDBNOEnterParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortPlayerDBNOEnterParams");
		return ptr;
	}

};


// Class FortniteGame.FortPlayerDBNORevivedParams
// 0x0010 (0x0038 - 0x0028)
class UFortPlayerDBNORevivedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortPlayerDBNORevivedParams");
		return ptr;
	}

};


// Class FortniteGame.FortDayPhaseChangeParams
// 0x0010 (0x0038 - 0x0028)
class UFortDayPhaseChangeParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortDayPhaseChangeParams");
		return ptr;
	}

};


// Class FortniteGame.FortPlayerBuiltParams
// 0x0018 (0x0040 - 0x0028)
class UFortPlayerBuiltParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortPlayerBuiltParams");
		return ptr;
	}

};


// Class FortniteGame.FortBuildingDestroyedParams
// 0x0018 (0x0040 - 0x0028)
class UFortBuildingDestroyedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortBuildingDestroyedParams");
		return ptr;
	}

};


// Class FortniteGame.FortBuildingEditedParams
// 0x0020 (0x0048 - 0x0028)
class UFortBuildingEditedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0028(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortBuildingEditedParams");
		return ptr;
	}

};


// Class FortniteGame.FortBuildingDamagedParams
// 0x0020 (0x0048 - 0x0028)
class UFortBuildingDamagedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x0028(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortBuildingDamagedParams");
		return ptr;
	}

};


// Class FortniteGame.FortMissionSucceededParams
// 0x0008 (0x0030 - 0x0028)
class UFortMissionSucceededParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortMissionSucceededParams");
		return ptr;
	}

};


// Class FortniteGame.FortMissionFailedParams
// 0x0008 (0x0030 - 0x0028)
class UFortMissionFailedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortMissionFailedParams");
		return ptr;
	}

};


// Class FortniteGame.FortMissionForceSuccessParams
// 0x0008 (0x0030 - 0x0028)
class UFortMissionForceSuccessParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortMissionForceSuccessParams");
		return ptr;
	}

};


// Class FortniteGame.FortMissionNeutralCompleteParams
// 0x0008 (0x0030 - 0x0028)
class UFortMissionNeutralCompleteParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortMissionNeutralCompleteParams");
		return ptr;
	}

};


// Class FortniteGame.FortObjectiveSucceededParams
// 0x0008 (0x0030 - 0x0028)
class UFortObjectiveSucceededParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortObjectiveSucceededParams");
		return ptr;
	}

};


// Class FortniteGame.FortObjectiveFailedParams
// 0x0008 (0x0030 - 0x0028)
class UFortObjectiveFailedParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortObjectiveFailedParams");
		return ptr;
	}

};


// Class FortniteGame.FortObjectiveNeutralCompleteParams
// 0x0008 (0x0030 - 0x0028)
class UFortObjectiveNeutralCompleteParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortObjectiveNeutralCompleteParams");
		return ptr;
	}

};


// Class FortniteGame.FortToggledCursorModeParams
// 0x0010 (0x0038 - 0x0028)
class UFortToggledCursorModeParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortToggledCursorModeParams");
		return ptr;
	}

};


// Class FortniteGame.FortToggledOptionsMenuParams
// 0x0010 (0x0038 - 0x0028)
class UFortToggledOptionsMenuParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortToggledOptionsMenuParams");
		return ptr;
	}

};


// Class FortniteGame.FortToggledEditModeParams
// 0x0018 (0x0040 - 0x0028)
class UFortToggledEditModeParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortToggledEditModeParams");
		return ptr;
	}

};


// Class FortniteGame.FortShutdownParams
// 0x0000 (0x0028 - 0x0028)
class UFortShutdownParams : public UFortMissionEventParams
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortShutdownParams");
		return ptr;
	}

};


// Class FortniteGame.FortPvPVictoryParams
// 0x0008 (0x0030 - 0x0028)
class UFortPvPVictoryParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortPvPVictoryParams");
		return ptr;
	}

};


// Class FortniteGame.FortStartLeavingZoneParams
// 0x0008 (0x0030 - 0x0028)
class UFortStartLeavingZoneParams : public UFortMissionEventParams
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortStartLeavingZoneParams");
		return ptr;
	}

};


// Class FortniteGame.FortInteractInterface
// 0x0000 (0x0028 - 0x0028)
class UFortInteractInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortInteractInterface");
		return ptr;
	}


	void ServerOnAttemptInteract();
};


// Class FortniteGame.FortAttributeSet
// 0x0000 (0x0030 - 0x0030)
class UFortAttributeSet : public UAttributeSet
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAttributeSet");
		return ptr;
	}

};


// Class FortniteGame.FortDamageableActorInterface
// 0x0000 (0x0028 - 0x0028)
class UFortDamageableActorInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortDamageableActorInterface");
		return ptr;
	}

};


// Class FortniteGame.FortTeamActorInterface
// 0x0000 (0x0028 - 0x0028)
class UFortTeamActorInterface : public UGenericTeamAgentInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTeamActorInterface");
		return ptr;
	}


	void GetTeam();
};


// Class FortniteGame.FortInitializationInterface
// 0x0000 (0x0028 - 0x0028)
class UFortInitializationInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortInitializationInterface");
		return ptr;
	}


	void WorldReady();
	void NeedsWorldReady();
	void MatchStarted();
};


// Class FortniteGame.FortSpawnableByPlacementSystemInterface
// 0x0000 (0x0028 - 0x0028)
class UFortSpawnableByPlacementSystemInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortSpawnableByPlacementSystemInterface");
		return ptr;
	}


	void GetMissionGuid();
	void GetMission();
};


// Class FortniteGame.FortAbilitySystemInterface
// 0x0000 (0x0028 - 0x0028)
class UFortAbilitySystemInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAbilitySystemInterface");
		return ptr;
	}

};


// Class FortniteGame.BuildingActor
// 0x03B8 (0x0740 - 0x0388)
class ABuildingActor : public AActor
{
public:
	unsigned char                                      UnknownData00[0x68];                                      // 0x0388(0x0068) MISSED OFFSET
	TEnumAsByte<EFortBuildingType>                     BuildingType;                                             // 0x03F0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x34F];                                     // 0x03F1(0x034F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingActor");
		return ptr;
	}

};


// Class FortniteGame.FortCrackEffect
// 0x00C8 (0x0450 - 0x0388)
class AFortCrackEffect : public AActor
{
public:
	unsigned char                                      UnknownData00[0xC8];                                      // 0x0388(0x00C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortCrackEffect");
		return ptr;
	}

};


// Class FortniteGame.FortAttachToActorInterface
// 0x0000 (0x0028 - 0x0028)
class UFortAttachToActorInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAttachToActorInterface");
		return ptr;
	}


	void GetActorAttachedTo();
};


// Class FortniteGame.BuildingSMActor
// 0x0880 (0x0FC0 - 0x0740)
class ABuildingSMActor : public ABuildingActor
{
public:
	unsigned char                                      UnknownData00[0x880];                                     // 0x0740(0x0880) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingSMActor");
		return ptr;
	}

};


// Class FortniteGame.BuildingEditModeSupport
// 0x0268 (0x0290 - 0x0028)
class UBuildingEditModeSupport : public UObject
{
public:
	unsigned char                                      UnknownData00[0x268];                                     // 0x0028(0x0268) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingEditModeSupport");
		return ptr;
	}

};


// Class FortniteGame.BuildingStructuralSupportSystem
// 0x0448 (0x0470 - 0x0028)
class UBuildingStructuralSupportSystem : public UObject
{
public:
	unsigned char                                      UnknownData00[0x448];                                     // 0x0028(0x0448) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingStructuralSupportSystem");
		return ptr;
	}

};


// Class FortniteGame.FortAIHotSpot_Building
// 0x0088 (0x05C0 - 0x0538)
class AFortAIHotSpot_Building : public AFortAIHotSpot
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x0538(0x0088) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAIHotSpot_Building");
		return ptr;
	}

};


// Class FortniteGame.FortAIHotSpot_FakeBuilding
// 0x0000 (0x0538 - 0x0538)
class AFortAIHotSpot_FakeBuilding : public AFortAIHotSpot
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAIHotSpot_FakeBuilding");
		return ptr;
	}

};


// Class FortniteGame.FortAIHotSpot_Shooting
// 0x0000 (0x0538 - 0x0538)
class AFortAIHotSpot_Shooting : public AFortAIHotSpot
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAIHotSpot_Shooting");
		return ptr;
	}

};


// Class FortniteGame.AIHotSpotConfig
// 0x0020 (0x0048 - 0x0028)
class UAIHotSpotConfig : public UDataAsset
{
public:
	TArray<struct FAIHotSpotSlotConfig>                Slots;                                                    // 0x0028(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0038(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.AIHotSpotConfig");
		return ptr;
	}

};


// Class FortniteGame.AIHotSpotRenderingComponent
// 0x0000 (0x0670 - 0x0670)
class UAIHotSpotRenderingComponent : public UPrimitiveComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.AIHotSpotRenderingComponent");
		return ptr;
	}

};


// Class FortniteGame.FortAIHotSpotSlot
// 0x0010 (0x00D0 - 0x00C0)
class UFortAIHotSpotSlot : public UAIHotSpotSlot
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x00C0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAIHotSpotSlot");
		return ptr;
	}

};


// Class FortniteGame.AIHotSpotSlotGenerator
// 0x0000 (0x0028 - 0x0028)
class UAIHotSpotSlotGenerator : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.AIHotSpotSlotGenerator");
		return ptr;
	}


	void GetHotSpot();
	void GenerateSlots();
	void AddSlot();
};


// Class FortniteGame.AIHotSpotSlotGenerator_OnBoundingBox
// 0x0048 (0x0070 - 0x0028)
class UAIHotSpotSlotGenerator_OnBoundingBox : public UAIHotSpotSlotGenerator
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0028(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.AIHotSpotSlotGenerator_OnBoundingBox");
		return ptr;
	}

};


// Class FortniteGame.FortAIHotSpotSlotGenerator_OnBoundingBox
// 0x0008 (0x0078 - 0x0070)
class UFortAIHotSpotSlotGenerator_OnBoundingBox : public UAIHotSpotSlotGenerator_OnBoundingBox
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0070(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAIHotSpotSlotGenerator_OnBoundingBox");
		return ptr;
	}

};


// Class FortniteGame.FortAIHotSpotSlotGenerator_FromConfig
// 0x0018 (0x0040 - 0x0028)
class UFortAIHotSpotSlotGenerator_FromConfig : public UAIHotSpotSlotGenerator
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAIHotSpotSlotGenerator_FromConfig");
		return ptr;
	}

};


// Class FortniteGame.FortAIHotSpotSlotGenerator_RampTrace
// 0x0018 (0x0040 - 0x0028)
class UFortAIHotSpotSlotGenerator_RampTrace : public UAIHotSpotSlotGenerator
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0028(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAIHotSpotSlotGenerator_RampTrace");
		return ptr;
	}

};


// Class FortniteGame.AthenaGameData
// 0x0078 (0x00A0 - 0x0028)
class UAthenaGameData : public UPrimaryDataAsset
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x0028(0x0078) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.AthenaGameData");
		return ptr;
	}

};


// Class FortniteGame.AutomationPerfMonitorManager
// 0x0088 (0x00B0 - 0x0028)
class UAutomationPerfMonitorManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x0028(0x0088) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.AutomationPerfMonitorManager");
		return ptr;
	}

};


// Class FortniteGame.FortAbilitySet
// 0x0028 (0x0050 - 0x0028)
class UFortAbilitySet : public UPrimaryDataAsset
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	TArray<class UClass*>                              GameplayAbilities;                                        // 0x0030(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0040(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAbilitySet");
		return ptr;
	}

};


// Class FortniteGame.FortDamageSourceInterface
// 0x0000 (0x0028 - 0x0028)
class UFortDamageSourceInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortDamageSourceInterface");
		return ptr;
	}

};


// Class FortniteGame.FortTargetSelectionInterface
// 0x0000 (0x0028 - 0x0028)
class UFortTargetSelectionInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTargetSelectionInterface");
		return ptr;
	}


	void GetTargetingTransform(EFortAbilityTargetingSource Source);
};


// Class FortniteGame.BuildingGameplayActor
// 0x0100 (0x0840 - 0x0740)
class ABuildingGameplayActor : public ABuildingActor
{
public:
	unsigned char                                      UnknownData00[0x100];                                     // 0x0740(0x0100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingGameplayActor");
		return ptr;
	}

};


// Class FortniteGame.BuildingCapturePointActor
// 0x00A0 (0x08E0 - 0x0840)
class ABuildingCapturePointActor : public ABuildingGameplayActor
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0840(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingCapturePointActor");
		return ptr;
	}

};


// Class FortniteGame.FortCarriedObjectHolderInterface
// 0x0000 (0x0028 - 0x0028)
class UFortCarriedObjectHolderInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortCarriedObjectHolderInterface");
		return ptr;
	}


	void OnCarriedObjectDetach();
	void OnCarriedObjectAttach();
	void GetCarriedObjectAttachmentInfo();
	void GetAttachmentComponent();
	void CanHoldObject();
};


// Class FortniteGame.BuildingFlagSpawn
// 0x0060 (0x08A0 - 0x0840)
class ABuildingFlagSpawn : public ABuildingGameplayActor
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0840(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingFlagSpawn");
		return ptr;
	}

};


// Class FortniteGame.FortItemTypeFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFortItemTypeFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortItemTypeFunctionLibrary");
		return ptr;
	}


	void STATIC_ToText(EFortItemType ItemType);
};


// Class FortniteGame.FortGenericRecord
// 0x00A8 (0x00D0 - 0x0028)
class UFortGenericRecord : public UObject
{
public:
	unsigned char                                      UnknownData00[0xA8];                                      // 0x0028(0x00A8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortGenericRecord");
		return ptr;
	}

};


// Class FortniteGame.FortTooltipInterface
// 0x0000 (0x0028 - 0x0028)
class UFortTooltipInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTooltipInterface");
		return ptr;
	}


	void GetTooltip();
	void GetDisplayStats();
};


// Class FortniteGame.FortTooltipContext
// 0x0040 (0x0068 - 0x0028)
class UFortTooltipContext : public UObject
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0028(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTooltipContext");
		return ptr;
	}

};


// Class FortniteGame.FortTooltipMap
// 0x0060 (0x0088 - 0x0028)
class UFortTooltipMap : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0028(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTooltipMap");
		return ptr;
	}

};


// Class FortniteGame.FortTooltipManager
// 0x0058 (0x0080 - 0x0028)
class UFortTooltipManager : public UObject
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0028(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTooltipManager");
		return ptr;
	}

};


// Class FortniteGame.FortTooltip
// 0x0068 (0x0090 - 0x0028)
class UFortTooltip : public UObject
{
public:
	struct FText                                       Description;                                              // 0x0028(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x50];                                      // 0x0040(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTooltip");
		return ptr;
	}


	void SetLocalizationText(const struct FString& Name);
	void SetLocalizationInt(const struct FString& Name);
	void SetLocalizationFloat(const struct FString& Name);
	void GetValueData();
	void GetTokenizedDescriptionText();
	void GetTextForToken();
	void GetNumericValue();
	void BP_GetValueData();
	void BP_GetTokenizedDescriptionText();
	void BP_GetTextForToken();
	void BP_GetNumericValue();
};


// Class FortniteGame.FortTooltipDisplayStatsList
// 0x0010 (0x0038 - 0x0028)
class UFortTooltipDisplayStatsList : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTooltipDisplayStatsList");
		return ptr;
	}

};


// Class FortniteGame.FortTooltipDisplayStatsLookupTable
// 0x0060 (0x0088 - 0x0028)
class UFortTooltipDisplayStatsLookupTable : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0028(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTooltipDisplayStatsLookupTable");
		return ptr;
	}

};


// Class FortniteGame.FortItemDefinition
// 0x0218 (0x0240 - 0x0028)
class UFortItemDefinition : public UMcpItemDefinitionBase
{
public:
	unsigned char                                      UnknownData00[0x218];                                     // 0x0028(0x0218) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortItemDefinition");
		return ptr;
	}

};


// Class FortniteGame.FortItemIconDefinition
// 0x0120 (0x0148 - 0x0028)
class UFortItemIconDefinition : public UDataAsset
{
public:
	struct FSlateBrush                                 Brush;                                                    // 0x0028(0x0090) (Edit)
	unsigned char                                      UnknownData00[0x90];                                      // 0x00B8(0x0090) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortItemIconDefinition");
		return ptr;
	}

};


// Class FortniteGame.FortItem
// 0x00A8 (0x00D0 - 0x0028)
class UFortItem : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnItemChanged;                                            // 0x0030(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData01[0x70];                                      // 0x0040(0x0070) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnItemDestroyed;                                          // 0x00B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData02[0x10];                                      // 0x00C0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortItem");
		return ptr;
	}

};


// Class FortniteGame.FortPickupEffect
// 0x0040 (0x03C8 - 0x0388)
class AFortPickupEffect : public AActor
{
public:
	class UStaticMesh*                                 StaticMesh;                                               // 0x0388(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USkeletalMesh*                               SkeletalMesh;                                             // 0x0390(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x30];                                      // 0x0398(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortPickupEffect");
		return ptr;
	}

};


// Class FortniteGame.FortWorldItemDefinition
// 0x0200 (0x0440 - 0x0240)
class UFortWorldItemDefinition : public UFortItemDefinition
{
public:
	unsigned char                                      UnknownData00[0x200];                                     // 0x0240(0x0200) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortWorldItemDefinition");
		return ptr;
	}

};


// Class FortniteGame.FortQuickBars
// 0x0328 (0x06B0 - 0x0388)
class AFortQuickBars : public AActor
{
public:
	unsigned char                                      UnknownData00[0x328];                                     // 0x0388(0x0328) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortQuickBars");
		return ptr;
	}

};


// Class FortniteGame.FortMetadataItemDefinition
// 0x0000 (0x0240 - 0x0240)
class UFortMetadataItemDefinition : public UFortItemDefinition
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortMetadataItemDefinition");
		return ptr;
	}

};


// Class FortniteGame.FortCloudSaveItemDefinition
// 0x0010 (0x0250 - 0x0240)
class UFortCloudSaveItemDefinition : public UFortMetadataItemDefinition
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0240(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortCloudSaveItemDefinition");
		return ptr;
	}

};


// Class FortniteGame.FortWorldRecord
// 0x0148 (0x0218 - 0x00D0)
class UFortWorldRecord : public UFortGenericRecord
{
public:
	unsigned char                                      UnknownData00[0x148];                                     // 0x00D0(0x0148) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortWorldRecord");
		return ptr;
	}

};


// Class FortniteGame.FortZoneRecord
// 0x01D0 (0x02A0 - 0x00D0)
class UFortZoneRecord : public UFortGenericRecord
{
public:
	unsigned char                                      UnknownData00[0x1D0];                                     // 0x00D0(0x01D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortZoneRecord");
		return ptr;
	}

};


// Class FortniteGame.FortBuildingInstructions
// 0x00B0 (0x00D8 - 0x0028)
class UFortBuildingInstructions : public UDataAsset
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x0028(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortBuildingInstructions");
		return ptr;
	}

};


// Class FortniteGame.BuildingFOBCoreSpawnPad
// 0x0000 (0x0840 - 0x0840)
class ABuildingFOBCoreSpawnPad : public ABuildingGameplayActor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingFOBCoreSpawnPad");
		return ptr;
	}


	void GetCoreSpawnTransform();
};


// Class FortniteGame.BuildingFOBConfigActor
// 0x02F0 (0x0B30 - 0x0840)
class ABuildingFOBConfigActor : public ABuildingGameplayActor
{
public:
	unsigned char                                      UnknownData00[0x2F0];                                     // 0x0840(0x02F0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingFOBConfigActor");
		return ptr;
	}

};


// Class FortniteGame.BuildingFOBCoreActor
// 0x0110 (0x0950 - 0x0840)
class ABuildingFOBCoreActor : public ABuildingGameplayActor
{
public:
	unsigned char                                      UnknownData00[0x110];                                     // 0x0840(0x0110) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingFOBCoreActor");
		return ptr;
	}

};


// Class FortniteGame.BuildingItemCollectorActor
// 0x00C0 (0x0900 - 0x0840)
class ABuildingItemCollectorActor : public ABuildingGameplayActor
{
public:
	unsigned char                                      UnknownData00[0xC0];                                      // 0x0840(0x00C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingItemCollectorActor");
		return ptr;
	}

};


// Class FortniteGame.DecoyActor
// 0x0010 (0x0850 - 0x0840)
class ADecoyActor : public ABuildingGameplayActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0840(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.DecoyActor");
		return ptr;
	}

};


// Class FortniteGame.DeployableBaseCore
// 0x0050 (0x0890 - 0x0840)
class ADeployableBaseCore : public ABuildingGameplayActor
{
public:
	unsigned char                                      UnknownData00[0x50];                                      // 0x0840(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.DeployableBaseCore");
		return ptr;
	}

};


// Class FortniteGame.FortInventoryOwnerInterface
// 0x0000 (0x0028 - 0x0028)
class UFortInventoryOwnerInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortInventoryOwnerInterface");
		return ptr;
	}

};


// Class FortniteGame.FortInventoryInterface
// 0x0000 (0x0028 - 0x0028)
class UFortInventoryInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortInventoryInterface");
		return ptr;
	}

};


// Class FortniteGame.FortInventory
// 0x01D8 (0x0560 - 0x0388)
class AFortInventory : public AActor
{
public:
	unsigned char                                      UnknownData00[0x1D8];                                     // 0x0388(0x01D8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortInventory");
		return ptr;
	}

};


// Class FortniteGame.DeployableBasePlot
// 0x02C0 (0x0B00 - 0x0840)
class ADeployableBasePlot : public ABuildingGameplayActor
{
public:
	unsigned char                                      UnknownData00[0x2C0];                                     // 0x0840(0x02C0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.DeployableBasePlot");
		return ptr;
	}

};


// Class FortniteGame.FortAthenaSupplyDrop
// 0x0010 (0x0850 - 0x0840)
class AFortAthenaSupplyDrop : public ABuildingGameplayActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0840(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAthenaSupplyDrop");
		return ptr;
	}

};


// Class FortniteGame.SBAGrantedBuildingGameplayActor
// 0x0010 (0x0850 - 0x0840)
class ASBAGrantedBuildingGameplayActor : public ABuildingGameplayActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0840(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.SBAGrantedBuildingGameplayActor");
		return ptr;
	}

};


// Class FortniteGame.FortIndicator
// 0x0028 (0x0050 - 0x0028)
class UFortIndicator : public UObject
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0028(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortIndicator");
		return ptr;
	}

};


// Class FortniteGame.FortMiniMapIndicator
// 0x02D0 (0x0320 - 0x0050)
class UFortMiniMapIndicator : public UFortIndicator
{
public:
	unsigned char                                      UnknownData00[0x2D0];                                     // 0x0050(0x02D0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortMiniMapIndicator");
		return ptr;
	}

};


// Class FortniteGame.FortGameplayAbility
// 0x04B0 (0x0A40 - 0x0590)
class UFortGameplayAbility : public UGameplayAbility
{
public:
	unsigned char                                      UnknownData00[0x4B0];                                     // 0x0590(0x04B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortGameplayAbility");
		return ptr;
	}

};


// Class FortniteGame.StrategicBuildingActor
// 0x0140 (0x0980 - 0x0840)
class AStrategicBuildingActor : public ABuildingGameplayActor
{
public:
	unsigned char                                      UnknownData00[0x140];                                     // 0x0840(0x0140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.StrategicBuildingActor");
		return ptr;
	}

};


// Class FortniteGame.FortPvPBaseCornerstone
// 0x0030 (0x09B0 - 0x0980)
class AFortPvPBaseCornerstone : public AStrategicBuildingActor
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x0980(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortPvPBaseCornerstone");
		return ptr;
	}

};


// Class FortniteGame.BuildingRift
// 0x00A0 (0x07E0 - 0x0740)
class ABuildingRift : public ABuildingActor
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0740(0x00A0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingRift");
		return ptr;
	}

};


// Class FortniteGame.FortTakerRift
// 0x0020 (0x0800 - 0x07E0)
class AFortTakerRift : public ABuildingRift
{
public:
	unsigned char                                      UnknownData00[0x20];                                      // 0x07E0(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTakerRift");
		return ptr;
	}

};


// Class FortniteGame.BuildingAutoNav
// 0x0010 (0x0FD0 - 0x0FC0)
class ABuildingAutoNav : public ABuildingSMActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0FC0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingAutoNav");
		return ptr;
	}

};


// Class FortniteGame.BuildingContainer
// 0x0100 (0x10D0 - 0x0FD0)
class ABuildingContainer : public ABuildingAutoNav
{
public:
	unsigned char                                      UnknownData00[0x100];                                     // 0x0FD0(0x0100) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingContainer");
		return ptr;
	}

};


// Class FortniteGame.KeepItemContainer
// 0x0070 (0x1140 - 0x10D0)
class AKeepItemContainer : public ABuildingContainer
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x10D0(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.KeepItemContainer");
		return ptr;
	}

};


// Class FortniteGame.KeepItemCoreContainer
// 0x0000 (0x1140 - 0x1140)
class AKeepItemCoreContainer : public AKeepItemContainer
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.KeepItemCoreContainer");
		return ptr;
	}

};


// Class FortniteGame.BuildingCorner
// 0x0010 (0x0FE0 - 0x0FD0)
class ABuildingCorner : public ABuildingAutoNav
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0FD0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingCorner");
		return ptr;
	}

};


// Class FortniteGame.BuildingPropCorner
// 0x0000 (0x0FE0 - 0x0FE0)
class ABuildingPropCorner : public ABuildingCorner
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingPropCorner");
		return ptr;
	}

};


// Class FortniteGame.BuildingDeco
// 0x0000 (0x0FD0 - 0x0FD0)
class ABuildingDeco : public ABuildingAutoNav
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingDeco");
		return ptr;
	}

};


// Class FortniteGame.BuildingPillar
// 0x0000 (0x0FD0 - 0x0FD0)
class ABuildingPillar : public ABuildingAutoNav
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingPillar");
		return ptr;
	}

};


// Class FortniteGame.BuildingProp
// 0x0000 (0x0FD0 - 0x0FD0)
class ABuildingProp : public ABuildingAutoNav
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingProp");
		return ptr;
	}

};


// Class FortniteGame.BuildingPropAtlas
// 0x0140 (0x1110 - 0x0FD0)
class ABuildingPropAtlas : public ABuildingProp
{
public:
	unsigned char                                      UnknownData00[0x140];                                     // 0x0FD0(0x0140) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingPropAtlas");
		return ptr;
	}

};


// Class FortniteGame.BuildingPropWall
// 0x0010 (0x0FE0 - 0x0FD0)
class ABuildingPropWall : public ABuildingProp
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0FD0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingPropWall");
		return ptr;
	}

};


// Class FortniteGame.FortAccountItemDefinition
// 0x0060 (0x02A0 - 0x0240)
class UFortAccountItemDefinition : public UFortItemDefinition
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0240(0x0060) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAccountItemDefinition");
		return ptr;
	}

};


// Class FortniteGame.FortAlterationItemDefinition
// 0x0940 (0x0BE0 - 0x02A0)
class UFortAlterationItemDefinition : public UFortAccountItemDefinition
{
public:
	unsigned char                                      UnknownData00[0x940];                                     // 0x02A0(0x0940) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAlterationItemDefinition");
		return ptr;
	}

};


// Class FortniteGame.FortAlterationFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFortAlterationFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortAlterationFunctionLibrary");
		return ptr;
	}


	void STATIC_GetAlterationImpactPhysicalSurfaceEffects();
};


// Class FortniteGame.FortWeaponItemDefinition
// 0x0210 (0x0650 - 0x0440)
class UFortWeaponItemDefinition : public UFortWorldItemDefinition
{
public:
	unsigned char                                      UnknownData00[0x210];                                     // 0x0440(0x0210) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortWeaponItemDefinition");
		return ptr;
	}

};


// Class FortniteGame.FortConstructorBASE
// 0x0390 (0x1360 - 0x0FD0)
class AFortConstructorBASE : public ABuildingProp
{
public:
	unsigned char                                      UnknownData00[0x390];                                     // 0x0FD0(0x0390) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortConstructorBASE");
		return ptr;
	}

};


// Class FortniteGame.FortOutpostBuilding
// 0x0000 (0x0FD0 - 0x0FD0)
class AFortOutpostBuilding : public ABuildingProp
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortOutpostBuilding");
		return ptr;
	}

};


// Class FortniteGame.FortTrack
// 0x0190 (0x1160 - 0x0FD0)
class AFortTrack : public ABuildingProp
{
public:
	unsigned char                                      UnknownData00[0x190];                                     // 0x0FD0(0x0190) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTrack");
		return ptr;
	}

};


// Class FortniteGame.OutpostStructureBase
// 0x0000 (0x0FD0 - 0x0FD0)
class AOutpostStructureBase : public ABuildingProp
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.OutpostStructureBase");
		return ptr;
	}

};


// Class FortniteGame.BuildingOutpostCraftingTable
// 0x0000 (0x0FD0 - 0x0FD0)
class ABuildingOutpostCraftingTable : public AOutpostStructureBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingOutpostCraftingTable");
		return ptr;
	}

};


// Class FortniteGame.BuildingOutpostFabricator
// 0x0000 (0x0FD0 - 0x0FD0)
class ABuildingOutpostFabricator : public AOutpostStructureBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingOutpostFabricator");
		return ptr;
	}

};


// Class FortniteGame.BuildingOutpostStorageVault
// 0x0000 (0x0FD0 - 0x0FD0)
class ABuildingOutpostStorageVault : public AOutpostStructureBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingOutpostStorageVault");
		return ptr;
	}

};


// Class FortniteGame.BuildingOutpostStormshieldUpgrade
// 0x0000 (0x0FD0 - 0x0FD0)
class ABuildingOutpostStormshieldUpgrade : public AOutpostStructureBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingOutpostStormshieldUpgrade");
		return ptr;
	}

};


// Class FortniteGame.BuildingOutpostStormshieldCore
// 0x0000 (0x0FD0 - 0x0FD0)
class ABuildingOutpostStormshieldCore : public ABuildingOutpostStormshieldUpgrade
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingOutpostStormshieldCore");
		return ptr;
	}

};


// Class FortniteGame.BuildingFloor
// 0x0010 (0x0FD0 - 0x0FC0)
class ABuildingFloor : public ABuildingSMActor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0FC0(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingFloor");
		return ptr;
	}

};


// Class FortniteGame.BuildingStairs
// 0x0000 (0x0FD0 - 0x0FD0)
class ABuildingStairs : public ABuildingFloor
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.BuildingStairs");
		return ptr;
	}

};


// Class FortniteGame.FortGlobals
// 0x0228 (0x0250 - 0x0028)
class UFortGlobals : public UObject
{
public:
	unsigned char                                      UnknownData00[0x228];                                     // 0x0028(0x0228) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortGlobals");
		return ptr;
	}

};


// Class FortniteGame.ThreatCloud
// 0x01C8 (0x0550 - 0x0388)
class AThreatCloud : public AActor
{
public:
	unsigned char                                      UnknownData00[0x1C8];                                     // 0x0388(0x01C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.ThreatCloud");
		return ptr;
	}

};


// Class FortniteGame.FortThreatVisualsManager
// 0x0200 (0x0588 - 0x0388)
class AFortThreatVisualsManager : public AActor
{
public:
	unsigned char                                      UnknownData00[0x200];                                     // 0x0388(0x0200) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortThreatVisualsManager");
		return ptr;
	}

};


// Class FortniteGame.FortTimeOfDayManager
// 0x0868 (0x0BF0 - 0x0388)
class AFortTimeOfDayManager : public AInfo
{
public:
	unsigned char                                      UnknownData00[0x868];                                     // 0x0388(0x0868) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortTimeOfDayManager");
		return ptr;
	}

};


// Class FortniteGame.FortMusicManager
// 0x0048 (0x03D0 - 0x0388)
class AFortMusicManager : public AActor
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0388(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteGame.FortMusicManager");
		return ptr;
	}

};


// Class FortniteGame.FortWorldSettings
// 0x0248 (0x0778 - 0x0530)
class AFortWorldSettings : public AWorldSettings
{
public:
	unsigned char                                      UnknownData00[0x248];                                     // 0x0530(0x0248) MISSED OFFSET

	static UClass* StaticClass()
	{
