#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function BriteBomber_GliderChute_AnimBP.BriteBomber_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BriteBomber_GliderChute_AnimBP_AnimGraphNode_TransitionResult_67E3ED4843DA37DD210A63B32C13F845
struct UBriteBomber_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BriteBomber_GliderChute_AnimBP_AnimGraphNode_TransitionResult_67E3ED4843DA37DD210A63B32C13F845_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BriteBomber_GliderChute_AnimBP.BriteBomber_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BriteBomber_GliderChute_AnimBP_AnimGraphNode_TransitionResult_5740D2DB4345D1C76FDE51A999B4AC82
struct UBriteBomber_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BriteBomber_GliderChute_AnimBP_AnimGraphNode_TransitionResult_5740D2DB4345D1C76FDE51A999B4AC82_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BriteBomber_GliderChute_AnimBP.BriteBomber_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BriteBomber_GliderChute_AnimBP_AnimGraphNode_TransitionResult_2AB838344513C45252EB0C81DDE67084
struct UBriteBomber_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BriteBomber_GliderChute_AnimBP_AnimGraphNode_TransitionResult_2AB838344513C45252EB0C81DDE67084_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BriteBomber_GliderChute_AnimBP.BriteBomber_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BriteBomber_GliderChute_AnimBP_AnimGraphNode_BlendSpacePlayer_60D985E04445E86C1BD168B73582AA91
struct UBriteBomber_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BriteBomber_GliderChute_AnimBP_AnimGraphNode_BlendSpacePlayer_60D985E04445E86C1BD168B73582AA91_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function BriteBomber_GliderChute_AnimBP.BriteBomber_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BriteBomber_GliderChute_AnimBP_AnimGraphNode_TransitionResult_DBB24C314EDD3301D89D58849E8F9240
struct UBriteBomber_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_BriteBomber_GliderChute_AnimBP_AnimGraphNode_TransitionResult_DBB24C314EDD3301D89D58849E8F9240_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function BriteBomber_GliderChute_AnimBP.BriteBomber_GliderChute_AnimBP_C.BlueprintUpdateAnimation
struct UBriteBomber_GliderChute_AnimBP_C_BlueprintUpdateAnimation_Params
{
public:
	//float                                      DeltaTimeX;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x58 (0x58 - 0x0)
// Function BriteBomber_GliderChute_AnimBP.BriteBomber_GliderChute_AnimBP_C.ExecuteUbergraph_BriteBomber_GliderChute_AnimBP
struct UBriteBomber_GliderChute_AnimBP_C_ExecuteUbergraph_BriteBomber_GliderChute_AnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DDC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                CallFunc_GetOwningActor_ReturnValue;               // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerParachute*                  K2Node_DynamicCast_AsFort_Player_Parachute;        // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x19(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4DDD[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerPawn*                       CallFunc_GetFortPlayerPawn_ReturnValue;            // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                       K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess1;                      // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4DDE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimInstance*                         CallFunc_GetAnimInstance_ReturnValue;              // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortnite_M_Avg_Player_AnimBlueprint_C* K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint; // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess12;                     // 0x48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4DDF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x50(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue1;                 // 0x51(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4DE0[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        K2Node_Event_DeltaTimeX;                           // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
