#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function Carbide_GliderChute_AnimBP.Carbide_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_TransitionResult_8AA921104B841B362E4FC2A293E85ABC
struct UCarbide_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_TransitionResult_8AA921104B841B362E4FC2A293E85ABC_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Carbide_GliderChute_AnimBP.Carbide_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_TransitionResult_E04E997240880BCA3CE1878A391471B8
struct UCarbide_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_TransitionResult_E04E997240880BCA3CE1878A391471B8_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Carbide_GliderChute_AnimBP.Carbide_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_BlendSpacePlayer_3A87BA0E4BA250557F4D51BA149D83C1
struct UCarbide_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_BlendSpacePlayer_3A87BA0E4BA250557F4D51BA149D83C1_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Carbide_GliderChute_AnimBP.Carbide_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_TransitionResult_4EADF24044D4F8CC4DCCE9ACB8382F31
struct UCarbide_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_TransitionResult_4EADF24044D4F8CC4DCCE9ACB8382F31_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Carbide_GliderChute_AnimBP.Carbide_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_BlendSpacePlayer_269B86374FCC6E76D97C6F95D95C73E0
struct UCarbide_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_BlendSpacePlayer_269B86374FCC6E76D97C6F95D95C73E0_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Carbide_GliderChute_AnimBP.Carbide_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_BlendSpacePlayer_61F66877472CBC9AC03996AF5DAE875A
struct UCarbide_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_BlendSpacePlayer_61F66877472CBC9AC03996AF5DAE875A_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Carbide_GliderChute_AnimBP.Carbide_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_TransitionResult_85236D0F4B241E1FD020DAB6D126D8E6
struct UCarbide_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Carbide_GliderChute_AnimBP_AnimGraphNode_TransitionResult_85236D0F4B241E1FD020DAB6D126D8E6_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function Carbide_GliderChute_AnimBP.Carbide_GliderChute_AnimBP_C.BlueprintUpdateAnimation
struct UCarbide_GliderChute_AnimBP_C_BlueprintUpdateAnimation_Params
{
public:
	//float                                      DeltaTimeX;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function Carbide_GliderChute_AnimBP.Carbide_GliderChute_AnimBP_C.AnimNotify_TurnONEngines
struct UCarbide_GliderChute_AnimBP_C_AnimNotify_TurnONEngines_Params
{
public:
};

// 0x79 (0x79 - 0x0)
// Function Carbide_GliderChute_AnimBP.Carbide_GliderChute_AnimBP_C.ExecuteUbergraph_Carbide_GliderChute_AnimBP
struct UCarbide_GliderChute_AnimBP_C_ExecuteUbergraph_Carbide_GliderChute_AnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_526B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                CallFunc_GetOwningActor_ReturnValue;               // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerParachute*                  K2Node_DynamicCast_AsFort_Player_Parachute;        // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_526C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AB_EmptyBaseGlider_C*                  K2Node_DynamicCast_AsB_Empty_Base_Glider;          // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess1;                      // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_526D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x31(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue1;                 // 0x32(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_526E[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        K2Node_Event_DeltaTimeX;                           // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                CallFunc_GetOwningActor_ReturnValue1;              // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerParachute*                  K2Node_DynamicCast_AsFort_Player_Parachute1;       // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess12;                     // 0x48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_526F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerPawn*                       CallFunc_GetFortPlayerPawn_ReturnValue;            // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                       K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess123;                    // 0x60(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5270[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimInstance*                         CallFunc_GetAnimInstance_ReturnValue;              // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortnite_M_Avg_Player_AnimBlueprint_C* K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint; // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess1234;                   // 0x78(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
