#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function SK_Glider_Googley_Parts_AnimBP.SK_Glider_Googley_Parts_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Glider_Googley_Parts_AnimBP_AnimGraphNode_RigidBody_F32958DA456544FF8E7090BF0B10ABED
struct USK_Glider_Googley_Parts_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Glider_Googley_Parts_AnimBP_AnimGraphNode_RigidBody_F32958DA456544FF8E7090BF0B10ABED_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function SK_Glider_Googley_Parts_AnimBP.SK_Glider_Googley_Parts_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Glider_Googley_Parts_AnimBP_AnimGraphNode_CopyPoseFromMesh_C74F96C74EF4CA217AEFE7BB5A9B2D39
struct USK_Glider_Googley_Parts_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Glider_Googley_Parts_AnimBP_AnimGraphNode_CopyPoseFromMesh_C74F96C74EF4CA217AEFE7BB5A9B2D39_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function SK_Glider_Googley_Parts_AnimBP.SK_Glider_Googley_Parts_AnimBP_C.BlueprintUpdateAnimation
struct USK_Glider_Googley_Parts_AnimBP_C_BlueprintUpdateAnimation_Params
{
public:
	//float                                      DeltaTimeX;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function SK_Glider_Googley_Parts_AnimBP.SK_Glider_Googley_Parts_AnimBP_C.BlueprintInitializeAnimation
struct USK_Glider_Googley_Parts_AnimBP_C_BlueprintInitializeAnimation_Params
{
public:
};

// 0x31 (0x31 - 0x0)
// Function SK_Glider_Googley_Parts_AnimBP.SK_Glider_Googley_Parts_AnimBP_C.ExecuteUbergraph_SK_Glider_Googley_Parts_AnimBP
struct USK_Glider_Googley_Parts_AnimBP_C_ExecuteUbergraph_SK_Glider_Googley_Parts_AnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_Event_DeltaTimeX;                           // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_FClamp_ReturnValue;                       // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                CallFunc_GetOwningActor_ReturnValue;               // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Glider_Googley_C*                   K2Node_DynamicCast_AsB_Glider_Googley;             // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5268[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AB_Glider_Googley_C*                   K2Node_DynamicCast_AsB_Glider_Googley1;            // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess1;                      // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
