#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function TeddyBear_GliderChute_AnimBP.TeddyBear_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_348F4FFD4315B58B782EF5842C63FA31
struct UTeddyBear_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_348F4FFD4315B58B782EF5842C63FA31_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function TeddyBear_GliderChute_AnimBP.TeddyBear_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_062A292B4AA69A68FA1F1FB0F23938A7
struct UTeddyBear_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_062A292B4AA69A68FA1F1FB0F23938A7_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function TeddyBear_GliderChute_AnimBP.TeddyBear_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_D05B993342F5390C7313AD9D0D74582B
struct UTeddyBear_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_D05B993342F5390C7313AD9D0D74582B_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function TeddyBear_GliderChute_AnimBP.TeddyBear_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_BlendSpacePlayer_8957D07F4189CEB7EEA42EBBAEABA5B7
struct UTeddyBear_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_BlendSpacePlayer_8957D07F4189CEB7EEA42EBBAEABA5B7_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function TeddyBear_GliderChute_AnimBP.TeddyBear_GliderChute_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_2BAC07B641AB7C2328B5EE88BFCEEFEA
struct UTeddyBear_GliderChute_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_AnimGraphNode_TransitionResult_2BAC07B641AB7C2328B5EE88BFCEEFEA_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function TeddyBear_GliderChute_AnimBP.TeddyBear_GliderChute_AnimBP_C.BlueprintUpdateAnimation
struct UTeddyBear_GliderChute_AnimBP_C_BlueprintUpdateAnimation_Params
{
public:
	//float                                      DeltaTimeX;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function TeddyBear_GliderChute_AnimBP.TeddyBear_GliderChute_AnimBP_C.AnimNotify_dynamicsOff
struct UTeddyBear_GliderChute_AnimBP_C_AnimNotify_dynamicsOff_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function TeddyBear_GliderChute_AnimBP.TeddyBear_GliderChute_AnimBP_C.AnimNotify_dynamicsOn
struct UTeddyBear_GliderChute_AnimBP_C_AnimNotify_dynamicsOn_Params
{
public:
};

// 0x59 (0x59 - 0x0)
// Function TeddyBear_GliderChute_AnimBP.TeddyBear_GliderChute_AnimBP_C.ExecuteUbergraph_TeddyBear_GliderChute_AnimBP
struct UTeddyBear_GliderChute_AnimBP_C_ExecuteUbergraph_TeddyBear_GliderChute_AnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_527F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0xC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue1;                 // 0xD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5280[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        K2Node_Event_DeltaTimeX;                           // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5281[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                CallFunc_GetOwningActor_ReturnValue;               // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerParachute*                  K2Node_DynamicCast_AsFort_Player_Parachute;        // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5282[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerPawn*                       CallFunc_GetFortPlayerPawn_ReturnValue;            // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                       K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess1;                      // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5283[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimInstance*                         CallFunc_GetAnimInstance_ReturnValue;              // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortnite_M_Avg_Player_AnimBlueprint_C* K2Node_DynamicCast_AsFortnite_M_Avg_Player_Anim_Blueprint; // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess12;                     // 0x58(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
