#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x1C (0x1C - 0x0)
// Function TimelineMarker.TimelineMarker_C.Jump To Marker
struct UTimelineMarker_C_Jump_To_Marker_Params
{
public:
	class UFortReplayContext*                    CallFunc_GetContext_ReturnValue;                   // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortReplayContext*                    CallFunc_GetContext_ReturnValue1;                  // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue;            // 0x18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function TimelineMarker.TimelineMarker_C.Construct
struct UTimelineMarker_C_Construct_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function TimelineMarker.TimelineMarker_C.OnHovered
struct UTimelineMarker_C_OnHovered_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function TimelineMarker.TimelineMarker_C.OnUnhovered
struct UTimelineMarker_C_OnUnhovered_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function TimelineMarker.TimelineMarker_C.OnClicked
struct UTimelineMarker_C_OnClicked_Params
{
public:
};

// 0x50 (0x50 - 0x0)
// Function TimelineMarker.TimelineMarker_C.ExecuteUbergraph_TimelineMarker
struct UTimelineMarker_C_ExecuteUbergraph_TimelineMarker_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFortReplayEventType              Temp_byte_Variable;                                // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_44F5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            Temp_object_Variable;                              // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Temp_object_Variable1;                             // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Temp_object_Variable12;                            // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            K2Node_Select_Default;                             // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor;                      // 0x28(0x28)()
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
