#pragma once

// Fortnite (8.51) SDK
// Dumped with <3 by android#1337

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_MenusScreen_AnimBP.Fortnite_M_Avg_Player_MenusScreen_AnimBP_C
// 0x110C (0x6AFC - 0x59F0)
class UFortnite_M_Avg_Player_MenusScreen_AnimBP_C : public UFortPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x59F0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_A674FFBF48506B9BA7EE8CBDBC8210BD;      // 0x59F8(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE;// 0x5A18(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B299A69E447E60EE4F7B6C8FBE368C16;// 0x5A40(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                // 0x5AB8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                             // 0x5AD8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult02;                              // 0x5B50(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                               // 0x5B70(0x00B0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt;                             // 0x5C20(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                           // 0x5CC0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer02;                           // 0x5CE8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DEF0FA8B424C71AC423D7F827E27D566;// 0x5D60(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer03;                           // 0x5D80(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C5353AF9471A1BD5399A9CA462567314;// 0x5DF8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine02;                             // 0x5E18(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FCD8E69443C0A585805514BA49F1D848;// 0x5EC8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer04;                           // 0x5EF0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A5671DD44544B7D8FE344C948A1F6D5F;// 0x5F68(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer05;                           // 0x5F88(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DCDAAE584818E91CC81A0BA12944C016;// 0x6000(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine03;                             // 0x6020(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult02;                         // 0x60D0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer06;                           // 0x60F8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult03;                              // 0x6170(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer07;                           // 0x6190(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult04;                              // 0x6208(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FA4F2A1D4B990DE217B853803767EFEA;// 0x6228(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D53EBE274630FE146FC57C9C40922FA4;// 0x62D8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CBF0067242E2BBE0B1BE1AAB460C3E97;// 0x6300(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FFC399704D92F63AF22597B83C150F11;// 0x6378(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer08;                           // 0x6398(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult05;                              // 0x6410(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine04;                             // 0x6430(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DD721A434BAE1DC3B4791ABEF2973E96;// 0x64E0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer09;                           // 0x6508(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult06;                              // 0x6580(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer10;                           // 0x65A0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult07;                              // 0x6618(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_DEEE76B9479CA855B13ACDB7B1ADD3DE;// 0x6638(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult03;                         // 0x66E8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer11;                           // 0x6710(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AFE7D68B41BDD2DFC8A938853BBACE1C;// 0x6788(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F91BF94341E4790BEA4E0CAAE54C94B4;// 0x67A8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult08;                              // 0x6820(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine05;                             // 0x6840(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult04;                         // 0x68F0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer12;                           // 0x6918(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult09;                              // 0x6990(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E6363B3848E7E34F43DA088E680182A5;// 0x69B0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F169FFA74713A776C1D5A4A712A655F2;// 0x6A28(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine06;                             // 0x6A48(0x00B0)
	int                                                ClassNameInt;                                             // 0x6AF8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_MenusScreen_AnimBP.Fortnite_M_Avg_Player_MenusScreen_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_D53EBE274630FE146FC57C9C40922FA4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_DD721A434BAE1DC3B4791ABEF2973E96();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_FCD8E69443C0A585805514BA49F1D848();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
