#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_BlendListByBool_5EACE9814BD7663EFF5A4EB4A6267911
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_BlendListByBool_5EACE9814BD7663EFF5A4EB4A6267911_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_FF2BE5334EC963253184219F8D6CEBE1
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_FF2BE5334EC963253184219F8D6CEBE1_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_91A6E94B4403D6FE7667D1AE708E00C9
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_91A6E94B4403D6FE7667D1AE708E00C9_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_703B04C4479A6FF38E449CB56C0C9E32
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_703B04C4479A6FF38E449CB56C0C9E32_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_F8F28A2341D427DBCC3463B753C8F884
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_F8F28A2341D427DBCC3463B753C8F884_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_0213A6E24F644BB0F4ADE0BC240149E0
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_0213A6E24F644BB0F4ADE0BC240149E0_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_E6FF7CFF4B667248BB4D0B9D80CE57C7
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_E6FF7CFF4B667248BB4D0B9D80CE57C7_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_68B98BDD43F0651856C42C88D98638D4
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_68B98BDD43F0651856C42C88D98638D4_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_1EC87F2B4134D48DB470CDB984C5CB32
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_1EC87F2B4134D48DB470CDB984C5CB32_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_85820324449E7A01B496868D8D42DA4B
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_85820324449E7A01B496868D8D42DA4B_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_BlendSpacePlayer_DDCF714A4D0C8C522B47AA9887917E34
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_BlendSpacePlayer_DDCF714A4D0C8C522B47AA9887917E34_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_SpringBone_557155124535AB6A09814FAB6B6628B8
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_SpringBone_557155124535AB6A09814FAB6B6628B8_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_C41C4A8143AE12AD0A5C1198F72912C4
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_C41C4A8143AE12AD0A5C1198F72912C4_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_75A72B7542D28D85CB53C9BCDE31790B
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_75A72B7542D28D85CB53C9BCDE31790B_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_EEB0718F4F580A8B395D5F85AC4BCDCB
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_EEB0718F4F580A8B395D5F85AC4BCDCB_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_ADF7F0304EAAB0169163AF97DCCDD06E
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_ADF7F0304EAAB0169163AF97DCCDD06E_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_TransitionResult_64F638374E3A425A40F8768292E1CBAB
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_TransitionResult_64F638374E3A425A40F8768292E1CBAB_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_TransitionResult_8F7BAB22494C6652853C2DB4B78E5EB1
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_TransitionResult_8F7BAB22494C6652853C2DB4B78E5EB1_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_4B17AFA7484A7476DE37B2AFC774735C
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_LookAt_4B17AFA7484A7476DE37B2AFC774735C_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_TransitionResult_1A9D209E4F439331743621BA64CF3C22
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_TransitionResult_1A9D209E4F439331743621BA64CF3C22_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_TransitionResult_4B6E921C410F994AEBB3669AA7671278
struct UShielder_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Shielder_AnimBP_AnimGraphNode_TransitionResult_4B6E921C410F994AEBB3669AA7671278_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.BlueprintUpdateAnimation
struct UShielder_AnimBP_C_BlueprintUpdateAnimation_Params
{
public:
	//float                                      DeltaTimeX;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x11C (0x11C - 0x0)
// Function Shielder_AnimBP.Shielder_AnimBP_C.ExecuteUbergraph_Shielder_AnimBP
struct UShielder_AnimBP_C_ExecuteUbergraph_Shielder_AnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue1;                 // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_37D8[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0xC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_37D9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        K2Node_Event_DeltaTimeX;                           // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_37DA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APawn*                                 CallFunc_TryGetPawnOwner_ReturnValue;              // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                           K2Node_DynamicCast_AsFort_AIPawn;                  // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EFortMovementStyle                CallFunc_GetMovementStyle_ReturnValue;             // 0x29(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_37DB[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               CallFunc_GetVelocity_ReturnValue;                  // 0x2C(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_X;                            // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_Y;                            // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_Z;                            // 0x40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_37DC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UPawnMovementComponent*                CallFunc_GetMovementComponent_ReturnValue;         // 0x48(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsFalling_ReturnValue;                    // 0x50(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_37DD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             CallFunc_MakeVector2D_ReturnValue;                 // 0x54(0x8)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_VSize2D_ReturnValue;                      // 0x5C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AShielderPawn_C*                       K2Node_DynamicCast_AsShielder_Pawn;                // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess1;                      // 0x68(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_37DE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               CallFunc_K2_GetActorLocation_ReturnValue;          // 0x6C(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_VInterpTo_ReturnValue;                    // 0x7C(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_37DF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            CallFunc_GetTransform_ReturnValue;                 // 0x90(0x30)(IsPlainOldData, NoDestructor)
	struct FVector                               CallFunc_K2_GetActorLocation_ReturnValue1;         // 0xC0(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_Subtract_VectorVector_ReturnValue;        // 0xCC(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_InverseTransformDirection_ReturnValue;    // 0xD8(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetWorldDeltaSeconds_ReturnValue1;        // 0xE4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetWorldDeltaSeconds_ReturnValue2;        // 0xE8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetWorldDeltaSeconds_ReturnValue3;        // 0xEC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_Divide_VectorFloat_ReturnValue;           // 0xF0(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_Multiply_VectorFloat_ReturnValue;         // 0xFC(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_X1;                           // 0x108(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_Y1;                           // 0x10C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakVector_Z1;                           // 0x110(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_FInterpTo_ReturnValue;                    // 0x114(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_FInterpTo_ReturnValue1;                   // 0x118(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
