#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

namespace SDK
{
// 0x1BB8 (0x6048 - 0x4490)
// AnimBlueprintGeneratedClass FerretVehicle_Driver_AnimBP.FerretVehicle_Driver_AnimBP_C
class UFerretVehicle_Driver_AnimBP_C : public UFortPlayerAnimInstance_FerretDriver
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x4490(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_86E019B5417399C6B98DEEA138F6763C; // 0x4498(0x20)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E3AEC5AF45CE09AEC07D75AE68E57058; // 0x44B8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2CDDFE324446D38601DDC480503A4ECF; // 0x44E0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_82C47A57427D55B01405E693015E4FCE; // 0x4508(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_030E2D4C4EC6F0BFDE9294A2D1BE05E1; // 0x4530(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_720B995943A2A44D9F5A0AA06135DEAE; // 0x4558(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A6A0BD2A48FB499BE2CFF7B6D2CF1B35; // 0x4580(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17D94225452927F6C669A2A75151B3A4; // 0x45A8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_369E1476444FFBF88F4836AE643AA152; // 0x45D0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_132B7C614907679D49C349912CA5E6DA; // 0x45F8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BB05E1DB487F856A5CB7FE89F0933AF9; // 0x4620(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E134B39B462EACCE3BE6B6A6089B661D; // 0x4648(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_546CAA9C466A052F165EE889E14D2B0D; // 0x4670(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2882770448D00044B68669AC9504C80F; // 0x4698(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_BA91DF144EE8CD92D10E479976ECE42D; // 0x46C0(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6ED4B8D744DB677B7A443F84DA190B75; // 0x46E0(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F97480C5488B05F23048F5AAA4D460BF; // 0x4708(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19EA6CC745DD5A1AFE38628DAF6624CE; // 0x4728(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_270186B84FC9DAAA5E3D4AAA9D3F01D0; // 0x47A0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_95C01E9C474F65F285BE668947E2267A; // 0x47C0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_BF067950493C9F208903EA951CFC7D0B; // 0x4838(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2F6434504A1D66C784242C965386A75B; // 0x4858(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_39AFC76B483EABD8F7ABC5A081E09CC4; // 0x48D0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2695D469458915D9CBBC75A0EA182699; // 0x48F0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_24B126A54B60C6C402F175934FA964D8; // 0x4968(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_97F423E0404954D8B95268997056ED8F; // 0x4988(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_0523EE75421982F569709EB2D4067ECE; // 0x4A00(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_609985344D1CCFBA3BEFA2896F65910F; // 0x4A20(0xE0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9A9949A841896BD67D69858E3A57E12F; // 0x4B00(0x20)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_A516451A490F8930F83E7194E45C37B8; // 0x4B20(0x28)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8EE7C87A47CA0AAB7272DC9D8E1A5CBD; // 0x4B48(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_0FC0F7D14599BB4D26B13BA6B9028322; // 0x4B68(0xB0)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_31A68ECE486408308AAC5BA481A59BAF; // 0x4C18(0x188)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_CBD55E9A452F43DF361952800637AC3E; // 0x4DA0(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E817796447A309134CC743B77AA8527F; // 0x4E68(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1A3B08D94CEB69A72058699375984BD7; // 0x4E90(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_40C5D9D140ED70627A718F9079159732; // 0x4EB8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6FBEA78F41AD3BD2E0AF0DBDDB2245DF; // 0x4EE0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FC030264429B308784ECEABA72EC5704; // 0x4F08(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_434DC2F24C8F2C10DC6A7BB20EDFB453; // 0x4F80(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1339661E485FBD71434C7FB469A7F1D8; // 0x4FA0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_A132C467450CCDB6C4BE13B70CBD7ACF; // 0x5018(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_368F7AA446B5ECC2FECC06AF0B7B512D; // 0x5038(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_BC5DDF9548D05B983B963FA730E49DC7; // 0x50B0(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2DB24B7C4352C296A982698BC4D91178; // 0x5150(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_68B7F548469D02996DBC16B012255D02; // 0x51C8(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BA12F0A54465EC3813987BAB27005B78; // 0x5268(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_E7B0ADDE42003546F937CA876DA1D79A; // 0x52E0(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_D966F8F04E48F58A5EDA7ABD527E4ED0; // 0x5300(0xB0)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_60B7FFB549CB35325591118CB52A04A1; // 0x53B0(0x48)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_6BFA0B594043ED6AC3521AB7294391E1; // 0x53F8(0xC8)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_87E9AA8F4D8BC5F76705429A0A8DEDAC; // 0x54C0(0xB0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_671F85FD419449427FDA4C82E7D29DA5; // 0x5570(0x78)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_B6A682B54F3DFF61A2A7D88EA1C7DADD; // 0x55E8(0x18)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_BB414B9745FA480D18DFA0A18AE47F8B; // 0x5600(0xC8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D991A3054A0E46F8CA1D0DA4B83D1671; // 0x56C8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E7ACB6A94A9B3436022AE4BA1572518B; // 0x56F0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2F2003C64A31E088EC839C84D66DEFE7; // 0x5718(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_DBCD4DB444153C4E494294A754F8650C; // 0x5740(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C3CB00024A9941D2C6FD6791FB82B1F2; // 0x5768(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_91457DC145E5DA0721D139968390FD44; // 0x5790(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_029A6DD741DD0771B2A040894EDD84F7; // 0x5808(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B99D61F54A29596B5AC36AB09F9118E5; // 0x5828(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8D52092243A1CBFF953419973E10EB8E; // 0x58A0(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0DBCA143486D38E2E6BEE9A44BF41442; // 0x58C0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_584FE815490877354A0D4AB9F3D746A0; // 0x5938(0x20)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_93B0D40E4C2DD1BA7B4288B8E98933D0; // 0x5958(0x18)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_FE35B727416B2615B22862A2CE193F1C; // 0x5970(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_F6367532453DDCE55D25CC86EDDED804; // 0x5990(0xB0)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_42C32626464890E12458619FDCB765EA; // 0x5A40(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4F40EC184B847F59B890B4A8E85B1DFD; // 0x5B48(0x108)()
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_95BB4E814C6415B27C3EB7B9F8DF9770; // 0x5C50(0xF8)()
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_859EE5114B5D3EC835327D9B43A75F9A; // 0x5D48(0xF8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_87E73F534051F498EF3BC59D6DAEA03E; // 0x5E40(0x20)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6200EB3E42FE46A4403E97BAAB931D33; // 0x5E60(0x20)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_C57DEA9E4C233E4D60A0F1A26381BC21; // 0x5E80(0xE0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_B35E9318416FBAA2C93DC193BD494562; // 0x5F60(0xB8)()
	struct FRotator                              HandLocalRotationOffsetLeft;                       // 0x6018(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              HandLocalRotationOffsetRight;                      // 0x6024(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                               HandLocalTranslateOffsetRight;                     // 0x6030(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               HandLocalTranslateOffsetLeft;                      // 0x603C(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("FerretVehicle_Driver_AnimBP_C");
		return Clss;
	}

	void EvaluateGraphExposedInputs_ExecuteUbergraph_FerretVehicle_Driver_AnimBP_AnimGraphNode_BlendSpacePlayer_609985344D1CCFBA3BEFA2896F65910F();
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_FerretVehicle_Driver_AnimBP(int32 EntryPoint, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue1);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
