#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function ShoppingCartVehicleSK_AnimBP.ShoppingCartVehicleSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_293BD4664A42001B01053FAFD13526BA
struct UShoppingCartVehicleSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_293BD4664A42001B01053FAFD13526BA_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartVehicleSK_AnimBP.ShoppingCartVehicleSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_E3A0212F42252A3B35E387BD4E915843
struct UShoppingCartVehicleSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_E3A0212F42252A3B35E387BD4E915843_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartVehicleSK_AnimBP.ShoppingCartVehicleSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_2EB7C951424DBBEA5313F78EBCA54D4E
struct UShoppingCartVehicleSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_2EB7C951424DBBEA5313F78EBCA54D4E_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function ShoppingCartVehicleSK_AnimBP.ShoppingCartVehicleSK_AnimBP_C.BlueprintUpdateAnimation
struct UShoppingCartVehicleSK_AnimBP_C_BlueprintUpdateAnimation_Params
{
public:
	//float                                      DeltaTimeX;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartVehicleSK_AnimBP.ShoppingCartVehicleSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_89E126974E81E2145D3B3991782D45BD
struct UShoppingCartVehicleSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_89E126974E81E2145D3B3991782D45BD_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartVehicleSK_AnimBP.ShoppingCartVehicleSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_F1D8E9314864DADDBE8742B1B63F1178
struct UShoppingCartVehicleSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_F1D8E9314864DADDBE8742B1B63F1178_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartVehicleSK_AnimBP.ShoppingCartVehicleSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_C91EA21B47AF3D14096DFFBF9DAB1219
struct UShoppingCartVehicleSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_C91EA21B47AF3D14096DFFBF9DAB1219_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartVehicleSK_AnimBP.ShoppingCartVehicleSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_DE585B894EEDCED6D97829830D1FC06C
struct UShoppingCartVehicleSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_DE585B894EEDCED6D97829830D1FC06C_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartVehicleSK_AnimBP.ShoppingCartVehicleSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_D64F465247EA5F954458BF995216BCE2
struct UShoppingCartVehicleSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_AnimGraphNode_ModifyBone_D64F465247EA5F954458BF995216BCE2_Params
{
public:
};

// 0x1CC (0x1CC - 0x0)
// Function ShoppingCartVehicleSK_AnimBP.ShoppingCartVehicleSK_AnimBP_C.ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP
struct UShoppingCartVehicleSK_AnimBP_C_ExecuteUbergraph_ShoppingCartVehicleSK_AnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue;                  // 0x4(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue1;                 // 0x10(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue2;                 // 0x1C(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue3;                 // 0x28(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_TransformRotation_ReturnValue;            // 0x34(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_TransformRotation_ReturnValue1;           // 0x40(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                               CallFunc_TransformLocation_ReturnValue;            // 0x4C(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_TransformLocation_ReturnValue1;           // 0x58(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_Event_DeltaTimeX;                           // 0x64(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                CallFunc_GetOwningActor_ReturnValue;               // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaSKPushVehicle*              K2Node_DynamicCast_AsFort_Athena_SKPush_Vehicle;   // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x78(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3684[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               CallFunc_GetPreviousLinearVelocity_ReturnValue;    // 0x7C(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_GetVelocity_ReturnValue;                  // 0x88(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_VSize_ReturnValue;                        // 0x94(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_Subtract_VectorVector_ReturnValue;        // 0x98(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0xA4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_Multiply_VectorFloat_ReturnValue;         // 0xA8(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_FClamp_ReturnValue;                       // 0xB4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_GetSocketLocation_ReturnValue;            // 0xB8(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_GetSocketLocation_ReturnValue1;           // 0xC4(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CallFunc_FindLookAtRotation_ReturnValue;           // 0xD0(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                               CallFunc_TransformToBoneSpace_OutPosition;         // 0xDC(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CallFunc_TransformToBoneSpace_OutRotation;         // 0xE8(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                        CallFunc_BreakRotator_Roll;                        // 0xF4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakRotator_Pitch;                       // 0xF8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakRotator_Yaw;                         // 0xFC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue4;                 // 0x100(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                               CallFunc_MakeVector_ReturnValue;                   // 0x10C(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_MakeVector_ReturnValue1;                  // 0x118(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue5;                 // 0x124(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue6;                 // 0x130(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3685[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            CallFunc_MakeTransform_ReturnValue;                // 0x140(0x30)(IsPlainOldData, NoDestructor)
	struct FTransform                            CallFunc_MakeTransform_ReturnValue1;               // 0x170(0x30)(IsPlainOldData, NoDestructor)
	float                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x1A0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x1A4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue7;                 // 0x1A8(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue8;                 // 0x1B4(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                              CallFunc_MakeRotator_ReturnValue9;                 // 0x1C0(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
