#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function ShoppingCartSK_AnimBP.ShoppingCartSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartSK_AnimBP_AnimGraphNode_TransitionResult_D58867484C8306C65AD25698EB1A9BB2
struct UShoppingCartSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartSK_AnimBP_AnimGraphNode_TransitionResult_D58867484C8306C65AD25698EB1A9BB2_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartSK_AnimBP.ShoppingCartSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartSK_AnimBP_AnimGraphNode_TransitionResult_22E107B1405E3B683946D1ACA3E778F4
struct UShoppingCartSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartSK_AnimBP_AnimGraphNode_TransitionResult_22E107B1405E3B683946D1ACA3E778F4_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartSK_AnimBP.ShoppingCartSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartSK_AnimBP_AnimGraphNode_TransitionResult_2A01AC6043B6CB354AEB9D9B18673BE3
struct UShoppingCartSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartSK_AnimBP_AnimGraphNode_TransitionResult_2A01AC6043B6CB354AEB9D9B18673BE3_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartSK_AnimBP.ShoppingCartSK_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartSK_AnimBP_AnimGraphNode_TransitionResult_E24154934C6E7084D6DA459A97AA5A14
struct UShoppingCartSK_AnimBP_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ShoppingCartSK_AnimBP_AnimGraphNode_TransitionResult_E24154934C6E7084D6DA459A97AA5A14_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartSK_AnimBP.ShoppingCartSK_AnimBP_C.AnimNotify_StartPedal
struct UShoppingCartSK_AnimBP_C_AnimNotify_StartPedal_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartSK_AnimBP.ShoppingCartSK_AnimBP_C.AnimNotify_EventFallingStarted
struct UShoppingCartSK_AnimBP_C_AnimNotify_EventFallingStarted_Params
{
public:
};

// 0x49 (0x49 - 0x0)
// Function ShoppingCartSK_AnimBP.ShoppingCartSK_AnimBP_C.ExecuteUbergraph_ShoppingCartSK_AnimBP
struct UShoppingCartSK_AnimBP_C_ExecuteUbergraph_ShoppingCartSK_AnimBP_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue1;                  // 0x6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue;           // 0x7(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue1;                 // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue2;                  // 0x9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3687[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_GetRelevantAnimTimeRemainingFraction_ReturnValue; // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanAND_ReturnValue3;                  // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue;              // 0x11(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3688[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APawn*                                 CallFunc_TryGetPawnOwner_ReturnValue;              // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanOR_ReturnValue;                    // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3689[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerPawnAthena*                 K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_368A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortAthenaVehicle*                    CallFunc_GetVehicle_ReturnValue;                   // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AShoppingCartVehicleSK_C*              K2Node_DynamicCast_AsShopping_Cart_Vehicle_SK;     // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess1;                      // 0x48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function ShoppingCartSK_AnimBP.ShoppingCartSK_AnimBP_C.OnPedal__DelegateSignature
struct UShoppingCartSK_AnimBP_C_OnPedal__DelegateSignature_Params
{
public:
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
