#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

namespace SDK
{
// 0xC48 (0x1018 - 0x3D0)
// AnimBlueprintGeneratedClass M_MED_Cupid_Dark_Backpack_AnimBlueprint.M_MED_Cupid_Dark_Backpack_AnimBlueprint_C
class UM_MED_Cupid_Dark_Backpack_AnimBlueprint_C : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x3D0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_72C57A8044BA123735D08CB4220F1FC5; // 0x3D8(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_83AB2269406F8EE7F3A925AE3706F0E8; // 0x408(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_247386914002B7BCC7C2F4B94D4C2463; // 0x430(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A0137061484599B25197858D2F7A6047; // 0x458(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_77E832E6477E7553927DF5AD8F7404B4; // 0x480(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0807898E462DEE0084E3E5B6D6814F98; // 0x4A8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_42627CD9463383949E7055BDB8F73887; // 0x4D0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1F6F55374C70855D99C1039FF6A313A4; // 0x4F8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_505AEF1F486865762F85CBBF7E96EC14; // 0x520(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_85DF4BCA45F81715280C788F77FA4E8D; // 0x548(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_85AFAAE74F5AB546E7BB0EA2C1A3D59E; // 0x570(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3D20137A43DD9B189207EE9773EFE9BB; // 0x598(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F32ECA204BA52915449F7586670FDD3F; // 0x5C0(0x28)()
	struct FAnimNode_PoseByName                  AnimGraphNode_PoseByName_4E1EFE01497DF835C432AAB1E1FD7B52; // 0x5E8(0x90)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6DC21F554D471E46852AC4A4EF35A977; // 0x678(0x30)()
	struct FAnimNode_PoseByName                  AnimGraphNode_PoseByName_35CAC1904E7529ED1C13CD90A425E566; // 0x6A8(0x90)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_84FA237647CE3E5ED688E4A3C9D108FC; // 0x738(0x30)()
	struct FAnimNode_PoseByName                  AnimGraphNode_PoseByName_A5B0750743BC60D5DBD9CD9A53825EA5; // 0x768(0x90)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_DDB45B024EB1B3A844858EB62E68EFD8; // 0x7F8(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_EDC9BA3E4598487A8AE44B8628125F80; // 0x828(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9BD15D2C4A5F8696CC7535916F2FC357; // 0x850(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9405FEBC4B5B183C168C719A261F7552; // 0x878(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_754EB14C4115CA48E25B2D8AA5618402; // 0x8A0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AC88B26A4B0EF517BFB2FAB4582E9CE5; // 0x8C8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E09A547745220A77799E719EAE07BF76; // 0x8F0(0x28)()
	struct FAnimNode_PoseByName                  AnimGraphNode_PoseByName_F61BD57147B6CF4A77AB1F9E313ABF81; // 0x918(0x90)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_B571DB9B48F957B83F4096A9FE74BE18; // 0x9A8(0x30)()
	struct FAnimNode_PoseByName                  AnimGraphNode_PoseByName_98540608438CC4DF3B64C79C497A0D77; // 0x9D8(0x90)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_73F5BF50410037F2146E49B5F38945C6; // 0xA68(0x30)()
	struct FAnimNode_PoseByName                  AnimGraphNode_PoseByName_F41464784B249811ADA80CAF0407FEBD; // 0xA98(0x90)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_77385BD042CF6C23482D9CB89C4D05C7; // 0xB28(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_D761559B4C8284942904B0A462F293A9; // 0xB58(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_0694408341703B55B4701E8E0A935658; // 0xC08(0x30)()
	struct FAnimNode_PoseByName                  AnimGraphNode_PoseByName_14E5B8A0417036E7CF2873AB0CBBB422; // 0xC38(0x90)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_498ECB99494E7978F8BD3BB8ADDE87F3; // 0xCC8(0x30)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_D4E76E0F4C6FA4F9A4461E9B26817372; // 0xCF8(0xE0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_D893655241375E4EA950E9AFE0A9F50B; // 0xDD8(0xC8)()
	struct FAnimNode_PoseByName                  AnimGraphNode_PoseByName_E9D9A6E34A3F2194A5347FB99D8CF2D1; // 0xEA0(0x90)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8EDFA63F45DDA83FB329B39C6127324E; // 0xF30(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_0897B8714EEF9DAB31EAD8A226E5E6B0; // 0xF60(0xB0)()
	float                                        PlayerVector_FwdBwd;                               // 0x1010(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        PlayerVector_LR;                                   // 0x1014(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("M_MED_Cupid_Dark_Backpack_AnimBlueprint_C");
		return Clss;
	}

	void AnimGraph(struct FPoseLink* AnimGraph);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_M_MED_Cupid_Dark_Backpack_AnimBlueprint(int32 EntryPoint, float K2Node_Event_DeltaTimeX, class APawn* CallFunc_TryGetPawnOwner_ReturnValue, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, class ACharacter* K2Node_DynamicCast_AsCharacter, bool K2Node_DynamicCast_bSuccess, const struct FVector& CallFunc_GetAxes_X, const struct FVector& CallFunc_GetAxes_Y, const struct FVector& CallFunc_GetAxes_Z, const struct FVector& CallFunc_Conv_RotatorToVector_ReturnValue, const struct FVector& CallFunc_GetCurrentAcceleration_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue_1, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue_1);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
