#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_1B4E103D46439F870B6BD39A474C858E
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_1B4E103D46439F870B6BD39A474C858E_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_3F28901E44BFF5AC59C8A790D0A22741
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_3F28901E44BFF5AC59C8A790D0A22741_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_5E3092C440CBEC72A2CD9BBDE9DAE625
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_5E3092C440CBEC72A2CD9BBDE9DAE625_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_67225BA7459A220B89D73894D2C9B6E3
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_67225BA7459A220B89D73894D2C9B6E3_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_8D235F354A1F408705ABBD9B5595BDB5
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_8D235F354A1F408705ABBD9B5595BDB5_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_0BE184EF4CE2C3D162C0629A1E1CD800
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_0BE184EF4CE2C3D162C0629A1E1CD800_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_C63325524D225A16148568A75E960419
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_C63325524D225A16148568A75E960419_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_02E59E8544298A1041CF81B6BB5EA705
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_02E59E8544298A1041CF81B6BB5EA705_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_D02BB9994035749BB9A1C6BE4B245AEA
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_D02BB9994035749BB9A1C6BE4B245AEA_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_3697123E41DAD0188BFF4BA18736B464
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_3697123E41DAD0188BFF4BA18736B464_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_FCF59615457B3A74257CBB951041675B
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_FCF59615457B3A74257CBB951041675B_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_2FC1A9C74014CD14B676F8A5649B9C59
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_2FC1A9C74014CD14B676F8A5649B9C59_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_DDA431714F6BBF153E9480A3910740F0
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_DDA431714F6BBF153E9480A3910740F0_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_4BDC7FB142F2DBB18CD2D0AA4F229640
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_4BDC7FB142F2DBB18CD2D0AA4F229640_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_9C15E3F741B1D0C6DBE41E84C5022497
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_9C15E3F741B1D0C6DBE41E84C5022497_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_FortAnimGraphNode_SpeedWarping_E99827E24710877C1F232687C1F832F0
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_FortAnimGraphNode_SpeedWarping_E99827E24710877C1F232687C1F832F0_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_276D46624AD91D18FC2F83B902899C99
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_276D46624AD91D18FC2F83B902899C99_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_A380B35847CEFC863F4B57870D997909
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_A380B35847CEFC863F4B57870D997909_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_C66EDB0142373CA742EDF39994AF1A71
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_C66EDB0142373CA742EDF39994AF1A71_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_CFE760FF4A623482E8E05E9ADE436ABA
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_CFE760FF4A623482E8E05E9ADE436ABA_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_5D31D3D346F66A0EABBC69BE1593BDF8
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_5D31D3D346F66A0EABBC69BE1593BDF8_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_5C43CCB04F5C39D629B7849D3232E3D9
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_5C43CCB04F5C39D629B7849D3232E3D9_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_FortAnimGraphNode_SpeedWarping_9F6AAEC644C2F6E47C74F6BF70AE5AAA
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_FortAnimGraphNode_SpeedWarping_9F6AAEC644C2F6E47C74F6BF70AE5AAA_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_8DEEE22C4BF4252258EEDFBA27B0124C
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_8DEEE22C4BF4252258EEDFBA27B0124C_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotationOffsetBlendSpace_EDBAF7F147E9319C6857ABBE5A9DD12B
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotationOffsetBlendSpace_EDBAF7F147E9319C6857ABBE5A9DD12B_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotationOffsetBlendSpace_AE474B1443F08D76899F079D0F668BEE
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotationOffsetBlendSpace_AE474B1443F08D76899F079D0F668BEE_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_EDB3F7064ED6ADCA341CBBAED73AA457
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_EDB3F7064ED6ADCA341CBBAED73AA457_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_ApplyAdditive_114FF6F84102EA126AE59DB229934EBF
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_ApplyAdditive_114FF6F84102EA126AE59DB229934EBF_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_C7E5B67C4CEDBC4993BA7C9C2BF14A99
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_C7E5B67C4CEDBC4993BA7C9C2BF14A99_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_A3235F734876A9149E433F9AB6DA8AC1
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_A3235F734876A9149E433F9AB6DA8AC1_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_DF5A69004E1362E35D4DFBB23EC0D804
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_DF5A69004E1362E35D4DFBB23EC0D804_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_BB529A8A4EDC9EDE455EB69B7272DB3F
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_BB529A8A4EDC9EDE455EB69B7272DB3F_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_90E49C4A485FD76A7326FFB5A20E623E
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_90E49C4A485FD76A7326FFB5A20E623E_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_LayeredBoneBlend_FF94A50748BA98A65BC8ED8AD2CADE32
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_LayeredBoneBlend_FF94A50748BA98A65BC8ED8AD2CADE32_Params
{
public:
};

// 0x8 (0x8 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.CharPartEvent
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_CharPartEvent_Params
{
public:
	class UFortPlayerAnimInstance*               CharPart;                                          // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.AnimNotify_playFacialAnim
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_AnimNotify_playFacialAnim_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.BlueprintUpdateAnimation
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_BlueprintUpdateAnimation_Params
{
public:
	//float                                      DeltaTimeX;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x90 (0x90 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsAnyMontagePlaying_ReturnValue;          // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue1;                 // 0x6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue2;                 // 0x7(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue3;                 // 0x9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3A0A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AGameStateBase*                        CallFunc_GetGameState_ReturnValue;                 // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateZone*                    K2Node_DynamicCast_AsFort_Game_State_Zone;         // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3A0B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortPlayerAnimInstance*               K2Node_CustomEvent_CharPart;                       // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_Event_DeltaTimeX;                           // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A0C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APawn*                                 CallFunc_TryGetPawnOwner_ReturnValue;              // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               CallFunc_K2_GetActorLocation_ReturnValue;          // 0x40(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x4C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3A0D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              CallFunc_GetBaseAimRotation_ReturnValue;           // 0x50(0xC)(IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x5C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3A0E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              CallFunc_FindLookAtRotation_ReturnValue;           // 0x60(0xC)(IsPlainOldData, NoDestructor)
	float                                        CallFunc_BreakRotator_Roll;                        // 0x6C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakRotator_Pitch;                       // 0x70(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakRotator_Yaw;                         // 0x74(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x78(0xC)(IsPlainOldData, NoDestructor)
	float                                        CallFunc_BreakRotator_Roll1;                       // 0x84(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakRotator_Pitch1;                      // 0x88(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_BreakRotator_Yaw1;                        // 0x8C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C.MenuScreenDispatcher__DelegateSignature
struct UFortnite_Butterfly_Ghost_AnimBlueprint_C_MenuScreenDispatcher__DelegateSignature_Params
{
public:
	class UFortPlayerAnimInstance*               CharPart;                                          // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
