#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

namespace SDK
{
// 0x2EAD (0x6EFD - 0x4050)
// AnimBlueprintGeneratedClass Fortnite_Butterfly_Ghost_AnimBlueprint.Fortnite_Butterfly_Ghost_AnimBlueprint_C
class UFortnite_Butterfly_Ghost_AnimBlueprint_C : public UFortPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x4050(0x8)(Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_9DE324564C7570D665099D8DE630DD06; // 0x4058(0x40)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_23C917784AA68300C7FFFABF4E8ED548; // 0x4098(0x68)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_7DC7761248EDE13B8F6804866C52CBF2; // 0x4100(0xD8)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_FF94A50748BA98A65BC8ED8AD2CADE32; // 0x41D8(0xD8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_CAA006FB4D641A7CE60288A78C8F0F68; // 0x42B0(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_90E49C4A485FD76A7326FFB5A20E623E; // 0x42F8(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BB529A8A4EDC9EDE455EB69B7272DB3F; // 0x4340(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_82AC668A4ED4E5132A1E2A8F299825E4; // 0x4388(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_95BD640E4DD19119029E2D936110422E; // 0x43D0(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_DF5A69004E1362E35D4DFBB23EC0D804; // 0x4418(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A3235F734876A9149E433F9AB6DA8AC1; // 0x4460(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C7E5B67C4CEDBC4993BA7C9C2BF14A99; // 0x44A8(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1D01D5B446AC306F49CFA79558DB7EBF; // 0x44F0(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AC18A8464CB3E5189D71FA905D48E3C0; // 0x4538(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8DEEE22C4BF4252258EEDFBA27B0124C; // 0x4580(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5D31D3D346F66A0EABBC69BE1593BDF8; // 0x45C8(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CFE760FF4A623482E8E05E9ADE436ABA; // 0x4610(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C66EDB0142373CA742EDF39994AF1A71; // 0x4658(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A380B35847CEFC863F4B57870D997909; // 0x46A0(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_276D46624AD91D18FC2F83B902899C99; // 0x46E8(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8D235F354A1F408705ABBD9B5595BDB5; // 0x4730(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5E3092C440CBEC72A2CD9BBDE9DAE625; // 0x4778(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F9A09E384A0EBE952062C7826AF0B205; // 0x47C0(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F742A3BD4B83D71CD2728BB3D9E5FFD6; // 0x4858(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_703FC4B347BAC6CE2028B09796729B60; // 0x48F0(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2188AB8547966CB07D6736956665F779; // 0x4988(0x98)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_1B4E103D46439F870B6BD39A474C858E; // 0x4A20(0xD0)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_3F28901E44BFF5AC59C8A790D0A22741; // 0x4AF0(0xC0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_104A013641535CD4AE2783878DD26E14; // 0x4BB0(0x40)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4862F0C440E8DE2B79E3CA9C7E6BC038; // 0x4BF0(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A2CA78F247E54B09602730AF4C752072; // 0x4C88(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DE28B9D64360D56B198CAD946CC5BDC4; // 0x4D20(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8235577A4BED96773E13D692BE712174; // 0x4DB8(0x98)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_67225BA7459A220B89D73894D2C9B6E3; // 0x4E50(0xD0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_2DF096704F78758F45A84690048A8015; // 0x4F20(0x40)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_828D7B96406A7AD633D4F7A841A7F248; // 0x4F60(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0D97589F4AE0208FAE4208B80CB7E24E; // 0x4FF8(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_67650D09460E6651F0B90896EA243489; // 0x5090(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C7F205CA46FEBF4FAB90B59D04E76588; // 0x5128(0x98)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_0BE184EF4CE2C3D162C0629A1E1CD800; // 0x51C0(0xD0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_711DCB654D27CA382487809851E42AAA; // 0x5290(0x40)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C63325524D225A16148568A75E960419; // 0x52D0(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_02E59E8544298A1041CF81B6BB5EA705; // 0x5368(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D02BB9994035749BB9A1C6BE4B245AEA; // 0x5400(0x98)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3697123E41DAD0188BFF4BA18736B464; // 0x5498(0x98)()
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_FCF59615457B3A74257CBB951041675B; // 0x5530(0xD0)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_2FC1A9C74014CD14B676F8A5649B9C59; // 0x5600(0xC0)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_DDA431714F6BBF153E9480A3910740F0; // 0x56C0(0xC0)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_4BDC7FB142F2DBB18CD2D0AA4F229640; // 0x5780(0xC0)()
	struct FAnimNode_RotateRootBone              AnimGraphNode_RotateRootBone_9C15E3F741B1D0C6DBE41E84C5022497; // 0x5840(0xC0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_DEBFEABE45332A8FFC68CEBC5F023AF2; // 0x5900(0x40)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_07A3EB8F45E4E507EF6FAD89A5BC2864; // 0x5940(0x40)()
	struct FFortAnimNode_SpeedWarping            FortAnimGraphNode_SpeedWarping_E99827E24710877C1F232687C1F832F0; // 0x5980(0x1D8)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_8DC08200470B4943DC2531B334EFAD18; // 0x5B58(0x40)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1C7B39EF4C86A9BE00B1A5868071F2C4; // 0x5B98(0x98)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_B22C440C41CB8EC8C3D115952683EA33; // 0x5C30(0x40)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_5C43CCB04F5C39D629B7849D3232E3D9; // 0x5C70(0x100)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_223B2FFC4808940BB83BC9B3FF5312EA; // 0x5D70(0x40)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_588C563D41F10315FAE99E80847BC823; // 0x5DB0(0x40)()
	struct FFortAnimNode_SpeedWarping            FortAnimGraphNode_SpeedWarping_9F6AAEC644C2F6E47C74F6BF70AE5AAA; // 0x5DF0(0x1D8)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9CEDD6854C119AE80BC801A98A4956D7; // 0x5FC8(0x40)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_F469882B4BA4DA77B8410F95CD1A0801; // 0x6008(0xD0)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_EDBAF7F147E9319C6857ABBE5A9DD12B; // 0x60D8(0x1A8)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_932CCC504E23385AC27F108F3C3DD696; // 0x6280(0x68)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_5D111C374C338774187FAEAC1C159AB7; // 0x62E8(0x68)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_C69D28134071E652501C5E89E31CC3E2; // 0x6350(0xD8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_B60A4210405E99F3BE4B5399EA74506C; // 0x6428(0x48)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_A03D1779453F69CE47E8E382C500D8CD; // 0x6470(0x48)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_AE474B1443F08D76899F079D0F668BEE; // 0x64B8(0x1A8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_EDB3F7064ED6ADCA341CBBAED73AA457; // 0x6660(0x100)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_114FF6F84102EA126AE59DB229934EBF; // 0x6760(0xE8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_ADB5949D43DCDB01E2DAA1849DA37C40; // 0x6848(0x40)()
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone_6DADD99947E532B6DA9A16BF89A7A357; // 0x6888(0x110)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_B48F1B504FCE5EDE07E4DAB2985F1DC9; // 0x6998(0x40)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0D5A37584C15FD5DA719A6B1F005AB6F; // 0x69D8(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_758515CF4A40054B208ADAAAF27A643A; // 0x6A20(0x48)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose_D2164593450F9E39441470BC3DF699EA; // 0x6A68(0x38)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_3D99C25D467BCD219E6872B426D2FB74; // 0x6AA0(0x40)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose_F29A5BD44500C835F06299BFCB4BAAFE; // 0x6AE0(0x38)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_82231CC845DB77CED0D48ABEB54E4729; // 0x6B18(0x40)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose_B608427E4886F1762704EAA38B651B99; // 0x6B58(0x38)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_B490A27D4FCE58EFB746F6B0B66A1224; // 0x6B90(0x40)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_CE1A67AD47CC77A25D160E8926D7F236; // 0x6BD0(0xD0)()
	struct FAnimNode_RefPose                     AnimGraphNode_IdentityPose_9C50993F400BBFCFCD967AB5716A6CB9; // 0x6CA0(0x38)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_604082104225D740274679922078723A; // 0x6CD8(0x40)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_DAD429B94A9166139D435FB92B8132D8; // 0x6D18(0xD0)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_BD14E171410E853784C46DAD1A8733F3; // 0x6DE8(0xC0)()
	float                                        MoveIKGunToHandFKAlpha;                            // 0x6EA8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Hand_IK_to_FK_LR_Weight;                           // 0x6EAC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                  MenuScreenDispatcher;                              // 0x6EB0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                        ShuffleThreshold;                                  // 0x6EC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        JogStartPosition;                                  // 0x6EC4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        WalkAnimStartPosition;                             // 0x6EC8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        StartAnimBlendTime;                                // 0x6ECC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        PivotAnimBlendTime;                                // 0x6ED0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        JogPlayRate;                                       // 0x6ED4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CrouchPlayRate;                                    // 0x6ED8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EDirection                        Direction_Last;                                    // 0x6EDC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A0F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortPlayerPawn*                       Pawn;                                              // 0x6EE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               ButterFlyLocation;                                 // 0x6EE8(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ButterflyLookAtPitch;                              // 0x6EF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ButterflyLookAtYaw;                                // 0x6EF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldLookAtButterfly;                             // 0x6EFC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Fortnite_Butterfly_Ghost_AnimBlueprint_C");
		return Clss;
	}

	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_1B4E103D46439F870B6BD39A474C858E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_3F28901E44BFF5AC59C8A790D0A22741();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_5E3092C440CBEC72A2CD9BBDE9DAE625();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_67225BA7459A220B89D73894D2C9B6E3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_8D235F354A1F408705ABBD9B5595BDB5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_0BE184EF4CE2C3D162C0629A1E1CD800();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_C63325524D225A16148568A75E960419();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_02E59E8544298A1041CF81B6BB5EA705();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_D02BB9994035749BB9A1C6BE4B245AEA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_SequencePlayer_3697123E41DAD0188BFF4BA18736B464();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendListByEnum_FCF59615457B3A74257CBB951041675B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_2FC1A9C74014CD14B676F8A5649B9C59();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_DDA431714F6BBF153E9480A3910740F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_4BDC7FB142F2DBB18CD2D0AA4F229640();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotateRootBone_9C15E3F741B1D0C6DBE41E84C5022497();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_FortAnimGraphNode_SpeedWarping_E99827E24710877C1F232687C1F832F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_276D46624AD91D18FC2F83B902899C99();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_A380B35847CEFC863F4B57870D997909();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_C66EDB0142373CA742EDF39994AF1A71();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_CFE760FF4A623482E8E05E9ADE436ABA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_5D31D3D346F66A0EABBC69BE1593BDF8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_5C43CCB04F5C39D629B7849D3232E3D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_FortAnimGraphNode_SpeedWarping_9F6AAEC644C2F6E47C74F6BF70AE5AAA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_8DEEE22C4BF4252258EEDFBA27B0124C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotationOffsetBlendSpace_EDBAF7F147E9319C6857ABBE5A9DD12B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_RotationOffsetBlendSpace_AE474B1443F08D76899F079D0F668BEE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_EDB3F7064ED6ADCA341CBBAED73AA457();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_ApplyAdditive_114FF6F84102EA126AE59DB229934EBF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_C7E5B67C4CEDBC4993BA7C9C2BF14A99();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_A3235F734876A9149E433F9AB6DA8AC1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_DF5A69004E1362E35D4DFBB23EC0D804();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_BB529A8A4EDC9EDE455EB69B7272DB3F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_TransitionResult_90E49C4A485FD76A7326FFB5A20E623E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint_AnimGraphNode_LayeredBoneBlend_FF94A50748BA98A65BC8ED8AD2CADE32();
	void CharPartEvent(class UFortPlayerAnimInstance* CharPart);
	void AnimNotify_playFacialAnim();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Fortnite_Butterfly_Ghost_AnimBlueprint(int32 EntryPoint, bool CallFunc_IsAnyMontagePlaying_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue1, bool CallFunc_Not_PreBool_ReturnValue2, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue3, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AFortGameStateZone* K2Node_DynamicCast_AsFort_Game_State_Zone, bool K2Node_DynamicCast_bSuccess, class UFortPlayerAnimInstance* K2Node_CustomEvent_CharPart, float K2Node_Event_DeltaTimeX, class APawn* CallFunc_TryGetPawnOwner_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_NotEqual_VectorVector_ReturnValue, const struct FRotator& CallFunc_GetBaseAimRotation_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FRotator& CallFunc_FindLookAtRotation_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct FRotator& CallFunc_NormalizedDeltaRotator_ReturnValue, float CallFunc_BreakRotator_Roll1, float CallFunc_BreakRotator_Pitch1, float CallFunc_BreakRotator_Yaw1);
	void MenuScreenDispatcher__DelegateSignature(class UFortPlayerAnimInstance* CharPart);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
