#pragma once

// Name: Fortnite, Version: 1.8.2

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum FortniteGame.EFortAIDirectorEvent
enum class EFortAIDirectorEvent : uint8_t
{

};


// Enum FortniteGame.EKeepDefenseState
enum class EKeepDefenseState : uint8_t
{

};


// Enum FortniteGame.EFortDayPhase
enum class EFortDayPhase : uint8_t
{

};


// Enum FortniteGame.EFortInventoryType
enum class EFortInventoryType : uint8_t
{

};


// Enum FortniteGame.EOfferPurchaseError
enum class EOfferPurchaseError : uint8_t
{

};


// Enum FortniteGame.EFortAlteration
enum class EFortAlteration : uint8_t
{

};


// Enum FortniteGame.EFortItemType
enum class EFortItemType : uint8_t
{

};


// Enum FortniteGame.EFortTeam
enum class EFortTeam : uint8_t
{

};


// Enum FortniteGame.EFortCustomPartType
enum class EFortCustomPartType : uint8_t
{

};


// Enum FortniteGame.EFortReportDayPhase
enum class EFortReportDayPhase : uint8_t
{

};


// Enum FortniteGame.EAthenaGamePhase
enum class EAthenaGamePhase : uint8_t
{

};


// Enum FortniteGame.EAthenaGamePhaseStep
enum class EAthenaGamePhaseStep : uint8_t
{

};


// Enum FortniteGame.ECaptureState
enum class ECaptureState : uint8_t
{

};


// Enum FortniteGame.EFOBIOStatus
enum class EFOBIOStatus : uint8_t
{

};


// Enum FortniteGame.ECollectionBookRewardType
enum class ECollectionBookRewardType : uint8_t
{

};


// Enum FortniteGame.EFortObjectiveStatus
enum class EFortObjectiveStatus : uint8_t
{

};


// Enum FortniteGame.EFortMissionVisibilityOverride
enum class EFortMissionVisibilityOverride : uint8_t
{

};


// Enum FortniteGame.EFortPrototypingStatus
enum class EFortPrototypingStatus : uint8_t
{

};


// Enum FortniteGame.EMatchmakingCompleteResult
enum class EMatchmakingCompleteResult : uint8_t
{

};


// Enum FortniteGame.EMatchmakingState
enum class EMatchmakingState : uint8_t
{

};


// Enum FortniteGame.EFortPartyRestriction
enum class EFortPartyRestriction : uint8_t
{

};


// Enum FortniteGame.EFortFriendRequestStatus
enum class EFortFriendRequestStatus : uint8_t
{

};


// Enum FortniteGame.EFortPartyMemberLocation
enum class EFortPartyMemberLocation : uint8_t
{

};


// Enum FortniteGame.EFortAthenaPlaylist
enum class EFortAthenaPlaylist : uint8_t
{

};


// Enum FortniteGame.EFortPartyState
enum class EFortPartyState : uint8_t
{

};


// Enum FortniteGame.EFortPartyMemberDisplayState
enum class EFortPartyMemberDisplayState : uint8_t
{

};


// Enum FortniteGame.EFortPartyTransition
enum class EFortPartyTransition : uint8_t
{

};


// Enum FortniteGame.EFortSocialItemHeaderType
enum class EFortSocialItemHeaderType : uint8_t
{

};


// Enum FortniteGame.EFortDialogFeedbackType
enum class EFortDialogFeedbackType : uint8_t
{

};


// Enum FortniteGame.EFortEncounterDirection
enum class EFortEncounterDirection : uint8_t
{

};


// Enum FortniteGame.EAIHotSpotSlot
enum class EAIHotSpotSlot : uint8_t
{

};


// Enum FortniteGame.EAIHotSpotAssignmentFilter
enum class EAIHotSpotAssignmentFilter : uint8_t
{

};


// Enum FortniteGame.EAIHotSpotSlotFilter
enum class EAIHotSpotSlotFilter : uint8_t
{

};


// Enum FortniteGame.EFortGliderType
enum class EFortGliderType : uint8_t
{

};


// Enum FortniteGame.EFortMissionAlertCategory
enum class EFortMissionAlertCategory : uint8_t
{

};


// Enum FortniteGame.EItemTileViewDisplayType
enum class EItemTileViewDisplayType : uint8_t
{

};


// Enum FortniteGame.EOutpostBuildings
enum class EOutpostBuildings : uint8_t
{

};


// Enum FortniteGame.EFortClientAnnouncementQueueType
enum class EFortClientAnnouncementQueueType : uint8_t
{

};


// Enum FortniteGame.EFortNotificationQueueType
enum class EFortNotificationQueueType : uint8_t
{

};


// Enum FortniteGame.EFortDialogResult
enum class EFortDialogResult : uint8_t
{

};


// Enum FortniteGame.EFortBangType
enum class EFortBangType : uint8_t
{
	EFortBangType__Invalid         = 0,
	EFortBangType__Custom          = 1,
	EFortBangType__PlayTab         = 2,
	EFortBangType__HeroesTab       = 3,
	EFortBangType__VaultTab        = 4,
	EFortBangType__StoreTab        = 5,
	EFortBangType__FriendsButton   = 6,
	EFortBangType__PartyInviteButton = 7,
	EFortBangType__DailyRewardsButton = 8,
	EFortBangType__QuestsButton    = 9,
	EFortBangType__VaultSchematics = 10,
	EFortBangType__VaultResources  = 11,
	EFortBangType__VaultMelee      = 12,
	EFortBangType__VaultRanged     = 13,
	EFortBangType__VaultConsumables = 14,
	EFortBangType__VaultIngredients = 15,
	EFortBangType__VaultTraps      = 16
};


// Enum FortniteGame.EFortEventNameType
enum class EFortEventNameType : uint8_t
{

};


// Enum FortniteGame.EFortCraftFailCause
enum class EFortCraftFailCause : uint8_t
{

};


// Enum FortniteGame.EKeepContainerType
enum class EKeepContainerType : uint8_t
{

};


// Enum FortniteGame.EFortIndicatorState
enum class EFortIndicatorState : uint8_t
{

};


// Enum FortniteGame.EReadyCheckState
enum class EReadyCheckState : uint8_t
{

};


// Enum FortniteGame.ERichPresenceStateChange
enum class ERichPresenceStateChange : uint8_t
{

};


// Enum FortniteGame.EFortTeamAffiliation
enum class EFortTeamAffiliation : uint8_t
{

};


// Enum FortniteGame.EFortAIUtility
enum class EFortAIUtility : uint8_t
{

};


// Enum FortniteGame.EFortTileEdgeType
enum class EFortTileEdgeType : uint8_t
{

};


// Enum FortniteGame.EFortRequestedGameplayAction
enum class EFortRequestedGameplayAction : uint8_t
{

};


// Enum FortniteGame.EFortGameplayState
enum class EFortGameplayState : uint8_t
{

};


// Enum FortniteGame.EFortMovementUrgency
enum class EFortMovementUrgency : uint8_t
{

};


// Enum FortniteGame.EFortMovementStyle
enum class EFortMovementStyle : uint8_t
{

};


// Enum FortniteGame.EFortWeaponTriggerType
enum class EFortWeaponTriggerType : uint8_t
{

};


// Enum FortniteGame.EFortJumpStaminaCost
enum class EFortJumpStaminaCost : uint8_t
{

};


// Enum FortniteGame.EFortDayPhasePrio
enum class EFortDayPhasePrio : uint8_t
{

};


// Enum FortniteGame.EFortCustomBodyType
enum class EFortCustomBodyType : uint8_t
{

};


// Enum FortniteGame.EFortDisplayGender
enum class EFortDisplayGender : uint8_t
{

};


// Enum FortniteGame.EFortCustomGender
enum class EFortCustomGender : uint8_t
{

};


// Enum FortniteGame.EFortCompletionResult
enum class EFortCompletionResult : uint8_t
{

};


// Enum FortniteGame.EFortPvPGameResult
enum class EFortPvPGameResult : uint8_t
{

};


// Enum FortniteGame.EFortItemTier
enum class EFortItemTier : uint8_t
{

};


// Enum FortniteGame.EFortQuality
enum class EFortQuality : uint8_t
{

};


// Enum FortniteGame.EFortRarity
enum class EFortRarity : uint8_t
{

};


// Enum FortniteGame.EFortTargetSelectionFilter
enum class EFortTargetSelectionFilter : uint8_t
{
	EFortTargetSelectionFilter__AIPawns = 0
};


// Enum FortniteGame.EFortTargetSelectionTestType
enum class EFortTargetSelectionTestType : uint8_t
{

};


// Enum FortniteGame.EFortTargetSelectionShape
enum class EFortTargetSelectionShape : uint8_t
{

};


// Enum FortniteGame.EInventoryContentSortType
enum class EInventoryContentSortType : uint8_t
{

};


// Enum FortniteGame.EFortFrontendInventoryFilter
enum class EFortFrontendInventoryFilter : uint8_t
{

};


// Enum FortniteGame.EFortInventoryFilter
enum class EFortInventoryFilter : uint8_t
{

};


// Enum FortniteGame.EFortItemCategoryOrdinal
enum class EFortItemCategoryOrdinal : uint8_t
{

};


// Enum FortniteGame.ESubGameMatchmakingStatus
enum class ESubGameMatchmakingStatus : uint8_t
{

};


// Enum FortniteGame.ESubGameAccessStatus
enum class ESubGameAccessStatus : uint8_t
{

};


// Enum FortniteGame.ENavigationObstacleOverride
enum class ENavigationObstacleOverride : uint8_t
{

};


// Enum FortniteGame.EFortPartialPathUsage
enum class EFortPartialPathUsage : uint8_t
{

};


// Enum FortniteGame.EFortBrushSize
enum class EFortBrushSize : uint8_t
{

};


// Enum FortniteGame.EHotspotTypeConfigMode
enum class EHotspotTypeConfigMode : uint8_t
{

};


// Enum FortniteGame.EFortHotSpotPreview
enum class EFortHotSpotPreview : uint8_t
{

};


// Enum FortniteGame.ESubGame
enum class ESubGame : uint8_t
{

};


// Enum FortniteGame.EFortHotSpotDirection
enum class EFortHotSpotDirection : uint8_t
{

};


// Enum FortniteGame.EFortHotSpotSlot
enum class EFortHotSpotSlot : uint8_t
{

};


// Enum FortniteGame.EBuildingFloorRailing
enum class EBuildingFloorRailing : uint8_t
{

};


// Enum FortniteGame.EBuildingStairsRailing
enum class EBuildingStairsRailing : uint8_t
{

};


// Enum FortniteGame.EBuildingWallArea
enum class EBuildingWallArea : uint8_t
{

};


// Enum FortniteGame.EAssignmentType
enum class EAssignmentType : uint8_t
{

};


// Enum FortniteGame.EFortAILODLevel
enum class EFortAILODLevel : uint8_t
{

};


// Enum FortniteGame.EFortBounceType
enum class EFortBounceType : uint8_t
{

};


// Enum FortniteGame.EFortItemEntryState
enum class EFortItemEntryState : uint8_t
{

};


// Enum FortniteGame.EFortConnectivityCubeFace
enum class EFortConnectivityCubeFace : uint8_t
{

};


// Enum FortniteGame.EFortStructuralGridQueryResults
enum class EFortStructuralGridQueryResults : uint8_t
{

};


// Enum FortniteGame.EFortCostInfoTypes
enum class EFortCostInfoTypes : uint8_t
{

};


// Enum FortniteGame.EFortBuildingInitializationReason
enum class EFortBuildingInitializationReason : uint8_t
{

};


// Enum FortniteGame.EFortBuildingPersistentState
enum class EFortBuildingPersistentState : uint8_t
{

};


// Enum FortniteGame.EFortBuildingState
enum class EFortBuildingState : uint8_t
{

};


// Enum FortniteGame.EFortDecoPlacementQueryResults
enum class EFortDecoPlacementQueryResults : uint8_t
{

};


// Enum FortniteGame.EFortResourceLevel
enum class EFortResourceLevel : uint8_t
{

};


// Enum FortniteGame.EFortResourceType
enum class EFortResourceType : uint8_t
{

};


// Enum FortniteGame.EFortTextureDataSlot
enum class EFortTextureDataSlot : uint8_t
{

};


// Enum FortniteGame.EFortTextureDataType
enum class EFortTextureDataType : uint8_t
{

};


// Enum FortniteGame.EBuildingAttachmentType
enum class EBuildingAttachmentType : uint8_t
{

};


// Enum FortniteGame.EFortBuildingType
enum class EFortBuildingType : uint8_t
{

};


// Enum FortniteGame.EFortMissionAudibility
enum class EFortMissionAudibility : uint8_t
{

};


// Enum FortniteGame.EFortMissionType
enum class EFortMissionType : uint8_t
{

};


// Enum FortniteGame.EFortMissionStatus
enum class EFortMissionStatus : uint8_t
{

};


// Enum FortniteGame.EMissionGenerationCategory
enum class EMissionGenerationCategory : uint8_t
{

};


// Enum FortniteGame.TInteractionType
enum class ETInteractionType : uint8_t
{

};


// Enum FortniteGame.EFortPIDValueGraphElements
enum class EFortPIDValueGraphElements : uint8_t
{

};


// Enum FortniteGame.EFortIntensityGraphElements
enum class EFortIntensityGraphElements : uint8_t
{

};


// Enum FortniteGame.EFortContributionGraphElements
enum class EFortContributionGraphElements : uint8_t
{

};


// Enum FortniteGame.EBuildingHighlightType
enum class EBuildingHighlightType : uint8_t
{

};


// Enum FortniteGame.EFortObjectiveRequirement
enum class EFortObjectiveRequirement : uint8_t
{

};


// Enum FortniteGame.EFortAIDirectorFactor
enum class EFortAIDirectorFactor : uint8_t
{

};


// Enum FortniteGame.EFortCombatFactors
enum class EFortCombatFactors : uint8_t
{

};


// Enum FortniteGame.EFortCombatEvents
enum class EFortCombatEvents : uint8_t
{

};


// Enum FortniteGame.EFortAIDirectorEventParticipant
enum class EFortAIDirectorEventParticipant : uint8_t
{

};


// Enum FortniteGame.EFortFactorContributionType
enum class EFortFactorContributionType : uint8_t
{

};


// Enum FortniteGame.EFortElementalDamageType
enum class EFortElementalDamageType : uint8_t
{

};


// Enum FortniteGame.EFortDamageZone
enum class EFortDamageZone : uint8_t
{

};


// Enum FortniteGame.EFortBaseWeaponDamage
enum class EFortBaseWeaponDamage : uint8_t
{

};


// Enum FortniteGame.EFortWeaponCoreAnimation
enum class EFortWeaponCoreAnimation : uint8_t
{

};


// Enum FortniteGame.EFortReloadFXState
enum class EFortReloadFXState : uint8_t
{

};


// Enum FortniteGame.EFortWeaponSoundState
enum class EFortWeaponSoundState : uint8_t
{

};


// Enum FortniteGame.EFortMontageInputType
enum class EFortMontageInputType : uint8_t
{

};


// Enum FortniteGame.EFortAbilityTargetingSource
enum class EFortAbilityTargetingSource : uint8_t
{

};


// Enum FortniteGame.EAbilitySystemComponentCreationPolicy
enum class EAbilitySystemComponentCreationPolicy : uint8_t
{

};


// Enum FortniteGame.EAttributeInitLevelSource
enum class EAttributeInitLevelSource : uint8_t
{

};


// Enum FortniteGame.EDynamicBuildingPlacementType
enum class EDynamicBuildingPlacementType : uint8_t
{

};


// Enum FortniteGame.ELootQuotaLevel
enum class ELootQuotaLevel : uint8_t
{

};


// Enum FortniteGame.EBuildingNavObstacleType
enum class EBuildingNavObstacleType : uint8_t
{

};


// Enum FortniteGame.EFortDamageVisualsState
enum class EFortDamageVisualsState : uint8_t
{

};


// Enum FortniteGame.EStructuralSupportCheck
enum class EStructuralSupportCheck : uint8_t
{

};


// Enum FortniteGame.EBuildingReplacementType
enum class EBuildingReplacementType : uint8_t
{

};


// Enum FortniteGame.EPlacementType
enum class EPlacementType : uint8_t
{

};


// Enum FortniteGame.EBuildingAttachmentSide
enum class EBuildingAttachmentSide : uint8_t
{

};


// Enum FortniteGame.EBuildingAttachmentSlot
enum class EBuildingAttachmentSlot : uint8_t
{

};


// Enum FortniteGame.EBuildingAnim
enum class EBuildingAnim : uint8_t
{

};


// Enum FortniteGame.EBoundingBoxSlotDirectionCalculation
enum class EBoundingBoxSlotDirectionCalculation : uint8_t
{
	EBoundingBoxSlotDirectionCalculation__FaceWall = 0,
	EBoundingBoxSlotDirectionCalculation__FaceCenter = 1
};


// Enum FortniteGame.EFortProximityBasedGEApplicationType
enum class EFortProximityBasedGEApplicationType : uint8_t
{
	EFortProximityBasedGEApplicationType__ApplyOnProximityPulse = 0,
	EFortProximityBasedGEApplicationType__ApplyOnProximityTouch = 1,
	EFortProximityBasedGEApplicationType__ApplyOnlyDuringProximityTouch = 2
};


// Enum FortniteGame.EFortDeliveryInfoBuildingActorSpecification
enum class EFortDeliveryInfoBuildingActorSpecification : uint8_t
{

};


// Enum FortniteGame.EUnlockRules
enum class EUnlockRules : uint8_t
{

};


// Enum FortniteGame.EContentionRules
enum class EContentionRules : uint8_t
{

};


// Enum FortniteGame.EFortIsFinalXpUpdate
enum class EFortIsFinalXpUpdate : uint8_t
{

};


// Enum FortniteGame.EFortAmmoType
enum class EFortAmmoType : uint8_t
{

};


// Enum FortniteGame.EFortCombatThresholds
enum class EFortCombatThresholds : uint8_t
{

};


// Enum FortniteGame.EFortRewardType
enum class EFortRewardType : uint8_t
{

};


// Enum FortniteGame.EStatCategory
enum class EStatCategory : uint8_t
{

};


// Enum FortniteGame.EFortReplicatedStat
enum class EFortReplicatedStat : uint8_t
{

};


// Enum FortniteGame.EFortRewardActivityType
enum class EFortRewardActivityType : uint8_t
{

};


// Enum FortniteGame.EFortReplenishmentType
enum class EFortReplenishmentType : uint8_t
{

};


// Enum FortniteGame.EFortTemplateAccess
enum class EFortTemplateAccess : uint8_t
{

};


// Enum FortniteGame.EItemUpgradeRestrictionReason
enum class EItemUpgradeRestrictionReason : uint8_t
{

};


// Enum FortniteGame.EFOBFileHeaderStatus
enum class EFOBFileHeaderStatus : uint8_t
{

};


// Enum FortniteGame.EFOBInitStatus
enum class EFOBInitStatus : uint8_t
{

};


// Enum FortniteGame.EFOBMode
enum class EFOBMode : uint8_t
{

};


// Enum FortniteGame.EFortItemCollectorBehavior
enum class EFortItemCollectorBehavior : uint8_t
{

};


// Enum FortniteGame.EFortItemCollectorState
enum class EFortItemCollectorState : uint8_t
{

};


// Enum FortniteGame.EDeployableBaseConstructionStatus
enum class EDeployableBaseConstructionStatus : uint8_t
{

};


// Enum FortniteGame.EDeployableBaseBuildingState
enum class EDeployableBaseBuildingState : uint8_t
{

};


// Enum FortniteGame.EFortQuickBars
enum class EFortQuickBars : uint8_t
{

};


// Enum FortniteGame.EDeployableBaseBoxType
enum class EDeployableBaseBoxType : uint8_t
{

};


// Enum FortniteGame.EFortMiniMapIconRotation
enum class EFortMiniMapIconRotation : uint8_t
{

};


// Enum FortniteGame.EFortMiniMapContext
enum class EFortMiniMapContext : uint8_t
{

};


// Enum FortniteGame.EFortAbilityTargetSelectionUsage
enum class EFortAbilityTargetSelectionUsage : uint8_t
{

};


// Enum FortniteGame.EFortAbilityCostSource
enum class EFortAbilityCostSource : uint8_t
{

};


// Enum FortniteGame.EFortGameplayAbilityActivation
enum class EFortGameplayAbilityActivation : uint8_t
{

};


// Enum FortniteGame.EFortAIWeaponUsage
enum class EFortAIWeaponUsage : uint8_t
{

};


// Enum FortniteGame.EFortGameplayAbilityMontageSectionToPlay
enum class EFortGameplayAbilityMontageSectionToPlay : uint8_t
{

};


// Enum FortniteGame.EItemEvolutionRestrictionReason
enum class EItemEvolutionRestrictionReason : uint8_t
{

};


// Enum FortniteGame.EFortRiftSlotStatus
enum class EFortRiftSlotStatus : uint8_t
{

};


// Enum FortniteGame.EFortDisplayTier
enum class EFortDisplayTier : uint8_t
{

};


// Enum FortniteGame.ETrackVerticality
enum class ETrackVerticality : uint8_t
{

};


// Enum FortniteGame.ETrackIncline
enum class ETrackIncline : uint8_t
{

};


// Enum FortniteGame.ETrackPieceType
enum class ETrackPieceType : uint8_t
{

};


// Enum FortniteGame.ETrackDirection
enum class ETrackDirection : uint8_t
{

};


// Enum FortniteGame.EFortAccountLinkingUIConfig
enum class EFortAccountLinkingUIConfig : uint8_t
{

};


// Enum FortniteGame.EFortStrategicBuildingLevelCriteriaDisplayRepresentation
enum class EFortStrategicBuildingLevelCriteriaDisplayRepresentation : uint8_t
{

};


// Enum FortniteGame.EFortMiniMapHeight
enum class EFortMiniMapHeight : uint8_t
{

};


// Enum FortniteGame.EMusicFadeStyles
enum class EMusicFadeStyles : uint8_t
{

};


// Enum FortniteGame.EBuildingFoundationType
enum class EBuildingFoundationType : uint8_t
{

};


// Enum FortniteGame.ELayoutRequirementStatus
enum class ELayoutRequirementStatus : uint8_t
{

};


// Enum FortniteGame.EFortDefenderInteractionError
enum class EFortDefenderInteractionError : uint8_t
{

};


// Enum FortniteGame.FDynamicBuildOrder
enum class EFDynamicBuildOrder : uint8_t
{

};


// Enum FortniteGame.EFortThreatDeactivationType
enum class EFortThreatDeactivationType : uint8_t
{

};


// Enum FortniteGame.EMusicChannel
enum class EMusicChannel : uint8_t
{

};


// Enum FortniteGame.EAuxIndicatorStates
enum class EAuxIndicatorStates : uint8_t
{

};


// Enum FortniteGame.EColorSwatchType
enum class EColorSwatchType : uint8_t
{

};


// Enum FortniteGame.ECharacterColorSwatchType
enum class ECharacterColorSwatchType : uint8_t
{

};


// Enum FortniteGame.ECustomHatType
enum class ECustomHatType : uint8_t
{

};


// Enum FortniteGame.EClothingColorName
enum class EClothingColorName : uint8_t
{

};


// Enum FortniteGame.EFortAttributeDisplay
enum class EFortAttributeDisplay : uint8_t
{

};


// Enum FortniteGame.EFortStatDisplayType
enum class EFortStatDisplayType : uint8_t
{

};


// Enum FortniteGame.EFortDirectedMovementSpace
enum class EFortDirectedMovementSpace : uint8_t
{

};


// Enum FortniteGame.EFortStrategicBuildingCategory
enum class EFortStrategicBuildingCategory : uint8_t
{

};


// Enum FortniteGame.EBinaryToggleValues
enum class EBinaryToggleValues : uint8_t
{

};


// Enum FortniteGame.EPathObstacleAction
enum class EPathObstacleAction : uint8_t
{

};


// Enum FortniteGame.EFortFeedbackBroadcastFilter
enum class EFortFeedbackBroadcastFilter : uint8_t
{

};


// Enum FortniteGame.EFortFeedbackSelectionMethod
enum class EFortFeedbackSelectionMethod : uint8_t
{

};


// Enum FortniteGame.EPathUndermineEvent
enum class EPathUndermineEvent : uint8_t
{

};


// Enum FortniteGame.EFortFeedbackContext
enum class EFortFeedbackContext : uint8_t
{

};


// Enum FortniteGame.EFortSentenceAudioPreference
enum class EFortSentenceAudioPreference : uint8_t
{

};


// Enum FortniteGame.EFortPickupTossState
enum class EFortPickupTossState : uint8_t
{

};


// Enum FortniteGame.EFortControlRecoveryBehavior
enum class EFortControlRecoveryBehavior : uint8_t
{

};


// Enum FortniteGame.EFortFeedbackAddressee
enum class EFortFeedbackAddressee : uint8_t
{

};


// Enum FortniteGame.EFortAIPawnGender
enum class EFortAIPawnGender : uint8_t
{

};


// Enum FortniteGame.EFortAILevelRatingDisplayType
enum class EFortAILevelRatingDisplayType : uint8_t
{

};


// Enum FortniteGame.EFortressAIType
enum class EFortressAIType : uint8_t
{

};


// Enum FortniteGame.EFortPawnPushSize
enum class EFortPawnPushSize : uint8_t
{

};


// Enum FortniteGame.EFortEncounterUtilitiesMode
enum class EFortEncounterUtilitiesMode : uint8_t
{

};


// Enum FortniteGame.EFortEncounterSpawnLocationPlacementMode
enum class EFortEncounterSpawnLocationPlacementMode : uint8_t
{

};


// Enum FortniteGame.EAccessoryColorName
enum class EAccessoryColorName : uint8_t
{

};


// Enum FortniteGame.EFortEncounterPacingMode
enum class EFortEncounterPacingMode : uint8_t
{

};


// Enum FortniteGame.EFortEncounterSpawnLimitType
enum class EFortEncounterSpawnLimitType : uint8_t
{

};


// Enum FortniteGame.EWardAffectType
enum class EWardAffectType : uint8_t
{

};


// Enum FortniteGame.EFortEncounterUtilityDesire
enum class EFortEncounterUtilityDesire : uint8_t
{

};


// Enum FortniteGame.EFortAIDirectorFactorContribution
enum class EFortAIDirectorFactorContribution : uint8_t
{

};


// Enum FortniteGame.EFortAIDirectorEventContribution
enum class EFortAIDirectorEventContribution : uint8_t
{

};


// Enum FortniteGame.ETagGoalScoringCategory
enum class ETagGoalScoringCategory : uint8_t
{

};


// Enum FortniteGame.EFortIntensityCurveSequenceType
enum class EFortIntensityCurveSequenceType : uint8_t
{

};


// Enum FortniteGame.EFortEncounterState
enum class EFortEncounterState : uint8_t
{

};


// Enum FortniteGame.EFortEncounterPacingState
enum class EFortEncounterPacingState : uint8_t
{

};


// Enum FortniteGame.EFortEncounterSequenceResult
enum class EFortEncounterSequenceResult : uint8_t
{

};


// Enum FortniteGame.EAssignmentCreationResult
enum class EAssignmentCreationResult : uint8_t
{

};


// Enum FortniteGame.ECorePerceptionTypes
enum class ECorePerceptionTypes : uint8_t
{

};


// Enum FortniteGame.EFortAIWaveProgressSection
enum class EFortAIWaveProgressSection : uint8_t
{

};


// Enum FortniteGame.EFortHuskAnimType
enum class EFortHuskAnimType : uint8_t
{

};


// Enum FortniteGame.ESpecializationType
enum class ESpecializationType : uint8_t
{

};


// Enum FortniteGame.EFortPawnStasisMode
enum class EFortPawnStasisMode : uint8_t
{

};


// Enum FortniteGame.EFortAnnouncementChannel
enum class EFortAnnouncementChannel : uint8_t
{

};


// Enum FortniteGame.EFortAnnouncementDelivery
enum class EFortAnnouncementDelivery : uint8_t
{

};


// Enum FortniteGame.EStatRecordingPeriod
enum class EStatRecordingPeriod : uint8_t
{

};


// Enum FortniteGame.EStatMod
enum class EStatMod : uint8_t
{

};


// Enum FortniteGame.EFortEventConditionType
enum class EFortEventConditionType : uint8_t
{

};


// Enum FortniteGame.EFortAnnouncementDisplayPreference
enum class EFortAnnouncementDisplayPreference : uint8_t
{

};


// Enum FortniteGame.EFortCompare
enum class EFortCompare : uint8_t
{

};


// Enum FortniteGame.EFortEventRepeat
enum class EFortEventRepeat : uint8_t
{

};


// Enum FortniteGame.EPrereqNodeType
enum class EPrereqNodeType : uint8_t
{

};


// Enum FortniteGame.EFortHomebaseNodeActionType
enum class EFortHomebaseNodeActionType : uint8_t
{

};


// Enum FortniteGame.EFortHomebaseNodeMagnitude
enum class EFortHomebaseNodeMagnitude : uint8_t
{

};


// Enum FortniteGame.EFortHomebaseNodeDisplayType
enum class EFortHomebaseNodeDisplayType : uint8_t
{

};


// Enum FortniteGame.EFortHomebaseSquadSlotType
enum class EFortHomebaseSquadSlotType : uint8_t
{

};


// Enum FortniteGame.EFortHomebaseSquadType
enum class EFortHomebaseSquadType : uint8_t
{

};


// Enum FortniteGame.EFortNotificationType
enum class EFortNotificationType : uint8_t
{

};


// Enum FortniteGame.EFortHexTileAdjacency
enum class EFortHexTileAdjacency : uint8_t
{

};


// Enum FortniteGame.EFortTheaterType
enum class EFortTheaterType : uint8_t
{

};


// Enum FortniteGame.EFortTheaterMapTileType
enum class EFortTheaterMapTileType : uint8_t
{

};


// Enum FortniteGame.EFortNotificationPriority
enum class EFortNotificationPriority : uint8_t
{

};


// Enum FortniteGame.EFortQuestState
enum class EFortQuestState : uint8_t
{

};


// Enum FortniteGame.EFortMissionQuestValidityResult
enum class EFortMissionQuestValidityResult : uint8_t
{

};


// Enum FortniteGame.EWaveRules
enum class EWaveRules : uint8_t
{

};


// Enum FortniteGame.EFriendFeedbackType
enum class EFriendFeedbackType : uint8_t
{

};


// Enum FortniteGame.EClampType
enum class EClampType : uint8_t
{

};


// Enum FortniteGame.EDeployableBaseUseType
enum class EDeployableBaseUseType : uint8_t
{

};


// Enum FortniteGame.EFortZoneType
enum class EFortZoneType : uint8_t
{

};


// Enum FortniteGame.EFortMtxPlatform
enum class EFortMtxPlatform : uint8_t
{

};


// Enum FortniteGame.EAthenaCustomizationCategory
enum class EAthenaCustomizationCategory : uint8_t
{

};


// Enum FortniteGame.EMontageInterrupt
enum class EMontageInterrupt : uint8_t
{

};


// Enum FortniteGame.ECameraOrigin
enum class ECameraOrigin : uint8_t
{

};


// Enum FortniteGame.EFortVisibilityBehavior
enum class EFortVisibilityBehavior : uint8_t
{

};


// Enum FortniteGame.EFortSafeZoneState
enum class EFortSafeZoneState : uint8_t
{

};


// Enum FortniteGame.ECollectionSelectionMethod
enum class ECollectionSelectionMethod : uint8_t
{

};


// Enum FortniteGame.ETargetDistanceComparisonType
enum class ETargetDistanceComparisonType : uint8_t
{

};


// Enum FortniteGame.EFortSocialItemPresenceStatus
enum class EFortSocialItemPresenceStatus : uint8_t
{

};


// Enum FortniteGame.EFortSocialItemType
enum class EFortSocialItemType : uint8_t
{

};


// Enum FortniteGame.EMcpLeaderboardTimeWindow
enum class EMcpLeaderboardTimeWindow : uint8_t
{

};


// Enum FortniteGame.EFortDamageNumberType
enum class EFortDamageNumberType : uint8_t
{

};


// Enum FortniteGame.EFortCollectionBookState
enum class EFortCollectionBookState : uint8_t
{

};


// Enum FortniteGame.ETimespanAsTextFormat
enum class ETimespanAsTextFormat : uint8_t
{

};


// Enum FortniteGame.EHordeTierStartStatus
enum class EHordeTierStartStatus : uint8_t
{

};


// Enum FortniteGame.EFortUserCloudRequestResult
enum class EFortUserCloudRequestResult : uint8_t
{

};


// Enum FortniteGame.ETeamChatRoomState
enum class ETeamChatRoomState : uint8_t
{

};


// Enum FortniteGame.EFortWorldManagerState
enum class EFortWorldManagerState : uint8_t
{

};


// Enum FortniteGame.EFortLevelStreamingState
enum class EFortLevelStreamingState : uint8_t
{

};


// Enum FortniteGame.EFortQueuedActionUserStatus
enum class EFortQueuedActionUserStatus : uint8_t
{

};


// Enum FortniteGame.EFortWorldRecordState
enum class EFortWorldRecordState : uint8_t
{

};


// Enum FortniteGame.EFortUserCloudRequestType
enum class EFortUserCloudRequestType : uint8_t
{

};


// Enum FortniteGame.EFortWorldRecordAction
enum class EFortWorldRecordAction : uint8_t
{

};


// Enum FortniteGame.EHordeWaveStingerType
enum class EHordeWaveStingerType : uint8_t
{

};


// Enum FortniteGame.EQueueActionType
enum class EQueueActionType : uint8_t
{

};


// Enum FortniteGame.EAthenaPIEStartupMode
enum class EAthenaPIEStartupMode : uint8_t
{

};


// Enum FortniteGame.EPvPGameEndReasons
enum class EPvPGameEndReasons : uint8_t
{

};


// Enum FortniteGame.EFortInputActionGroup
enum class EFortInputActionGroup : uint8_t
{

};


// Enum FortniteGame.EFortInputActionType
enum class EFortInputActionType : uint8_t
{

};


// Enum FortniteGame.EInventoryOverflowReason
enum class EInventoryOverflowReason : uint8_t
{

};


// Enum FortniteGame.EFortPickerToDisplay
enum class EFortPickerToDisplay : uint8_t
{

};


// Enum FortniteGame.EFortQuestObjectiveItemEvent
enum class EFortQuestObjectiveItemEvent : uint8_t
{

};


// Enum FortniteGame.EFortQuestObjectiveStatEvent
enum class EFortQuestObjectiveStatEvent : uint8_t
{

};


// Enum FortniteGame.EFortOptionGenerationResult
enum class EFortOptionGenerationResult : uint8_t
{

};


// Enum FortniteGame.EFortQuestType
enum class EFortQuestType : uint8_t
{

};


// Enum FortniteGame.ERewardSource
enum class ERewardSource : uint8_t
{

};


// Enum FortniteGame.EFortServerGameMode
enum class EFortServerGameMode : uint8_t
{

};


// Enum FortniteGame.EFortMatchKickAction
enum class EFortMatchKickAction : uint8_t
{

};


// Enum FortniteGame.EAthenaAerialPhase
enum class EAthenaAerialPhase : uint8_t
{

};


// Enum FortniteGame.EFortNamedNavmesh
enum class EFortNamedNavmesh : uint8_t
{

};


// Enum FortniteGame.EFortCharacterCosmetic
enum class EFortCharacterCosmetic : uint8_t
{

};


// Enum FortniteGame.EFortQuestRewardType
enum class EFortQuestRewardType : uint8_t
{

};


// Enum FortniteGame.ETwitchViewerStatusType
enum class ETwitchViewerStatusType : uint8_t
{

};


// Enum FortniteGame.ELobbyMissionGeneratorDetailsRequirement
enum class ELobbyMissionGeneratorDetailsRequirement : uint8_t
{

};


// Enum FortniteGame.EFortMatchmakingPool
enum class EFortMatchmakingPool : uint8_t
{

};


// Enum FortniteGame.ECodeTokenPlatform
enum class ECodeTokenPlatform : uint8_t
{

};


// Enum FortniteGame.EFortMatchmakingPrivacyConfiguration
enum class EFortMatchmakingPrivacyConfiguration : uint8_t
{

};


// Enum FortniteGame.EMatchmakingFlags
enum class EMatchmakingFlags : uint8_t
{

};


// Enum FortniteGame.EMatchmakingStartLocation
enum class EMatchmakingStartLocation : uint8_t
{

};


// Enum FortniteGame.EFortSupportBonusType
enum class EFortSupportBonusType : uint8_t
{

};


// Enum FortniteGame.EFortMatchmakingType
enum class EFortMatchmakingType : uint8_t
{

};


// Enum FortniteGame.EFortSessionHelperJoinState
enum class EFortSessionHelperJoinState : uint8_t
{

};


// Enum FortniteGame.EPollActorsInVolumeTypes
enum class EPollActorsInVolumeTypes : uint8_t
{

};


// Enum FortniteGame.EMissionReplyTypes
enum class EMissionReplyTypes : uint8_t
{

};


// Enum FortniteGame.ETimerOverrideSetting
enum class ETimerOverrideSetting : uint8_t
{

};


// Enum FortniteGame.EFortAreaFlag
enum class EFortAreaFlag : uint8_t
{

};


// Enum FortniteGame.EFortAnnouncerTeamVocalChords
enum class EFortAnnouncerTeamVocalChords : uint8_t
{

};


// Enum FortniteGame.ETrustedPlatformType
enum class ETrustedPlatformType : uint8_t
{

};


// Enum FortniteGame.EFrontEndCamera
enum class EFrontEndCamera : uint8_t
{

};


// Enum FortniteGame.EFortNavLinkPattern
enum class EFortNavLinkPattern : uint8_t
{

};


// Enum FortniteGame.ESpectatorCameraType
enum class ESpectatorCameraType : uint8_t
{

};


// Enum FortniteGame.EFocusMethod
enum class EFocusMethod : uint8_t
{

};


// Enum FortniteGame.EDeathCause
enum class EDeathCause : uint8_t
{

};


// Enum FortniteGame.EFortPointsFromNavGraphGoalPathDistanceFilterOperator
enum class EFortPointsFromNavGraphGoalPathDistanceFilterOperator : uint8_t
{

};


// Enum FortniteGame.EFortTestGoalActorDot
enum class EFortTestGoalActorDot : uint8_t
{

};


// Enum FortniteGame.ECountAIAssignedToType
enum class ECountAIAssignedToType : uint8_t
{

};


// Enum FortniteGame.ETwoPointSolverRotationA
enum class ETwoPointSolverRotationA : uint8_t
{

};


// Enum FortniteGame.ERegisteredPlayerUnregistrationStatus
enum class ERegisteredPlayerUnregistrationStatus : uint8_t
{

};


// Enum FortniteGame.EFortUIScoreType
enum class EFortUIScoreType : uint8_t
{

};


// Enum FortniteGame.EFortScriptedActionEnvironment
enum class EFortScriptedActionEnvironment : uint8_t
{

};


// Enum FortniteGame.EFortScriptedActionSource
enum class EFortScriptedActionSource : uint8_t
{

};


// Enum FortniteGame.EFortCheatMissionGenType
enum class EFortCheatMissionGenType : uint8_t
{

};


// Enum FortniteGame.EDistanceMode
enum class EDistanceMode : uint8_t
{

};


// Enum FortniteGame.EFortContextualReticleTypes
enum class EFortContextualReticleTypes : uint8_t
{

};


// Enum FortniteGame.EFortReloadMontageSection
enum class EFortReloadMontageSection : uint8_t
{

};


// Enum FortniteGame.EFortSessionHelperJoinResult
enum class EFortSessionHelperJoinResult : uint8_t
{

};


// Enum FortniteGame.ESpeedWarpingAxisMode
enum class ESpeedWarpingAxisMode : uint8_t
{

};


// Enum FortniteGame.EFortUIFriendNotificationType
enum class EFortUIFriendNotificationType : uint8_t
{

};



//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct FortniteGame.FortMultiSizeBrush
// 0x0360
struct FFortMultiSizeBrush
{
	unsigned char                                      UnknownData00[0x360];                                     // 0x0000(0x0360) MISSED OFFSET
};

// ScriptStruct FortniteGame.AIHotSpotSlotConfig
// 0x001C
struct FAIHotSpotSlotConfig
{
	struct FVector                                     Offset;                                                   // 0x0000(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Direction;                                                // 0x000C(0x000C) (Edit, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0018(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.MyFortCategoryData
// 0x0058
struct FMyFortCategoryData
{
	struct FText                                       CategoryName;                                             // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x40];                                      // 0x0018(0x0040) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortDialogExternalLatentActionHandle
// 0x0004
struct FFortDialogExternalLatentActionHandle
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.AttributeInfo
// 0x0010
struct FAttributeInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortPartyRepState
// 0x0068 (0x0078 - 0x0010)
struct FFortPartyRepState : public FPartyState
{
	unsigned char                                      UnknownData00[0x68];                                      // 0x0010(0x0068) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortInputActionKeyAlias
// 0x0028
struct FFortInputActionKeyAlias
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct FortniteGame.DeathInfo
// 0x0010
struct FDeathInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.ThreatLocationInfo
// 0x0054 (0x0060 - 0x000C)
struct FThreatLocationInfo : public FFastArraySerializerItem
{
	unsigned char                                      UnknownData00[0x54];                                      // 0x000C(0x0054) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAttributeInfo
// 0x0078
struct FFortAttributeInfo
{
	unsigned char                                      UnknownData00[0x78];                                      // 0x0000(0x0078) MISSED OFFSET
};

// ScriptStruct FortniteGame.ProjectileEventData
// 0x0028
struct FProjectileEventData
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIDirectorEvent
// 0x0020
struct FFortAIDirectorEvent
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct FortniteGame.MtxPackage
// 0x00A0
struct FMtxPackage
{
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0000(0x00A0) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortPublicAccountInfo
// 0x0024
struct FFortPublicAccountInfo
{
	int                                                Level;                                                    // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0004(0x0020) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortPrivateAccountInfo
// 0x0004 (0x0028 - 0x0024)
struct FFortPrivateAccountInfo : public FFortPublicAccountInfo
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.AthenaLevelInfo
// 0x0014
struct FAthenaLevelInfo
{
	unsigned char                                      UnknownData00[0x14];                                      // 0x0000(0x0014) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortHomeBaseInfo
// 0x0040
struct FFortHomeBaseInfo
{
	unsigned char                                      UnknownData00[0x40];                                      // 0x0000(0x0040) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortItemInstanceQuantityPair
// 0x0010
struct FFortItemInstanceQuantityPair
{
	class UFortItem*                                   Item;                                                     // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct FortniteGame.FriendCode
// 0x0020
struct FFriendCode
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAthenaLoadout
// 0x0068
struct FFortAthenaLoadout
{
	unsigned char                                      UnknownData00[0x68];                                      // 0x0000(0x0068) MISSED OFFSET
};

// ScriptStruct FortniteGame.FriendCodeLocString
// 0x0020
struct FFriendCodeLocString
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortTeamMemberInfo
// 0x0190
struct FFortTeamMemberInfo
{
	unsigned char                                      UnknownData00[0x190];                                     // 0x0000(0x0190) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortCollectionBookRewards
// 0x0070
struct FFortCollectionBookRewards
{
	unsigned char                                      UnknownData00[0x70];                                      // 0x0000(0x0070) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortRewardInfo
// 0x0030
struct FFortRewardInfo
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortHiddenRewardQuantityPair
// 0x0010
struct FFortHiddenRewardQuantityPair
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortSelectableRewardOption
// 0x0010
struct FFortSelectableRewardOption
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortItemQuantityPair
// 0x0028
struct FFortItemQuantityPair
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortDialogDescription
// 0x0170
struct FFortDialogDescription
{
	unsigned char                                      UnknownData00[0x170];                                     // 0x0000(0x0170) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortEncounterSettings
// 0x0058
struct FFortEncounterSettings
{
	unsigned char                                      UnknownData00[0x58];                                      // 0x0000(0x0058) MISSED OFFSET
};

// ScriptStruct FortniteGame.HomebaseNodePage
// 0x0058 (0x0060 - 0x0008)
struct FHomebaseNodePage : public FTableRowBase
{
	struct FText                                       DisplayName;                                              // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FText                                       Description;                                              // 0x0020(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0038(0x0028) MISSED OFFSET
};

// ScriptStruct FortniteGame.HomebaseNode
// 0x00B8 (0x00C0 - 0x0008)
struct FHomebaseNode : public FTableRowBase
{
	struct FText                                       DisplayName;                                              // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0020(0x00A0) MISSED OFFSET
};

// ScriptStruct FortniteGame.HomebaseSquadSlotId
// 0x0010
struct FHomebaseSquadSlotId
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.HomebaseNodeANDPrerequisites
// 0x0010
struct FHomebaseNodeANDPrerequisites
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.HomebaseNodeInstancePrerequisites
// 0x0020
struct FHomebaseNodeInstancePrerequisites
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortInputActionDetails
// 0x0020
struct FFortInputActionDetails
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct FortniteGame.GameSummaryInfo
// 0x0018
struct FGameSummaryInfo
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortDialogDescription_NUI
// 0x0180
struct FFortDialogDescription_NUI
{
	unsigned char                                      UnknownData00[0x180];                                     // 0x0000(0x0180) MISSED OFFSET
};

// ScriptStruct FortniteGame.ConfirmationDialogAction
// 0x00D0
struct FConfirmationDialogAction
{
	struct FText                                       DisplayName;                                              // 0x0000(0x0018) (BlueprintVisible)
	unsigned char                                      UnknownData00[0xB8];                                      // 0x0018(0x00B8) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortTagUIData
// 0x0398
struct FFortTagUIData
{
	unsigned char                                      UnknownData00[0x398];                                     // 0x0000(0x0398) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortPlayerDeathReport
// 0x0050
struct FFortPlayerDeathReport
{
	unsigned char                                      UnknownData00[0x50];                                      // 0x0000(0x0050) MISSED OFFSET
};

// ScriptStruct FortniteGame.EndOfDayRecap
// 0x0020
struct FEndOfDayRecap
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortPlayerScoreReport
// 0x0288
struct FFortPlayerScoreReport
{
	unsigned char                                      UnknownData00[0x288];                                     // 0x0000(0x0288) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortExperienceDelta
// 0x0024
struct FFortExperienceDelta
{
	int                                                Level;                                                    // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0004(0x0020) MISSED OFFSET
};

// ScriptStruct FortniteGame.ReplicatedStatValues
// 0x0008
struct FReplicatedStatValues
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortClientAnnouncementData
// 0x0001
struct FFortClientAnnouncementData
{
	unsigned char                                      UnknownData00[0x1];                                       // 0x0000(0x0001) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortClientAnnouncementData_Basic
// 0x00EF (0x00F0 - 0x0001)
struct FFortClientAnnouncementData_Basic : public FFortClientAnnouncementData
{
	unsigned char                                      UnknownData00[0xEF];                                      // 0x0001(0x00EF) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortClientAnnouncementData_Tutorial
// 0x0050 (0x0140 - 0x00F0)
struct FFortClientAnnouncementData_Tutorial : public FFortClientAnnouncementData_Basic
{
	unsigned char                                      UnknownData00[0x50];                                      // 0x00F0(0x0050) MISSED OFFSET
};

// ScriptStruct FortniteGame.HomebaseSquad
// 0x0080 (0x0088 - 0x0008)
struct FHomebaseSquad : public FTableRowBase
{
	struct FText                                       DisplayName;                                              // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x68];                                      // 0x0020(0x0068) MISSED OFFSET
};

// ScriptStruct FortniteGame.HomebaseSquadSlot
// 0x0060
struct FHomebaseSquadSlot
{
	struct FText                                       DisplayName;                                              // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x48];                                      // 0x0018(0x0048) MISSED OFFSET
};

// ScriptStruct FortniteGame.HomebaseSquadAttributeBonus
// 0x0030
struct FHomebaseSquadAttributeBonus
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct FortniteGame.AIHotSpotSlotInfo
// 0x0010
struct FAIHotSpotSlotInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.DataTableRowHandleQuantityPair
// 0x0018
struct FDataTableRowHandleQuantityPair
{
	struct FDataTableRowHandle                         DataTableRowHandle;                                       // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortEffectDistanceQuality
// 0x0018
struct FFortEffectDistanceQuality
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct FortniteGame.KeybindIcon
// 0x0378
struct FKeybindIcon
{
	struct FKey                                        Key;                                                      // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FFortMultiSizeBrush                         Brush;                                                    // 0x0018(0x0360) (Edit, BlueprintVisible, BlueprintReadOnly)
};

// ScriptStruct FortniteGame.FortParticleSystemParamBucket
// 0x0010
struct FFortParticleSystemParamBucket
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortClientEvent
// 0x0020
struct FFortClientEvent
{
	struct FName                                       CategoryName;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0008(0x0018) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortEventName
// 0x0010
struct FFortEventName
{
	struct FName                                       CategoryName;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortClientEventName
// 0x0000 (0x0010 - 0x0010)
struct FFortClientEventName : public FFortEventName
{

};

// ScriptStruct FortniteGame.FortMissionEventName
// 0x0000 (0x0010 - 0x0010)
struct FFortMissionEventName : public FFortEventName
{

};

// ScriptStruct FortniteGame.FortCatalogMetaPreload
// 0x0030
struct FFortCatalogMetaPreload
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortCatalogMeta
// 0x0018
struct FFortCatalogMeta
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortSpawnContext
// 0x0028
struct FFortSpawnContext
{
	TEnumAsByte<EFortTeam>                             Team;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, SaveGame, IsPlainOldData)
	unsigned char                                      UnknownData00[0x27];                                      // 0x0001(0x0027) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortQuestPackInfo
// 0x0030
struct FFortQuestPackInfo
{
	struct FString                                     Name;                                                     // 0x0000(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0010(0x0020) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortLoginReward
// 0x0048 (0x0050 - 0x0008)
struct FFortLoginReward : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x48];                                      // 0x0008(0x0048) MISSED OFFSET
};

// ScriptStruct FortniteGame.TransmogSacrifice
// 0x0008 (0x0010 - 0x0008)
struct FTransmogSacrifice : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
};

// ScriptStruct FortniteGame.Recipe
// 0x0048 (0x0050 - 0x0008)
struct FRecipe : public FTableRowBase
{
	unsigned char                                      UnknownData00[0x48];                                      // 0x0008(0x0048) MISSED OFFSET
};

// ScriptStruct FortniteGame.EncounterEnvironmentQueryInfo
// 0x0028
struct FEncounterEnvironmentQueryInfo
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortDayPhaseCallbackHandle
// 0x0010
struct FFortDayPhaseCallbackHandle
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.ItemCategory
// 0x0398
struct FItemCategory
{
	struct FGameplayTagContainer                       TagContainer;                                             // 0x0000(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FText                                       CategoryName;                                             // 0x0020(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData00[0x360];                                     // 0x0038(0x0360) MISSED OFFSET
};

// ScriptStruct FortniteGame.OnTimeHitInfo
// 0x0030
struct FOnTimeHitInfo
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct FortniteGame.ChoiceData
// 0x0030
struct FChoiceData
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct FortniteGame.ChoiceDataEntry
// 0x0050
struct FChoiceDataEntry
{
	unsigned char                                      UnknownData00[0x50];                                      // 0x0000(0x0050) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortMultiSizeMargin
// 0x0060
struct FFortMultiSizeMargin
{
	unsigned char                                      UnknownData00[0x60];                                      // 0x0000(0x0060) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortMultiSizeFont
// 0x0270
struct FFortMultiSizeFont
{
	unsigned char                                      UnknownData00[0x270];                                     // 0x0000(0x0270) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortRequirementsInfo
// 0x0040
struct FFortRequirementsInfo
{
	unsigned char                                      UnknownData00[0x40];                                      // 0x0000(0x0040) MISSED OFFSET
};

// ScriptStruct FortniteGame.AIHotSpotUseInfo
// 0x0008 (0x0018 - 0x0010)
struct FAIHotSpotUseInfo : public FAIHotSpotSlotInfo
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0010(0x0008) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortNavLinkPattern
// 0x0008
struct FFortNavLinkPattern
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
};

// ScriptStruct FortniteGame.BuildingActorNavArea
// 0x0004
struct FBuildingActorNavArea
{
	unsigned char                                      UnknownData00[0x4];                                       // 0x0000(0x0004) MISSED OFFSET
};

// ScriptStruct FortniteGame.BuildingActorHotSpotDirection
// 0x0020
struct FBuildingActorHotSpotDirection
{
	unsigned char                                      UnknownData00[0x20];                                      // 0x0000(0x0020) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortAIAssignmentIdentifier
// 0x0030
struct FFortAIAssignmentIdentifier
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct FortniteGame.AutoAcquireSlot
// 0x0010 (0x0020 - 0x0010)
struct FAutoAcquireSlot : public FAIHotSpotSlotInfo
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0010(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortItemEntry
// 0x009C (0x00A8 - 0x000C)
struct FFortItemEntry : public FFastArraySerializerItem
{
	unsigned char                                      UnknownData00[0x9C];                                      // 0x000C(0x009C) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortItemEntryStateValue
// 0x0018
struct FFortItemEntryStateValue
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortGiftingInfo
// 0x0028
struct FFortGiftingInfo
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortGiftGiver
// 0x0008 (0x0030 - 0x0028)
struct FFortGiftGiver : public FFortGiftingInfo
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortBounceData
// 0x0030
struct FFortBounceData
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortMissionInstancedConfigData
// 0x0010
struct FFortMissionInstancedConfigData
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortMissionInstancedConfigDataBucket
// 0x0010
struct FFortMissionInstancedConfigDataBucket
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortMissionConfigDataParams
// 0x0010
struct FFortMissionConfigDataParams
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortMissionConfigDataBucket
// 0x0028
struct FFortMissionConfigDataBucket
{
	unsigned char                                      UnknownData00[0x28];                                      // 0x0000(0x0028) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortConnectivityComponentData
// 0x0018
struct FFortConnectivityComponentData
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortPlacementActorFinderEntry
// 0x00B0
struct FFortPlacementActorFinderEntry
{
	unsigned char                                      UnknownData00[0xB0];                                      // 0x0000(0x00B0) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortConnectionData
// 0x0030
struct FFortConnectionData
{
	unsigned char                                      UnknownData00[0x30];                                      // 0x0000(0x0030) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortFinderProperty
// 0x0018
struct FFortFinderProperty
{
	class UProperty*                                   Property;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0008(0x0010) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortPlacementActorFinderInfo
// 0x0018
struct FFortPlacementActorFinderInfo
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct FortniteGame.FortPlacementDistanceRequirements
// 0x0008
struct FFortPlacementDistanceRequirements
{
