#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

namespace SDK
{
// 0x120 (0xAA8 - 0x988)
// BlueprintGeneratedClass B_UtilityItem_Balloons_Athena.B_UtilityItem_Balloons_Athena_C
class AB_UtilityItem_Balloons_Athena_C : public AB_UtilityItem_Generic_Athena_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x988(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                       Baloon_FloatingLoop_SoundComp;                     // 0x990(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       Balloon_MaxAltitude_Sound;                         // 0x998(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABuildingGameplayActor*>        Balloons;                                          // 0x9A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	class UFortWorldItemDefinition*              Balloons_WID;                                      // 0x9B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Ballon_Inflate_Sound;                              // 0x9B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Ballon_StartToRise_Sound;                          // 0x9C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Ballon_ReleaseSingle_Sound;                        // 0x9C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        BalloonsNeededForFlight;                           // 0x9D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_64E8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundBase*                            Balloon_ReleaseMultiple_Sound;                     // 0x9D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Balloon_maxheightLoop;                             // 0x9E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CurrentBalloonsInUse;                              // 0x9E8(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	enum class EFortCustomMovement               FortCustomMovementMode;                            // 0x9EC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_64E9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              RotationOffset;                                    // 0x9F0(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	enum class EFortCustomMovement               Ballooning;                                        // 0x9FC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_64EA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        BalloonToSpawn;                                    // 0xA00(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              RotationOffset_0;                                  // 0xA04(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              RotationOffset_1;                                  // 0xA10(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              RotationOffset_2;                                  // 0xA1C(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              RotationOffset_3;                                  // 0xA28(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              RotationOffset_4;                                  // 0xA34(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              RotationOffset_5;                                  // 0xA40(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_64EB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                PopAtMaxHeightFunctionName;                        // 0xA50(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	float                                        PopAtMaxHeightTimer;                               // 0xA60(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_64EC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundBase*                            Balloon_Pop_Shot_Sound;                            // 0xA68(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Balloon_pop_sound;                                 // 0xA70(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        BalloonColorRandom;                                // 0xA78(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        BalloonStencilRandom;                              // 0xA7C(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                IntArray;                                          // 0xA80(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class USkeletalMeshComponent*                PlayerPawnMesh;                                    // 0xA90(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Balloon_floating_Loop;                             // 0xA98(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Balloon_floating_MaxAltitude_Loop;                 // 0xAA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("B_UtilityItem_Balloons_Athena_C");
		return Clss;
	}

	void OnRep_CurrentBalloonsInUse(bool Temp_bool_Has_Been_Initd_Variable, bool Temp_bool_IsClosed_Variable, bool Temp_bool_IsClosed_Variable1, class APawn* CallFunc_GetInstigator_ReturnValue, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_IsInVehicle_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue1, bool Temp_bool_Has_Been_Initd_Variable1, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena1, bool K2Node_DynamicCast_bSuccess1, const struct FActiveGameplayEffectHandle& CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue2, bool CallFunc_LessEqual_IntInt_ReturnValue, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena2, bool K2Node_DynamicCast_bSuccess2, bool CallFunc_IsSkydiving_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsFlying_ReturnValue, bool CallFunc_IsWalking_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue1, bool CallFunc_Not_PreBool_ReturnValue2, bool CallFunc_IsInVehicle_ReturnValue1, bool CallFunc_IsZiplining_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue3, bool CallFunc_Not_PreBool_ReturnValue4, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue1, bool CallFunc_BooleanAND_ReturnValue2, bool CallFunc_BooleanAND_ReturnValue3, class APawn* CallFunc_GetInstigator_ReturnValue3, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena3, bool K2Node_DynamicCast_bSuccess3, bool CallFunc_IsZiplining_ReturnValue1, bool CallFunc_IsInVehicle_ReturnValue2, bool CallFunc_Not_PreBool_ReturnValue5, bool CallFunc_IsFalling_ReturnValue, bool CallFunc_BooleanAND_ReturnValue4, int32 CallFunc_GetRemainingAmmo_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue1, bool CallFunc_Greater_IntInt_ReturnValue1);
	void UserConstructionScript();
	void K2_OnUnEquip();
	void SpawnBalloon();
	void ReleaseBalloon(bool ReleaseAll);
	void ReleaseAllBalloons();
	void EnteredVehicle(int32 SeatIndex);
	void RemoveItemFromPlayer();
	void MovementModeChangeFloat(class ACharacter* Character, enum class EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void BalloonShot(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ReOrderBalloons();
	void AtMaxHeight(int32 RelationToCeiling);
	void PopAtMaxHeight();
	void BalloonPopAudio();
	void BallooningMovementModeSwitch();
	void OnWeaponAttached();
	void ExecuteUbergraph_B_UtilityItem_Balloons_Athena(int32 EntryPoint, bool CallFunc_HasAuthority_ReturnValue, int32 CallFunc_Array_LastIndex_ReturnValue, class ABuildingGameplayActor* CallFunc_Array_Get_Item, class ABGA_Athena_Balloons_C* K2Node_DynamicCast_AsBGA_Athena_Balloons, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Array_IsValidIndex_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const struct FGuid& CallFunc_GetInventoryGUID_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue1, class AFortPlayerController* CallFunc_GetFortPlayerControllerFromActor_ReturnValue, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena, bool K2Node_DynamicCast_bSuccess1, int32 CallFunc_K2_RemoveItemFromPlayerByGuid_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class APawn* CallFunc_GetInstigator_ReturnValue2, class AController* CallFunc_GetController_ReturnValue, int32 K2Node_CustomEvent_SeatIndex, class AAthena_PlayerController_C* K2Node_DynamicCast_AsAthena_Player_Controller, bool K2Node_DynamicCast_bSuccess2, bool CallFunc_EqualEqual_IntInt_ReturnValue, class APawn* CallFunc_GetInstigator_ReturnValue3, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena1, bool K2Node_DynamicCast_bSuccess3, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, int32 CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue1, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate1, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue1, class ACharacter* K2Node_CustomEvent_Character, enum class EMovementMode K2Node_CustomEvent_PrevMovementMode, uint8 K2Node_CustomEvent_PreviousCustomMode, bool CallFunc_EqualEqual_IntInt_ReturnValue1, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena, bool K2Node_DynamicCast_bSuccess4, bool CallFunc_IsInVehicle_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsFalling_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate2, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_HasAuthority_ReturnValue1, class APawn* CallFunc_GetInstigator_ReturnValue4, bool CallFunc_BooleanAND_ReturnValue1, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena2, bool K2Node_DynamicCast_bSuccess5, bool K2Node_CustomEvent_ReleaseAll, const struct FTransform& CallFunc_GetSocketTransform_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate3, class AActor* K2Node_CustomEvent_DamagedActor, float K2Node_CustomEvent_Damage, class AController* K2Node_CustomEvent_InstigatedBy, class AActor* K2Node_CustomEvent_DamageCauser, const struct FVector& K2Node_CustomEvent_HitLocation, class UPrimitiveComponent* K2Node_CustomEvent_FHitComponent, class FName K2Node_CustomEvent_BoneName, const struct FVector& K2Node_CustomEvent_Momentum, class ABuildingGameplayActor* K2Node_DynamicCast_AsBuilding_Gameplay_Actor, bool K2Node_DynamicCast_bSuccess6, bool CallFunc_Array_RemoveItem_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue1, class APawn* CallFunc_GetInstigator_ReturnValue5, int32 Temp_int_Array_Index_Variable, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena3, bool K2Node_DynamicCast_bSuccess7, bool K2Node_SwitchInteger_CmpSuccess, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue1, bool CallFunc_Greater_IntInt_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, bool CallFunc_BooleanAND_ReturnValue2, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABGA_Athena_Balloons_C* CallFunc_FinishSpawningActor_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue1, bool K2Node_SwitchInteger1_CmpSuccess, int32 CallFunc_Array_Length_ReturnValue1, int32 CallFunc_Array_Length_ReturnValue2, class ABuildingGameplayActor* CallFunc_Array_Get_Item1, bool CallFunc_Greater_IntInt_ReturnValue1, class ABuildingGameplayActorBalloon* K2Node_DynamicCast_AsBuilding_Gameplay_Actor_Balloon, bool K2Node_DynamicCast_bSuccess8, int32 CallFunc_Array_Length_ReturnValue3, class APawn* CallFunc_GetInstigator_ReturnValue6, bool Temp_bool_Has_Been_Initd_Variable, class APlayerPawn_Athena_C* K2Node_DynamicCast_AsPlayer_Pawn_Athena4, bool K2Node_DynamicCast_bSuccess9, const struct FTransform& CallFunc_GetSocketTransform_ReturnValue1, const struct FVector& CallFunc_BreakTransform_Location1, const struct FRotator& CallFunc_BreakTransform_Rotation1, const struct FVector& CallFunc_BreakTransform_Scale1, const struct FTransform& CallFunc_MakeTransform_ReturnValue1, const struct FHitResult& CallFunc_K2_SetActorTransform_SweepHitResult, bool CallFunc_K2_SetActorTransform_ReturnValue, int32 K2Node_CustomEvent_RelationToCeiling, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate4, bool CallFunc_Greater_IntInt_ReturnValue2, bool CallFunc_Less_IntInt_ReturnValue1, int32 Temp_int_Loop_Counter_Variable1, bool CallFunc_Less_IntInt_ReturnValue2, int32 CallFunc_Add_IntInt_ReturnValue2, int32 CallFunc_Array_LastIndex_ReturnValue1, class ABuildingGameplayActor* CallFunc_Array_Get_Item2, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue2, class ABGA_Athena_Balloons_C* K2Node_DynamicCast_AsBGA_Athena_Balloons1, bool K2Node_DynamicCast_bSuccess10, int32 CallFunc_Subtract_IntInt_ReturnValue2, bool CallFunc_Greater_IntInt_ReturnValue3, bool Temp_bool_Has_Been_Initd_Variable1, bool Temp_bool_IsClosed_Variable, bool Temp_bool_IsClosed_Variable1, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue2, int32 CallFunc_RandomIntegerInRange_ReturnValue, int32 CallFunc_Array_Length_ReturnValue4, int32 CallFunc_Subtract_IntInt_ReturnValue3, int32 CallFunc_RandomIntegerInRange_ReturnValue1, int32 CallFunc_Array_Get_Item3, int32 CallFunc_RandomIntegerInRange_ReturnValue2, class APawn* CallFunc_GetInstigator_ReturnValue7, bool K2Node_SwitchInteger2_CmpSuccess, class AFortPawn* K2Node_DynamicCast_AsFort_Pawn, bool K2Node_DynamicCast_bSuccess11, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue3, class UAudioComponent* CallFunc_SpawnSoundAttached_ReturnValue4, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate5, class APawn* CallFunc_GetInstigator_ReturnValue8, class AFortPlayerPawnAthena* K2Node_DynamicCast_AsFort_Player_Pawn_Athena1, bool K2Node_DynamicCast_bSuccess12, int32 Temp_int_Array_Index_Variable1, class ABuildingGameplayActor* CallFunc_Array_Get_Item4, class ABGA_Athena_Balloons_C* K2Node_DynamicCast_AsBGA_Athena_Balloons2, bool K2Node_DynamicCast_bSuccess13, bool CallFunc_IsValid_ReturnValue1, class APawn* CallFunc_GetInstigator_ReturnValue9, bool CallFunc_HasAuthority_ReturnValue2, bool CallFunc_OnSameTeam_ReturnValue, bool CallFunc_HasAuthority_ReturnValue3);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
