#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

namespace SDK
{
// 0x315A (0x356A - 0x410)
// AnimBlueprintGeneratedClass GolfCartVehicleSK_AnimBP_Base.GolfCartVehicleSK_AnimBP_Base_C
class UGolfCartVehicleSK_AnimBP_Base_C : public UFortGoatVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x410(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_CA06A3B6482BC3426971B68127728451; // 0x418(0x20)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_678EF03347DD28ED9747F5943136EA7E; // 0x438(0x20)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_332AA03F4690BF841BC0ECB09DEDBEEB; // 0x458(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_698623EE48E769699D09BF95C3F8E18C; // 0x560(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_80E1F75342DA34089218E79771A02E85; // 0x668(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_52C7E5804AADC4255EBB5698BD221227; // 0x770(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_EB913EFA4F0B0B4C00EA9DA9ED3846C7; // 0x878(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1BCF052749EBA9547AAD60A21CD2B2F3; // 0x980(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_DBBCDE8C43E5F46052BD52B85598A8A5; // 0xA88(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_F9FD9138400C30A4AB437F97D82EE90D; // 0xB90(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_78B769EC4BF7376186DF32B1238389D8; // 0xC98(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_40BE39A24575924617CA198CE8FC2746; // 0xDA0(0x108)()
	uint8                                        Pad_6394[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_E796EFA44E1B6EE8168F91A29B3D83DC; // 0xEB0(0x1B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2BCB16E243EB2243DACF99AD09CCCA8D; // 0x1060(0x20)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_5723AF854AB85F1965AF2F9715942E77; // 0x1080(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_1C6C6171464716B3F93046AB8F84FC41; // 0x1230(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_62F788994894664AE6B62DB27EA41FB7; // 0x13E0(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_0271B19E4A96C0AFC6180D8D9176186E; // 0x1590(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_8653C4044CB6A26A8E7E14BCA810BD2E; // 0x1740(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_A3635AFB4B83D87D181890B03BC750F8; // 0x18F0(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_3B5B04264331D575247558B25AC51CE8; // 0x1AA0(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_8DB75CF04756FF8A8C3752AFD58A1DA7; // 0x1C50(0x1B0)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_8573CF7746DE5FC30CA516A6BC7B79DD; // 0x1E00(0x108)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3557A3EC4F9A9EA8C26893AB77BF60F6; // 0x1F08(0x108)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B4B1B6FF493BAA4F845B0F96E8173A7F; // 0x2010(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CCD8DAC64AEFE58B6E29CAAEA5ED6B4A; // 0x2038(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4119A0B741FE9EA4E606A38DB73A088A; // 0x2060(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_34B756F047F2FBC680ABB7B331F6041E; // 0x2088(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_153CA4E44CADCD672F4AC6B3AA716739; // 0x20B0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A2487F0C48A48D3B7072089FA7BF445C; // 0x20D8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_04D9F26249C85E8A11BCEC927EDC6B46; // 0x2100(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B1CE421A4C1E86AAB848E2981BD83F5D; // 0x2128(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CDD959424E4048694E9207A39D177157; // 0x2150(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_01FA9B384BD713BE6EE5CF951FAFC7F0; // 0x2178(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_29F57AE8419500844A41E3BEE2A83666; // 0x21A0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_135BADDD4609395EACFF3AAB2233244A; // 0x21C8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AE0DBCCC467CBC909487E08F0EA77AD5; // 0x21F0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9A41F8684C357D77ADF7878179BB23C6; // 0x2218(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4071F02C4F26F700F68C6DA5860A82FF; // 0x2240(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0B2F80FD4482B7C64328CDAB6D082C28; // 0x2268(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_07446ADB48507A0F571530AB05BAF824; // 0x2290(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BB617A6F4B15420F1116F3AB94BED485; // 0x22B8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F80E842F40A0289D6C899FA801B184FD; // 0x22E0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AA9765F74D0FAEBF4B939C87EF3DED19; // 0x2308(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E977B8CA4ED282DBFB4F45B7BC024B5A; // 0x2330(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4B5CF9A149F5B1AB1159D28707D45708; // 0x2358(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FC8EC2B94A9D32EA9AA5F995FC8BF265; // 0x2380(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1F476BCD42B9C826346332B92714C9D6; // 0x23A8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_D26E74F646B55AA3E0D1C096A7B31FFD; // 0x2420(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4E92D0844FEB18CE57E191842761ADF9; // 0x2440(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_D3DC7BC74DBCDC77E7EB809DD3E4B4AC; // 0x24B8(0x20)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_108FFBEE42661F626F1140BF0E90181D; // 0x24D8(0xB8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_ADAD86DF42613C1FCCD9068975F283DC; // 0x2590(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_761F24C34920FF354AD0F8B561E005CD; // 0x2608(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_42CC7AAF406F21BA00CA5FACB699515E; // 0x2680(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BBDBF8E94AC9C07672A81BAF6A7E9F61; // 0x26A0(0x78)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_E45C905D4ED2FEA7ACDDBDB2BB542905; // 0x2718(0xB8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E3B285A949BA1FF9C97037B7F253C724; // 0x27D0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7BF85C544DDDE9FE2617849539320D52; // 0x2848(0x20)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_9BD4216242ABF09FA3495895C593B14B; // 0x2868(0xB8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7F6A2EEF4BF57EAB73C7F08C1763EB8E; // 0x2920(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_32EEB87B4D3608AF262341BB24643927; // 0x2998(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_EE659F9C41043A8F6D469BB6B18535F9; // 0x2A10(0x20)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_2181E0DB4B250BBC6478B68140D6DBE6; // 0x2A30(0xB8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_35B1FE7E4F0C630B347986AC8706A9F0; // 0x2AE8(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_ECDFE7A640530765C50A6EB321AAC73E; // 0x2B60(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6938D8FF47572344A7F461B2169A0B89; // 0x2BD8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EB672D59457848B73F0901ACA3F03E90; // 0x2BF8(0x78)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_DDE9DC874F6D375E7E6E1FB0EBE7BF3C; // 0x2C70(0xB8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_ED43F546483B7B7858AD5C8C1553EC06; // 0x2D28(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14B0244C483C4008DB1591BACA69DB6C; // 0x2DA0(0x20)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_395AC7314BB3EDE5F7E6EC9416BA1B1D; // 0x2DC0(0xB8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_412659B94DDE8296D0B648AEFE447383; // 0x2E78(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C684F9AE4DBD4EEB48E8FA80BB0202AB; // 0x2EF0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7259313E4D099614EC9AEBBC1C8F662C; // 0x2F68(0x20)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_880C7B4D44F995D0E1A7F29E8B812397; // 0x2F88(0xB8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5997C05048A2B9F088C0BFA57585F1D3; // 0x3040(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9ADF1ED64573C186D0BFC7B998905E2C; // 0x30B8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5E6EB6FE414461405523B5BE28F0AB7C; // 0x3130(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B9DA4CF2429D5C177FF454A499F8CB84; // 0x3150(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_B301953E4252E479CA9F738FD6A84B82; // 0x31C8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CA03FC904037B8CD0346F2B0DBABB29C; // 0x31E8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_FEBDA49C45505ECD4215148174CC132C; // 0x3260(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0BC9617A4620963082BE33B7739462DD; // 0x3280(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8F47B2B24F83C691D631F1A1DCC70504; // 0x32F8(0x20)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_420272934EC32FB5F8507EBD0E97B93A; // 0x3318(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2B1E3A3541FE01605E7E7C8B5F7DD166; // 0x3390(0x20)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_EF514F644DC4D188F0C4A6B661A6BD09; // 0x33B0(0xB0)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_B166E5A54174301FD820F7A7238B8BBC; // 0x3460(0x48)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_EF726F964FAB23E7F67FFDAD6A6B141C; // 0x34A8(0xB8)()
	bool                                         PlayerHitSpaceBar;                                 // 0x3560(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6395[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GolfCartSpeed_0;                                   // 0x3564(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsBraking;                                         // 0x3568(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsBoosting;                                        // 0x3569(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("GolfCartVehicleSK_AnimBP_Base_C");
		return Clss;
	}

	void EvaluateGraphExposedInputs_ExecuteUbergraph_GolfCartVehicleSK_AnimBP_Base_AnimGraphNode_TransitionResult_4B5CF9A149F5B1AB1159D28707D45708();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_GolfCartVehicleSK_AnimBP_Base(int32 EntryPoint, bool CallFunc_Greater_FloatFloat_ReturnValue, float K2Node_Event_DeltaTimeX, class AActor* CallFunc_GetOwningActor_ReturnValue, class AGolfCartVehicleSK_C* K2Node_DynamicCast_AsGolf_Cart_Vehicle_SK, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsEBraking_ReturnValue, float CallFunc_GetBrakingDelta_ReturnValue, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue, bool CallFunc_IsBoosting_ReturnValue, float CallFunc_GetForwardSpeedKmh_ReturnValue);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
