#pragma once

// Fortnite (14.30) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C
// 0x1889 (0x1C09 - 0x0380)
class UFloppingRabbitLayerAnimBP_C : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0380(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData                  AnimBlueprintClassSubsystem_PropertyAccess;               // 0x0388(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0389(0x0007) MISSED OFFSET
	struct FAnimNode_Root                              AnimGraphNode_Root_35;                                    // 0x0390(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_19;                         // 0x03C0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_34;                                    // 0x0448(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_18;                         // 0x0478(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_33;                                    // 0x0500(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_17;                         // 0x0530(0x0088)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_16;                         // 0x05B8(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_32;                                    // 0x0640(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_15;                         // 0x0670(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_31;                                    // 0x06F8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10;                          // 0x0728(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5;                          // 0x07A0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9;                           // 0x0840(0x0078)
	struct FAnimNode_Root                              AnimGraphNode_Root_30;                                    // 0x08B8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8;                           // 0x08E8(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4;                          // 0x0960(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7;                           // 0x0A00(0x0078)
	struct FAnimNode_Root                              AnimGraphNode_Root_29;                                    // 0x0A78(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6;                           // 0x0AA8(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3;                          // 0x0B20(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5;                           // 0x0BC0(0x0078)
	struct FAnimNode_Root                              AnimGraphNode_Root_28;                                    // 0x0C38(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4;                           // 0x0C68(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2;                          // 0x0CE0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3;                           // 0x0D80(0x0078)
	struct FAnimNode_Root                              AnimGraphNode_Root_27;                                    // 0x0DF8(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_14;                         // 0x0E28(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_26;                                    // 0x0EB0(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_13;                         // 0x0EE0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_25;                                    // 0x0F68(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_12;                         // 0x0F98(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_24;                                    // 0x1020(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_23;                                    // 0x1050(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_22;                                    // 0x1080(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_21;                                    // 0x10B0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_20;                                    // 0x10E0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_19;                                    // 0x1110(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_18;                                    // 0x1140(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_17;                                    // 0x1170(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_16;                                    // 0x11A0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_15;                                    // 0x11D0(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_14;                                    // 0x1200(0x0030)
	struct FAnimNode_Root                              AnimGraphNode_Root_13;                                    // 0x1230(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_11;                         // 0x1260(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_12;                                    // 0x12E8(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_10;                         // 0x1318(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_11;                                    // 0x13A0(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_9;                          // 0x13D0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_10;                                    // 0x1458(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_8;                          // 0x1488(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_9;                                     // 0x1510(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_7;                          // 0x1540(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_8;                                     // 0x15C8(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_6;                          // 0x15F8(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_7;                                     // 0x1680(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_5;                          // 0x16B0(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_6;                                     // 0x1738(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_4;                          // 0x1768(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_5;                                     // 0x17F0(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_3;                          // 0x1820(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_4;                                     // 0x18A8(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_2;                          // 0x18D8(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_3;                                     // 0x1960(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose;                            // 0x1990(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_2;                                     // 0x1A18(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2;                           // 0x1A48(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool;                            // 0x1AC0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                             // 0x1B60(0x0078)
	struct FAnimNode_Root                              AnimGraphNode_Root;                                       // 0x1BD8(0x0030)
	bool                                               OneHandGrip;                                              // 0x1C08(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("AnimBlueprintGeneratedClass FloppingRabbitLayerAnimBP.FloppingRabbitLayerAnimBP_C");
		
		return ptr;
	}


	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive);
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart);
	void AnimGraph(struct FPoseLink* AnimGraph);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_FloppingRabbitLayerAnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
