#pragma once

// Fortnite (14.30) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class FortniteUI.AthenaSpatialScreen
// 0x0098 (0x03A0 - 0x0308)
class UAthenaSpatialScreen : public UCommonActivatableWidget
{
public:
	bool                                               bEnableSpatialInputPreprocessing;                         // 0x0308(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bEnableAnalytics;                                         // 0x0309(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x030A(0x0002) MISSED OFFSET
	struct FGameplayTag                                OverrideScreenTag;                                        // 0x030C(0x0008) (Transient)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0314(0x0004) MISSED OFFSET
	class UCommonButton*                               Button_Back;                                              // 0x0318(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FGameplayTag                                ScreenTag;                                                // 0x0320(0x0008) (Edit)
	class UCommonButton*                               Button_CloseMobile;                                       // 0x0328(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bNeedsBottomBar;                                          // 0x0330(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6F];                                      // 0x0331(0x006F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaSpatialScreen");
		
		return ptr;
	}


	void OnInputSuspensionChanged();
	void FireSpatialScreenAnalytic(const struct FString& Interaction);
	void AddSpatialScreenSessionCounter(const struct FString& Entry, int Count);
};


// Class FortniteUI.FortHUDElementWidget
// 0x0040 (0x02C8 - 0x0288)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0288(0x0008) MISSED OFFSET
	struct FGameplayTag                                ElementTag;                                               // 0x0290(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FGameplayTagContainer                       HUDElementTag;                                            // 0x0298(0x0020) (Edit, BlueprintVisible)
	ESlateVisibility                                   HiddenVisibility;                                         // 0x02B8(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x02B9(0x0007) MISSED OFFSET
	class UTutorialHighlight*                          TutorialHighlight;                                        // 0x02C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.FortHUDElementWidget");
		
		return ptr;
	}


	void OnVisibilitySetEvent(ESlateVisibility InVisibility);
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
};


// Class FortniteUI.FortMobileHUDElement
// 0x0028 (0x02F0 - 0x02C8)
class UFortMobileHUDElement : public UFortHUDElementWidget
{
public:
	struct FGameplayTag                                SizePropertyTag;                                          // 0x02C8(0x0008) (Edit)
	unsigned char                                      UnknownData00[0x10];                                      // 0x02D0(0x0010) MISSED OFFSET
	int                                                ForcedZOrder;                                             // 0x02E0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x02E4(0x0004) MISSED OFFSET
	class UScaleBox*                                   ScaleBox_HUDWidgetScale;                                  // 0x02E8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.FortMobileHUDElement");
		
		return ptr;
	}

};


// Class FortniteUI.BacchusHUDElement
// 0x01D0 (0x04C0 - 0x02F0)
class UBacchusHUDElement : public UFortMobileHUDElement
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02F0(0x0008) MISSED OFFSET
	bool                                               bIsInLayoutMode;                                          // 0x02F8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x02F9(0x0003) MISSED OFFSET
	struct FGameplayTag                                VisualType;                                               // 0x02FC(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0304(0x0004) MISSED OFFSET
	struct FText                                       WidgetName;                                               // 0x0308(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               bHideWhenNotUsingTouch;                                   // 0x0320(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUpdatesWithHUDState;                                     // 0x0321(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bAlwaysShow;                                              // 0x0322(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnInBuildMode;                                            // 0x0323(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnInCombatMode;                                           // 0x0324(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnInEditMode;                                             // 0x0325(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnInCreativeMode;                                         // 0x0326(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnInBattleLabMode;                                        // 0x0327(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               IsFreeFalling;                                            // 0x0328(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               IsGliding;                                                // 0x0329(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               CanOpenChute;                                             // 0x032A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               InLockedBus;                                              // 0x032B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               InUnlockedBus;                                            // 0x032C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnTargeting;                                              // 0x032D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnUsingScopeTargeting;                                    // 0x032E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnCanTarget;                                              // 0x032F(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnCanUseScopeTargeting;                                   // 0x0330(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnCrouching;                                              // 0x0331(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnCanUseSecondaryAbility;                                 // 0x0332(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnDBNO;                                                   // 0x0333(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnCarryingDBNO;                                           // 0x0334(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnCarryingHeldObject;                                     // 0x0335(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnControllingRCPawn;                                      // 0x0336(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnInVehicle;                                              // 0x0337(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnDrivingVehicle;                                         // 0x0338(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EBacchusHUDStateType                               OnZiplining;                                              // 0x0339(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x6];                                       // 0x033A(0x0006) MISSED OFFSET
	struct FHUDLayoutDataEntry                         DefaultEntry;                                             // 0x0340(0x0180) (Transient)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.BacchusHUDElement");
		
		return ptr;
	}


	void ShowHighlight(bool Show);
	void OnHUDStateUpdate(const struct FFortHUDState& NewState);
	void HandleInputMethodChanged(ECommonInputType CurrentInputType);
	struct FGameplayTag BP_GetMobileVisualType();
};


// Class FortniteUI.BacchusButton
// 0x00B0 (0x0570 - 0x04C0)
class UBacchusButton : public UBacchusHUDElement
{
public:
	class UPaperSprite*                                DefaultIcon;                                              // 0x04C0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                PressedColor;                                             // 0x04C8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                UnpressedColor;                                           // 0x04D8(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EButtonClickMethod>                    ClickMethod;                                              // 0x04E8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EButtonTouchMethod>                    TouchMethod;                                              // 0x04E9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x04EA(0x0002) MISSED OFFSET
	float                                              ButtonSize;                                               // 0x04EC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              ButtonDisplayScale;                                       // 0x04F0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x04F4(0x0004) MISSED OFFSET
	struct FText                                       ButtonSizeName;                                           // 0x04F8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FText                                       ButtonDisplayScaleName;                                   // 0x0510(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                               ShowRadialProgress;                                       // 0x0528(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0529(0x0003) MISSED OFFSET
	struct FGameplayTag                                ListenedGamePlayTag;                                      // 0x052C(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0534(0x0004) MISSED OFFSET
	class UImage*                                      Image_Background;                                         // 0x0538(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0540(0x0008) MISSED OFFSET
	class USizeBox*                                    SizeBox_ButtonSize;                                       // 0x0548(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class USizeBox*                                    SizeBox_ImageSize;                                        // 0x0550(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      Image_Icon;                                               // 0x0558(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class URadialBacchusButtonBase*                    RadialButton_ButtonCooldown;                              // 0x0560(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UButton*                                     Button_InternalButton;                                    // 0x0568(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.BacchusButton");
		
		return ptr;
	}


	void SetIconPressed(bool bIsPressed);
	void SetDefaultIcon(class UPaperSprite* Icon);
	void SetButtonSprite(class UPaperSprite* NewSprite);
	void SetButtonSize(float NewButtonSize);
	void SetButtonDisplayScale(float NewDisplayScale);
	void OnClicked();
	void HandleCursorModeChanged(bool bCursorModeEnabled, const struct FName& ActionName, class UUserWidget* CustomWidget);
};


// Class FortniteUI.BacchusActionButton
// 0x0048 (0x05B8 - 0x0570)
class UBacchusActionButton : public UBacchusButton
{
public:
	TArray<struct FBacchusActionIconMapping>           ActionMapping;                                            // 0x0570(0x0010) (Edit, ZeroConstructor)
	struct FName                                       TempActionMapping;                                        // 0x0580(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FGameplayTag>                        ItemsAllowingClickThrough;                                // 0x0588(0x0010) (Edit, ZeroConstructor)
	bool                                               bCapturesInput;                                           // 0x0598(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1F];                                      // 0x0599(0x001F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.BacchusActionButton");
		
		return ptr;
	}


	void OnCursorModeChanged(bool bCursorModeEnabled, const struct FName& ActionName, class UUserWidget* CustomWidget);
	void AddActionMappings(TArray<struct FBacchusActionIconMapping> NewActionMappings);
};


// Class FortniteUI.HUDWidgetBehavior
// 0x0010 (0x0038 - 0x0028)
class UHUDWidgetBehavior : public UObject
{
public:
	TArray<class UFortMobileHudWidgetContentComponent*> HudWidgetContentComponents;                               // 0x0028(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.HUDWidgetBehavior");
		
		return ptr;
	}

};


// Class FortniteUI.FortMobileActionButtonBehavior
// 0x0078 (0x00B0 - 0x0038)
class UFortMobileActionButtonBehavior : public UHUDWidgetBehavior
{
public:
	TArray<struct FName>                               ActionNames;                                              // 0x0038(0x0010) (Edit, ZeroConstructor)
	class UPaperSprite*                                Sprite;                                                   // 0x0048(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bClickthrough;                                            // 0x0050(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0051(0x0003) MISSED OFFSET
	struct FGameplayTag                                HUDLayoutToolSaveTag_Legacy;                              // 0x0054(0x0008) (Edit)
	unsigned char                                      UnknownData01[0x4];                                       // 0x005C(0x0004) MISSED OFFSET
	struct FText                                       HUDLayoutToolName;                                        // 0x0060(0x0018) (Edit)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0078(0x0010) MISSED OFFSET
	TArray<class UFortMobileButtonBehaviorComponent*>  ButtonBehaviorComponents;                                 // 0x0088(0x0010) (Edit, ExportObject, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData03[0x10];                                      // 0x0098(0x0010) MISSED OFFSET
	int                                                ForcedZOrder;                                             // 0x00A8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x00AC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.FortMobileActionButtonBehavior");
		
		return ptr;
	}

};


// Class FortniteUI.LTMWidgetBase
// 0x0050 (0x0318 - 0x02C8)
class ULTMWidgetBase : public UFortHUDElementWidget
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x02C8(0x0040) MISSED OFFSET
	class AFortGameplayMutator*                        MutatorClassToWaitFor;                                    // 0x0308(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0310(0x0001) MISSED OFFSET
	struct FFortPrioritizedWidgetData                  PrioritizationData;                                       // 0x0311(0x0002) (Edit)
	unsigned char                                      UnknownData02[0x5];                                       // 0x0313(0x0005) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.LTMWidgetBase");
		
		return ptr;
	}


	void OnStompFailed();
	void OnStompedByOtherWidget();
	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	void OnGamePhaseChanged(EAthenaGamePhase NewPhase);
	void K2_OnBecomeInactive();
	void K2_OnBecomeActive();
	bool K2_HasActiveContent();
	unsigned char GetViewingTeam();
	class AFortPlayerStateAthena* GetViewingPlayerState();
};


// Class FortniteUI.FortAthenaVehicleDashboardWidget
// 0x0068 (0x0330 - 0x02C8)
class UFortAthenaVehicleDashboardWidget : public UFortHUDElementWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02C8(0x0008) MISSED OFFSET
	bool                                               bIsWidgetShowing;                                         // 0x02D0(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x02D1(0x0007) MISSED OFFSET
	class AFortAthenaVehicle*                          CurrentVehicleActor;                                      // 0x02D8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              CurrentSpeed;                                             // 0x02E0(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              TargetFuelPercent;                                        // 0x02E4(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              DisplayedFuelPercent;                                     // 0x02E8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              FillBlendSpeed;                                           // 0x02EC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpeedTextMaxInterpolationRate;                            // 0x02F0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x02F4(0x0004) MISSED OFFSET
	struct FGameplayTagContainer                       WidgetTagsToHideWhenVisible;                              // 0x02F8(0x0020) (Edit)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0318(0x0008) MISSED OFFSET
	class UCommonNumericTextBlock*                     NumericText_Speed;                                        // 0x0320(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              HUDTopSpeed;                                              // 0x0328(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x032C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.FortAthenaVehicleDashboardWidget");
		
		return ptr;
	}


	void UpdateSpeedometer(float NormalizedSpeed);
	void ShowNoFuelMessage();
	void SetVehicleHasInfiniteFuel(bool bInfiniteFuel);
	void SetupVehicleFuelWidget(class AActor* NewVehicle, bool bRequestShowWidget);
	void OnOutOfFuel();
	void OnLowFuel();
	void OnFuelValueChanged(float FuelPercentage, bool bIsLowOnFuel);
	void OnBoostStarted();
	void OnBoostFinished();
	void OnAddedFuel(float NewFuelPercent);
	class AFortAthenaVehicle* GetVehicle();
	float GetHUDTopSpeed();
};


// Class FortniteUI.AthenaAboutModal
// 0x0098 (0x03A0 - 0x0308)
class UAthenaAboutModal : public UCommonActivatableWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0308(0x0010) UNKNOWN PROPERTY: MulticastInlineDelegateProperty FortniteUI.AthenaAboutModal.BP_OnAboutModalClosed
	struct FText                                       Title;                                                    // 0x0318(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate)
	TArray<struct FText>                               Entries;                                                  // 0x0330(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	unsigned char                                      UnknownData01[0x28];                                      // 0x0340(0x0028) UNKNOWN PROPERTY: SoftObjectProperty FortniteUI.AthenaAboutModal.HeroImage
	class UScrollBox*                                  ScrollBox_Content;                                        // 0x0368(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFortLazyImage*                              Image_Item;                                               // 0x0370(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonButton*                               Button_Accept;                                            // 0x0378(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonButton*                               Button_CloseMobile;                                       // 0x0380(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x18];                                      // 0x0388(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaAboutModal");
		
		return ptr;
	}


	void OnSetContent(const struct FText& InTitle, TArray<struct FText> InEntries);
	void OnAboutModalClosedDynamic__DelegateSignature();
};


// Class FortniteUI.AlternativeCarryPickupButton
// 0x0008 (0x05C0 - 0x05B8)
class UAlternativeCarryPickupButton : public UBacchusActionButton
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x05B8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AlternativeCarryPickupButton");
		
		return ptr;
	}

};


// Class FortniteUI.AthenaLoadingScreenPreviewPanelBase
// 0x0020 (0x0468 - 0x0448)
class UAthenaLoadingScreenPreviewPanelBase : public UAthenaLoadingScreenPreviewPanel
{
public:
	class UNativeWidgetHost*                           LoadingScreenSlot;                                        // 0x0448(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0450(0x0008) MISSED OFFSET
	class UCommonButton*                               Button_Close;                                             // 0x0458(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonButton*                               Button_CloseMobile;                                       // 0x0460(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaLoadingScreenPreviewPanelBase");
		
		return ptr;
	}

};


// Class FortniteUI.ApolloIntroLoadingPanel
// 0x0008 (0x0470 - 0x0468)
class UApolloIntroLoadingPanel : public UAthenaLoadingScreenPreviewPanelBase
{
public:
	class UFortPlaylistAthena*                         ApolloIntroPlaylist;                                      // 0x0468(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.ApolloIntroLoadingPanel");
		
		return ptr;
	}

};


// Class FortniteUI.ApolloIntroShimBase
// 0x0000 (0x0260 - 0x0260)
class UApolloIntroShimBase : public UUserWidget
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.ApolloIntroShimBase");
		
		return ptr;
	}


	void HandleGamePhaseChanged(EAthenaGamePhase GamePhase);
};


// Class FortniteUI.AshtonWidgetBase
// 0x0018 (0x0330 - 0x0318)
class UAshtonWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Ashton*                   AshtonMutatorRef;                                         // 0x0318(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0320(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AshtonWidgetBase");
		
		return ptr;
	}


	void UpdateAllUI(bool bFirstUpdate);
	void OnVillainRespawnsRemainingChanged();
	void OnVillainRespawnCountChanged(int NumRespawnsLeft, float RespawnPercentLeft);
	void OnStoneListChanged();
	void OnStoneChanged(EAshtonStoneType StoneType, EAshtonStoneStateType StoneState);
	void OnOpenWidget();
	void OnCloseWidget();
};


// Class FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys
// 0x0020 (0x0050 - 0x0030)
class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys : public UBlueprintAsyncActionBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) UNKNOWN PROPERTY: MulticastInlineDelegateProperty FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.Finished
	class UFortPlayerSurveyDispatcher*                 Dispatcher;                                               // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0048(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys");
		
		return ptr;
	}


	void OnAllSurveysFinishedDelegate__DelegateSignature();
	void HandleAllSurveysFinished(class UObject* Source);
	class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* STATIC_DisplaySurveys(class UFortPlayerSurveyDispatcher* Dispatcher, int SurveyCount);
};


// Class FortniteUI.AthenaAccoladeWrapper
// 0x0020 (0x0048 - 0x0028)
class UAthenaAccoladeWrapper : public UObject
{
public:
	struct FAthenaAccolades                            AccoladeData;                                             // 0x0028(0x0020)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaAccoladeWrapper");
		
		return ptr;
	}

};


// Class FortniteUI.AthenaAccoladeListEntryWidget
// 0x0008 (0x0290 - 0x0288)
class UAthenaAccoladeListEntryWidget : public UCommonUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0288(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaAccoladeListEntryWidget");
		
		return ptr;
	}


	void SetTitle(const struct FText& TitleText);
	void SetSource(const struct FText& SourceText);
	void SetIcon(class UFortAccoladeItemDefinition* ItemDef);
	void SetCount(int Count);
};


// Class FortniteUI.AthenaAccoladeListWidget
// 0x0000 (0x0368 - 0x0368)
class UAthenaAccoladeListWidget : public UCommonListView
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaAccoladeListWidget");
		
		return ptr;
	}


	void PopulateWidget();
};


// Class FortniteUI.AthenaAccoladesWidget
// 0x0080 (0x0348 - 0x02C8)
class UAthenaAccoladesWidget : public UFortHUDElementWidget
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x02C8(0x0040) MISSED OFFSET
	TArray<struct FXPUIEvent>                          XPEvents;                                                 // 0x0308(0x0010) (ZeroConstructor)
	struct FXPUIEvent                                  CurrentEvent;                                             // 0x0318(0x0028)
	struct FFortPrioritizedWidgetData                  PrioritizationData;                                       // 0x0340(0x0002) (Edit)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0342(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaAccoladesWidget");
		
		return ptr;
	}


	void OpenWidget(class UFortAccoladeItemDefinition* AccoladeDef, int XpValue, const struct FText& DisplayName);
	void OnXPEvent(const struct FXPUIEvent& XPEvent);
	void OnStompedByOtherWidget();
	bool HasMoreXPEvents();
	void ForwardEvent();
	void EventAdded();
	void CloseWidget();
};


// Class FortniteUI.AthenaAccountContext
// 0x0000 (0x0030 - 0x0030)
class UAthenaAccountContext : public UBlueprintContextBase
{
public:

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaAccountContext");
		
		return ptr;
	}


	void SimulateBattleBookPurchase(int NumLevelsToPurchase, int* BonusLevelsGranted, bool* bOverLimit);
	bool ShouldReplaceBattleStarsWithAlternateReward();
	bool IsAtMaxBattlePassTier();
	struct FText GetCurrentSeasonNumberAsText(bool bFullText);
	int GetCurrentSeasonNumber();
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	struct FText GetCurrentChapterNumberAsText(bool bFullText);
	struct FText GetCurrentChapterAndSeasonText();
	void GetBattleBookPurchaseLimit(int* MaxNumLevelsPossibleToPurchase, int* BonusLevelsGranted);
};


// Class FortniteUI.AthenaChatModalWrapper
// 0x0008 (0x0310 - 0x0308)
class UAthenaChatModalWrapper : public UCommonActivatableWidget
{
public:
	class UFortChatContainer*                          ChatContainer_Chat;                                       // 0x0308(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaChatModalWrapper");
		
		return ptr;
	}

};


// Class FortniteUI.AthenaActivatableChatWidget
// 0x0020 (0x0328 - 0x0308)
class UAthenaActivatableChatWidget : public UCommonActivatableWidget
{
public:
	class UAthenaChatModalWrapper*                     Activatable_ModalBindings;                                // 0x0308(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonButton*                               Button_HoldToOpen;                                        // 0x0310(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDataTable*                                  InputActionDataTable;                                     // 0x0318(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0320(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaActivatableChatWidget");
		
		return ptr;
	}


	void FocusChat(bool bFocus);
	void BacchusFrontendFocusChat();
};


// Class FortniteUI.AthenaAerialFeedback
// 0x0050 (0x0318 - 0x02C8)
class UAthenaAerialFeedback : public UFortHUDElementWidget
{
public:
	struct FGameplayTagContainer                       GliderRedeployTags;                                       // 0x02C8(0x0020) (Edit, DisableEditOnInstance)
	struct FGameplayTag                                AirbagDeployTag;                                          // 0x02E8(0x0008) (Edit, DisableEditOnInstance)
	class UFortItemDefinition*                         AirbagItemDefinition;                                     // 0x02F0(0x0008) (Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData)
	class UFortKeybindWidget*                          KeyBind;                                                  // 0x02F8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonTextBlock*                            Text_Feedback;                                            // 0x0300(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0308(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaAerialFeedback");
		
		return ptr;
	}


	void HandleSkydiveLeaderChanged(bool bEnabled, bool bLocal, class AFortPlayerState* LeaderPlayerState);
	void HandleKeybindsChanged();
	void HandleBalloonMovementChanged(bool bUsingBalloonMovement);
	void BP_HandleTextChanged();
};


// Class FortniteUI.AthenaAIKillsBase
// 0x0018 (0x02E0 - 0x02C8)
class UAthenaAIKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                                  KillsText;                                                // 0x02C8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UObject*                                     KillsSource;                                              // 0x02D0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bCustomKillSource;                                        // 0x02D8(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x02D9(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaAIKillsBase");
		
		return ptr;
	}


	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};


// Class FortniteUI.AthenaAwardAlertBase
// 0x0008 (0x0268 - 0x0260)
class UAthenaAwardAlertBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                      PlayerVM;                                                 // 0x0260(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaAwardAlertBase");
		
		return ptr;
	}


	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
};


// Class FortniteUI.AthenaBattleMapClickHandler
// 0x0008 (0x0268 - 0x0260)
class UAthenaBattleMapClickHandler : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0260(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaBattleMapClickHandler");
		
		return ptr;
	}


	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
};


// Class FortniteUI.AthenaBattleMapNodeTooltip
// 0x0040 (0x02C8 - 0x0288)
class UAthenaBattleMapNodeTooltip : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                            TextBlock_NodeTitle;                                      // 0x0288(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonTextBlock*                            TextBlock_NodeDescription;                                // 0x0290(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonTextBlock*                            TextBlock_NodeTime;                                       // 0x0298(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidget*                                     Widget_Selection;                                         // 0x02A0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidget*                                     Widget_Scrubbing;                                         // 0x02A8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidget*                                     Widget_ScrubbingGamepad;                                  // 0x02B0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x02B8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaBattleMapNodeTooltip");
		
		return ptr;
	}


	void OnReplayLevelStreamingChanged(bool bStreaming);
	void HandleUnhoveredNode(class ABattleMapNode* Node, EBattleMapHoveredReason Reason);
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
	void HandleTimelineModeChanged(bool bEnabled);
	void HandleInputMethodChanged(ECommonInputType NewInputType);
	void HandleHoveredNode(class ABattleMapNode* Node, EBattleMapHoveredReason Reason);
	void HandleCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, ESpectatorCameraType NewCameraType);
};


// Class FortniteUI.FortActivatablePanel
// 0x0038 (0x0478 - 0x0440)
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0440(0x0008) MISSED OFFSET
	bool                                               bIsPushedOnToContentPanelStack;                           // 0x0448(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsAlreadyOnContentPanelStack;                            // 0x0449(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EInputPriority                                     InputPriority;                                            // 0x044A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsClosableByPlayerInput;                                 // 0x044B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FPrimaryContentSetup                        PrimaryContentSetup;                                      // 0x044C(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x2B];                                      // 0x044D(0x002B) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.FortActivatablePanel");
		
		return ptr;
	}


	void RestoreScrollWidget(class UWidget* FallbackWidget);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void AsyncPlaySound2D(class UObject* WorldContextObject, float VolumeMultiplier, float PitchMultiplier, float StartTime);
};


// Class FortniteUI.AthenaBattleMapTimelineWidget
// 0x00C0 (0x0538 - 0x0478)
class UAthenaBattleMapTimelineWidget : public UFortActivatablePanel
{
public:
	class UCommonButton*                               Button_Forward;                                           // 0x0478(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonButton*                               Button_Backward;                                          // 0x0480(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              ForwardButtonPositionAlpha;                               // 0x0488(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BackwardButtonPositionAlpha;                              // 0x048C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FDataTableRowHandle                         ForwardDataTableRow;                                      // 0x0490(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         BackwardDataTableRow;                                     // 0x04A0(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         StopDataTableRow;                                         // 0x04B0(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ScrubToDataTableRow;                                      // 0x04C0(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ExitBattleMapDataTableRow;                                // 0x04D0(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ZoomInDataTableRow;                                       // 0x04E0(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ZoomOutDataTableRow;                                      // 0x04F0(0x0010) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData00[0x38];                                      // 0x0500(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaBattleMapTimelineWidget");
		
		return ptr;
	}


	void OnReplayLevelStreamingChanged(bool bStreaming);
	void HandleZoomOutPressed(bool* bPassThrough);
	void HandleZoomOutHeld(float HeldPercent);
	void HandleZoomInPressed(bool* bPassThrough);
	void HandleZoomInHeld(float HeldPercent);
	void HandleToggledBattleMapLive(class ABattleMapPawnLive* BattleMapPawn);
	void HandleTimelineStopPressed(bool* bPassThrough);
	void HandleTimelineScrubToPressed(bool* bPassThrough);
	void HandleTimelineModeChanged(bool bEnabled);
	void HandleTimelineForwardPressed(bool* bPassThrough);
	void HandleTimelineBackwardPressed(bool* bPassThrough);
	void HandleSelectedNode(class ABattleMapNode* InSelectedNode);
	void HandleExitBattleMapPressed(bool* bPassThrough);
	void HandleCameraTypeChanged(class AFortPlayerControllerSpectating* SpectatorPC, ESpectatorCameraType NewCameraType);
};


// Class FortniteUI.AthenaBattlePassItemTracker
// 0x0010 (0x0298 - 0x0288)
class UAthenaBattlePassItemTracker : public UCommonUserWidget
{
public:
	class UCommonTextBlock*                            Text_Category;                                            // 0x0288(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonNumericTextBlock*                     Text_Counter;                                             // 0x0290(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaBattlePassItemTracker");
		
		return ptr;
	}


	void OnInterpStarted();
	void OnInterpEnded(class UCommonNumericTextBlock* NumericTextBlock, bool HadCompleted);
};


// Class FortniteUI.AthenaBattlePassTracker
// 0x0120 (0x03A8 - 0x0288)
class UAthenaBattlePassTracker : public UCommonUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0288(0x0008) MISSED OFFSET
	unsigned char                                      UnknownData01[0x28];                                      // 0x0288(0x0028) UNKNOWN PROPERTY: SoftClassProperty FortniteUI.AthenaBattlePassTracker.BattlePassPurchaseScreenClass
	struct FText                                       OutfitsText;                                              // 0x02B8(0x0018) (Edit)
	struct FText                                       VBucksText;                                               // 0x02D0(0x0018) (Edit)
	struct FText                                       EmotesText;                                               // 0x02E8(0x0018) (Edit)
	struct FText                                       MoreRewardsText;                                          // 0x0300(0x0018) (Edit)
	struct FText                                       BuyBattlePassTextFormat;                                  // 0x0318(0x0018) (Edit)
	unsigned char                                      UnknownData02[0x40];                                      // 0x0330(0x0040) MISSED OFFSET
	class UBattlePassPurchaseScreen*                   PushedPurchaseScreen;                                     // 0x0370(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UCommonRichTextBlock*                        RichText_PaidItemsCollected;                              // 0x0378(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaBattlePassItemTracker*                BattlePassItemTracker_01;                                 // 0x0380(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaBattlePassItemTracker*                BattlePassItemTracker_02;                                 // 0x0388(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaBattlePassItemTracker*                BattlePassItemTracker_03;                                 // 0x0390(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaBattlePassItemTracker*                BattlePassItemTracker_04;                                 // 0x0398(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UBattlePassScreenPurchaseButton*             Button_PurchaseBattlePass;                                // 0x03A0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaBattlePassTracker");
		
		return ptr;
	}


	void HandleBattlePassPurchaseFlowComplete(bool bClosePresentationScreen);
};


// Class FortniteUI.AthenaBroadcastFollowedPlayerInfoBase
// 0x0028 (0x02F0 - 0x02C8)
class UAthenaBroadcastFollowedPlayerInfoBase : public UFortHUDElementWidget
{
public:
	class UAthenaSpectatorPlayerWidgetBase*            PlayerWidget;                                             // 0x02C8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaSpectatorHitPointBarBase*             HitPointBar_Health;                                       // 0x02D0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaSpectatorHitPointBarBase*             HitPointBar_Shield;                                       // 0x02D8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaSpectatorHitPointBarBase*             HitPointBar_Vehicle;                                      // 0x02E0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x02E8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastFollowedPlayerInfoBase");
		
		return ptr;
	}


	void OnVehicleStateChanged(class AActor* NewVehicle, class AActor* OldVehicle);
	void OnPipModeChanged(bool bPipModeEnabled);
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatingPC, class AFortPlayerState* FollowedPlayerState);
	void OnEliminatedStateChanged(class UAthenaRemotePlayerViewData* PlayerData, bool bIsEliminated);
};


// Class FortniteUI.AthenaGamePhaseWidgetBase
// 0x0020 (0x02E8 - 0x02C8)
class UAthenaGamePhaseWidgetBase : public UFortHUDElementWidget
{
public:
	class UMaterialInterface*                          StormComingFontMaterial;                                  // 0x02C8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              StormComingWarningTime;                                   // 0x02D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x02D4(0x0004) MISSED OFFSET
	class UTextBlock*                                  TimeText;                                                 // 0x02D8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x02E0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaGamePhaseWidgetBase");
		
		return ptr;
	}


	void OnGameStateSet(class AFortGameState* InGameState);
	void OnGamePhaseStepChanged(EAthenaGamePhaseStep GamePhaseStep);
	void HandleGamePhaseStepChanged(const TScriptInterface<class UFortSafeZoneInterface>& SafeZoneInterface, EAthenaGamePhaseStep GamePhaseStep);
	void HandleCountdownUpdate(int TimeRemaining);
};


// Class FortniteUI.AthenaBroadcastGamePhaseWidget
// 0x0008 (0x02F0 - 0x02E8)
class UAthenaBroadcastGamePhaseWidget : public UAthenaGamePhaseWidgetBase
{
public:
	class AFortMinigame*                               MinigameOverride;                                         // 0x02E8(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastGamePhaseWidget");
		
		return ptr;
	}


	void SetMinigameOverride(class AFortMinigame* Minigame);
};


// Class FortniteUI.FortUIStateWidgetBase
// 0x0018 (0x0320 - 0x0308)
class UFortUIStateWidgetBase : public UCommonActivatableWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0308(0x0010) MISSED OFFSET
	class UCommonActivatableWidgetStack*               WidgetStack_PrimaryContent;                               // 0x0318(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("Class FortniteUI.FortUIStateWidgetBase");
		
		return ptr;
	}

};


// Class FortniteUI.AthenaHUDBase
// 0x0190 (0x04B0 - 0x0320)
class UAthenaHUDBase : public UFortUIStateWidgetBase
{
public:
	TArray<class UUserWidget*>                         MinigameWidgets;                                          // 0x0320(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0330(0x0028) MISSED OFFSET
	class UOverlay*                                    ScalableOverlay;                                          // 0x0358(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaMapScreenContainer*                   MapScreenContainer;                                       // 0x0360(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaHUDMenu*                              AthenaHUDMenu;                                            // 0x0368(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaPlayerTeamKillsBase*                  AthenaTeamKillsWidget;                                    // 0x0370(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaSquadListBase*                        TeamInfo;                                                 // 0x0378(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaPlayerHitPointInfo*                   LocalPlayerHitPointInfo;                                  // 0x0380(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaEquippedItemBase*                     AthenaEquippedItemWidget;                                 // 0x0388(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaSkydivingInformation*                 SkydivingInfoWidget;                                      // 0x0390(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidgetSwitcher*                             CompassSwitcher;                                          // 0x0398(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class URetainerBox*                                RetainerBox_TempFrit;                                     // 0x03A0(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class AFortVolume*                                 CreativeLinkedVolume;                                     // 0x03A8(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UAthenaIndicatorLayerBase*                   AthenaIndicatorLayer;                                     // 0x03B0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
