#pragma once

// Fortnite (14.30) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass SwimmingAnimBP.SwimmingAnimBP_C
// 0x5D49 (0x63E9 - 0x06A0)
class USwimmingAnimBP_C : public UFortSwimmingLayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x06A0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimInstanceSubsystemData                  AnimBlueprintClassSubsystem_PropertyAccess;               // 0x06A8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x06A9(0x0007) MISSED OFFSET
	struct FAnimNode_Root                              AnimGraphNode_Root_10;                                    // 0x06B0(0x0030)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone_2;                           // 0x06E0(0x00A0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_4;                 // 0x0780(0x0188)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_3;                 // 0x0908(0x0188)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_15;                         // 0x0A90(0x0088)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_49;                        // 0x0B18(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_48;                        // 0x0B40(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_47;                        // 0x0B68(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_46;                        // 0x0B90(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15;                          // 0x0BB8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_24;                             // 0x0C30(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_14;                          // 0x0C60(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_23;                             // 0x0CD8(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_13;                          // 0x0D08(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_22;                             // 0x0D80(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6;                             // 0x0DB0(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_11;                          // 0x0E60(0x00C8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_9;                          // 0x0F28(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_16;                           // 0x0FC8(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5;                         // 0x0FF0(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_15;                           // 0x10B0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_12;                          // 0x10D8(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_8;                              // 0x1150(0x00C8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_10;                          // 0x1218(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_14;                           // 0x12E0(0x0028)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_3;                          // 0x1308(0x00B0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_13;                           // 0x13B8(0x0028)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_2;                            // 0x13E0(0x00C8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_11;                          // 0x14A8(0x0078)
	struct FAnimNode_Root                              AnimGraphNode_Root_9;                                     // 0x1520(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_14;                         // 0x1550(0x0088)
	struct FAnimNode_Root                              AnimGraphNode_Root_8;                                     // 0x15D8(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_45;                        // 0x1608(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_44;                        // 0x1630(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_43;                        // 0x1658(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_42;                        // 0x1680(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_41;                        // 0x16A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40;                        // 0x16D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_39;                        // 0x16F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_38;                        // 0x1720(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_37;                        // 0x1748(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_36;                        // 0x1770(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10;                          // 0x1798(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_21;                             // 0x1810(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_14;                        // 0x1840(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_20;                             // 0x1920(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_13;                        // 0x1950(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_19;                             // 0x1A30(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9;                           // 0x1A60(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_18;                             // 0x1AD8(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_12;                           // 0x1B08(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_17;                             // 0x1B30(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_12;                        // 0x1B60(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_16;                             // 0x1C40(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_5;                             // 0x1C70(0x00B0)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_13;                         // 0x1D20(0x0088)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_9;                           // 0x1DA8(0x00C8)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_12;                         // 0x1E70(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8;                          // 0x1EF8(0x00A0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4;                         // 0x1F98(0x00C0)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_3;                             // 0x2058(0x0018)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_11;                         // 0x2070(0x0088)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_8;                           // 0x20F8(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_11;                           // 0x21C0(0x0028)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_7;                           // 0x21E8(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_10;                           // 0x22B0(0x0028)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_3;                         // 0x22D8(0x00C0)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose_2;                             // 0x2398(0x0018)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_2;                         // 0x23B0(0x00C0)
	struct FAnimNode_RefPose                           AnimGraphNode_IdentityPose;                               // 0x2470(0x0018)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive;                              // 0x2488(0x00C8)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_10;                         // 0x2550(0x0088)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_6;                           // 0x25D8(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9;                            // 0x26A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_35;                        // 0x26C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_34;                        // 0x26F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_33;                        // 0x2718(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_32;                        // 0x2740(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_31;                        // 0x2768(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_30;                        // 0x2790(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_29;                        // 0x27B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_28;                        // 0x27E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_27;                        // 0x2808(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_26;                        // 0x2830(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_25;                        // 0x2858(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_24;                        // 0x2880(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_23;                        // 0x28A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_22;                        // 0x28D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_21;                        // 0x28F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_20;                        // 0x2920(0x0028)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_6;                    // 0x2948(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7;                               // 0x2968(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_6;                    // 0x2A70(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19;                        // 0x2A90(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_18;                        // 0x2AB8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_17;                        // 0x2AE0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_16;                        // 0x2B08(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8;                           // 0x2B30(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_7;                          // 0x2BA8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7;                           // 0x2C48(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_15;                             // 0x2CC0(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_11;                        // 0x2CF0(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_14;                             // 0x2DD0(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6;                           // 0x2E00(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_13;                             // 0x2E78(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_4;                             // 0x2EA8(0x00B0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_12;                             // 0x2F58(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_15;                        // 0x2F88(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5;                           // 0x2FB0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_11;                             // 0x3028(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8;                            // 0x3058(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_10;                             // 0x3080(0x0030)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7;                            // 0x30B0(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_9;                              // 0x30D8(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3;                             // 0x3108(0x00B0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_5;                           // 0x31B8(0x00C8)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_9;                          // 0x3280(0x0088)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_4;                           // 0x3308(0x00C8)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_7;                              // 0x33D0(0x00C8)
	struct FAnimNode_Root                              AnimGraphNode_Root_7;                                     // 0x3498(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_14;                        // 0x34C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13;                        // 0x34F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_12;                        // 0x3518(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_11;                        // 0x3540(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_10;                        // 0x3568(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9;                         // 0x3590(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8;                         // 0x35B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7;                         // 0x35E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6;                         // 0x3608(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5;                         // 0x3630(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4;                           // 0x3658(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8;                              // 0x36D0(0x0030)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_2;                 // 0x3700(0x0188)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_5;                    // 0x3888(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6;                               // 0x38A8(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_5;                    // 0x39B0(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_10;                        // 0x39D0(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_7;                              // 0x3AB0(0x0030)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace;                   // 0x3AE0(0x0188)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_4;                    // 0x3C68(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5;                               // 0x3C88(0x0108)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_4;                    // 0x3D90(0x0020)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_9;                         // 0x3DB0(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_6;                              // 0x3E90(0x0030)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3;                           // 0x3EC0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5;                              // 0x3F38(0x0030)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4;                               // 0x3F68(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_3;                    // 0x4070(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_3;                    // 0x4090(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3;                               // 0x40B0(0x0108)
	struct FAnimNode_ModifyCurve                       AnimGraphNode_ModifyCurve;                                // 0x41B8(0x0058)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6;                            // 0x4210(0x0028)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_6;                              // 0x4238(0x00C8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_5;                            // 0x4300(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6;                          // 0x4328(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4;                            // 0x43C8(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5;                          // 0x43F0(0x00A0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2;                    // 0x4490(0x0020)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_2;                    // 0x44B0(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2;                               // 0x44D0(0x0108)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3;                            // 0x45D8(0x0028)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4;                              // 0x4600(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_2;                             // 0x4630(0x00B0)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_8;                          // 0x46E0(0x0088)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_3;                           // 0x4768(0x00C8)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_7;                          // 0x4830(0x0088)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_2;                           // 0x48B8(0x00C8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_8;                         // 0x4980(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_4;                          // 0x4A60(0x00A0)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_6;                          // 0x4B00(0x0088)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_5;                              // 0x4B88(0x00C8)
	struct FAnimNode_Root                              AnimGraphNode_Root_6;                                     // 0x4C50(0x0030)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator_2;                        // 0x4C80(0x0048)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_5;                          // 0x4CC8(0x0088)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_4;                              // 0x4D50(0x00C8)
	struct FAnimNode_Root                              AnimGraphNode_Root_5;                                     // 0x4E18(0x0030)
	struct FAnimNode_SequenceEvaluator                 AnimGraphNode_SequenceEvaluator;                          // 0x4E48(0x0048)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_4;                          // 0x4E90(0x0088)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_3;                              // 0x4F18(0x00C8)
	struct FAnimNode_Root                              AnimGraphNode_Root_4;                                     // 0x4FE0(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7;                         // 0x5010(0x00E0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_6;                         // 0x50F0(0x00E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_3;                          // 0x51D0(0x00A0)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_3;                          // 0x5270(0x0088)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_2;                              // 0x52F8(0x00C8)
	struct FAnimNode_Root                              AnimGraphNode_Root_3;                                     // 0x53C0(0x0030)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4;                         // 0x53F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3;                         // 0x5418(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_2;                         // 0x5440(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                           // 0x5468(0x0028)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5;                         // 0x5490(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_3;                              // 0x5570(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_4;                         // 0x55A0(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_2;                          // 0x5680(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_3;                         // 0x5730(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2;                              // 0x5810(0x0030)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2;                         // 0x5840(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum;                            // 0x5920(0x00B0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer;                           // 0x59D0(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                // 0x5AB0(0x0030)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                               // 0x5AE0(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace;                      // 0x5B90(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone;                                 // 0x5BB0(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace;                      // 0x5CB8(0x0020)
	struct FAnimNode_RotateRootBone                    AnimGraphNode_RotateRootBone;                             // 0x5CD8(0x00A0)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose_2;                          // 0x5D78(0x0088)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose;                             // 0x5E00(0x00C8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend;                           // 0x5EC8(0x00C0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2;                            // 0x5F88(0x0028)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_2;                          // 0x5FB0(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose;                              // 0x6050(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2;                           // 0x6078(0x0078)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend;                                // 0x60F0(0x00C8)
	struct FAnimNode_Root                              AnimGraphNode_Root_2;                                     // 0x61B8(0x0030)
	struct FAnimNode_LinkedInputPose                   AnimGraphNode_LinkedInputPose;                            // 0x61E8(0x0088)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool;                            // 0x6270(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                             // 0x6310(0x0078)
	struct FAnimNode_Root                              AnimGraphNode_Root;                                       // 0x6388(0x0030)
	EFortPlayerAnimBodyType                            AnimBodyTypePassThrough;                                  // 0x63B8(0x0001) (BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x63B9(0x0003) MISSED OFFSET
	float                                              MainInstanceDiveJumpLayerAlpha;                           // 0x63BC(0x0004) (BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsHidingInPropLayer2;                                     // 0x63C0(0x0001) (BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x63C1(0x0003) MISSED OFFSET
	float                                              MainInstanceAdditiveLayerAlpha;                           // 0x63C4(0x0004) (BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LocomotionAdditiveAlphaLayer;                             // 0x63C8(0x0004) (BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DisableIKRootAdditiveCurveAlphaLayer;                     // 0x63CC(0x0004) (BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DisableArmsHeadAdditiveCurveAlphaLayer;                   // 0x63D0(0x0004) (BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              PlayMeleeAttackAOLayer;                                   // 0x63D4(0x0004) (BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               IsHidingInPropLayer;                                      // 0x63D8(0x0001) (BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               AllowSprintStop;                                          // 0x63D9(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               SwimSprintSlow_EnoughTimePassed;                          // 0x63DA(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               ChangeMovementToVelocityFromAccel;                        // 0x63DB(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              LocalAccelYawAngleAtStart;                                // 0x63DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PlayMeleeAttackAO;                                        // 0x63E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              PivotAngle;                                               // 0x63E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	TEnumAsByte<EFortWeaponCoreAnimation>              WeaponCoreAnim;                                           // 0x63E8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static UClass* ptr;
		if(!ptr)
			ptr = UObject::FindClass("AnimBlueprintGeneratedClass SwimmingAnimBP.SwimmingAnimBP_C");
		
		return ptr;
	}


	void SwimmingDiveJumpingLayer(const struct FPoseLink& PassThroughSwimmingDiveJumping, bool IsHidingInPropLayer2, float MainInstanceDiveJumpLayerAlpha, EFortPlayerAnimBodyType AnimBodyTypePassThrough, struct FPoseLink* SwimmingDiveJumpingLayer);
	void SwimmingFullBodyAdditiveLayer(const struct FPoseLink& PassThroughFullBodyAdditive, struct FPoseLink* SwimmingFullBodyAdditiveLayer);
