#pragma once

// Fortnite (9.1) SDK
// Dumped with <3 by android#1337

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum ControlRig.ERigExecutionType
enum class ERigExecutionType : uint8_t
{
	Runtime                        = 0,
	Editing                        = 1,
	Max                            = 2
};


// Enum ControlRig.EControlRigOpCode
enum class EControlRigOpCode : uint8_t
{
	Done                           = 0,
	Copy                           = 1,
	Exec                           = 2,
	Invalid                        = 3,
	EControlRigOpCode_MAX          = 4
};


// Enum ControlRig.EBoneGetterSetterMode
enum class EBoneGetterSetterMode : uint8_t
{
	LocalSpace                     = 0,
	GlobalSpace                    = 1,
	Max                            = 2
};


// Enum ControlRig.ETransformGetterType
enum class ETransformGetterType : uint8_t
{
	Initial                        = 0,
	Current                        = 1,
	Max                            = 2
};


// Enum ControlRig.ETransformSpaceMode
enum class ETransformSpaceMode : uint8_t
{
	LocalSpace                     = 0,
	GlobalSpace                    = 1,
	BaseSpace                      = 2,
	BaseJoint                      = 3,
	Max                            = 4
};


// Enum ControlRig.EControlRigDrawHierarchyMode
enum class EControlRigDrawHierarchyMode : uint8_t
{
	Axes                           = 0,
	Max                            = 1
};


// Enum ControlRig.EControlRigAnimEasingType
enum class EControlRigAnimEasingType : uint8_t
{
	Linear                         = 0,
	QuadraticEaseIn                = 1,
	QuadraticEaseOut               = 2,
	QuadraticEaseInOut             = 3,
	CubicEaseIn                    = 4,
	CubicEaseOut                   = 5,
	CubicEaseInOut                 = 6,
	QuarticEaseIn                  = 7,
	QuarticEaseOut                 = 8,
	QuarticEaseInOut               = 9,
	QuinticEaseIn                  = 10,
	QuinticEaseOut                 = 11,
	QuinticEaseInOut               = 12,
	SineEaseIn                     = 13,
	SineEaseOut                    = 14,
	SineEaseInOut                  = 15,
	CircularEaseIn                 = 16,
	CircularEaseOut                = 17,
	CircularEaseInOut              = 18,
	ExponentialEaseIn              = 19,
	ExponentialEaseOut             = 20,
	ExponentialEaseInOut           = 21,
	ElasticEaseIn                  = 22,
	ElasticEaseOut                 = 23,
	ElasticEaseInOut               = 24,
	BackEaseIn                     = 25,
	BackEaseOut                    = 26,
	BackEaseInOut                  = 27,
	BounceEaseIn                   = 28,
	BounceEaseOut                  = 29,
	BounceEaseInOut                = 30,
	EControlRigAnimEasingType_MAX  = 31
};


// Enum ControlRig.EControlRigRotationOrder
enum class EControlRigRotationOrder : uint8_t
{
	XYZ                            = 0,
	XZY                            = 1,
	YXZ                            = 2,
	YZX                            = 3,
	ZXY                            = 4,
	ZYX                            = 5,
	EControlRigRotationOrder_MAX   = 6
};


// Enum ControlRig.ECRSimPointIntegrateType
enum class ECRSimPointIntegrateType : uint8_t
{
	Verlet                         = 0,
	SemiExplicitEuler              = 1,
	ECRSimPointIntegrateType_MAX   = 2
};


// Enum ControlRig.ECRSimConstraintType
enum class ECRSimConstraintType : uint8_t
{
	Distance                       = 0,
	DistanceFromA                  = 1,
	DistanceFromB                  = 2,
	Plane                          = 3,
	ECRSimConstraintType_MAX       = 4
};


// Enum ControlRig.ECRSimPointForceType
enum class ECRSimPointForceType : uint8_t
{
	Direction                      = 0,
	ECRSimPointForceType_MAX       = 1
};


// Enum ControlRig.ECRSimSoftCollisionType
enum class ECRSimSoftCollisionType : uint8_t
{
	Plane                          = 0,
	Sphere                         = 1,
	Cone                           = 2,
	ECRSimSoftCollisionType_MAX    = 3
};


// Enum ControlRig.EUnitExecutionType
enum class EUnitExecutionType : uint8_t
{
	Always                         = 0,
	InEditingTime                  = 1,
	Disable                        = 2,
	Initialize                     = 3,
	Max                            = 4
};


// Enum ControlRig.EAimMode
enum class EAimMode : uint8_t
{
	AimAtTarget                    = 0,
	OrientToTarget                 = 1,
	MAX                            = 2
};


// Enum ControlRig.EApplyTransformMode
enum class EApplyTransformMode : uint8_t
{
	Override                       = 0,
	Additive                       = 1,
	Max                            = 2
};


// Enum ControlRig.ERigUnitDebugPointMode
enum class ERigUnitDebugPointMode : uint8_t
{
	Point                          = 0,
	Vector                         = 1,
	Max                            = 2
};


// Enum ControlRig.ERigUnitDebugTransformMode
enum class ERigUnitDebugTransformMode : uint8_t
{
	Point                          = 0,
	Axes                           = 1,
	Box                            = 2,
	Max                            = 3
};


// Enum ControlRig.EControlRigCurveAlignment
enum class EControlRigCurveAlignment : uint8_t
{
	Front                          = 0,
	Stretched                      = 1,
	EControlRigCurveAlignment_MAX  = 2
};


// Enum ControlRig.EControlRigVectorKind
enum class EControlRigVectorKind : uint8_t
{
	Direction                      = 0,
	Location                       = 1,
	EControlRigVectorKind_MAX      = 2
};


// Enum ControlRig.EControlRigState
enum class EControlRigState : uint8_t
{
	Init                           = 0,
	Update                         = 1,
	Invalid                        = 2,
	EControlRigState_MAX           = 3
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct ControlRig.RigBone
// 0x00C0
struct FRigBone
{
	struct FName                                       Name;                                                     // 0x0000(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	struct FName                                       ParentName;                                               // 0x0008(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	int                                                ParentIndex;                                              // 0x0010(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0014(0x000C) MISSED OFFSET
	struct FTransform                                  InitialTransform;                                         // 0x0020(0x0030) (Edit, IsPlainOldData)
	struct FTransform                                  GlobalTransform;                                          // 0x0050(0x0030) (Edit, Transient, EditConst, IsPlainOldData)
	struct FTransform                                  LocalTransform;                                           // 0x0080(0x0030) (Edit, Transient, EditConst, IsPlainOldData)
	TArray<int>                                        Dependents;                                               // 0x00B0(0x0010) (ZeroConstructor, Transient)
};

// ScriptStruct ControlRig.RigHierarchy
// 0x0060
struct FRigHierarchy
{
	TArray<struct FRigBone>                            Bones;                                                    // 0x0000(0x0010) (Edit, ZeroConstructor)
	TMap<struct FName, int>                            NameToIndexMapping;                                       // 0x0010(0x0050) (ZeroConstructor)
};

// ScriptStruct ControlRig.RigHierarchyContainer
// 0x00C0
struct FRigHierarchyContainer
{
	unsigned char                                      UnknownData00[0x60];                                      // 0x0000(0x0060) MISSED OFFSET
	struct FRigHierarchy                               BaseHierarchy;                                            // 0x0060(0x0060)
};

// ScriptStruct ControlRig.ControlRigOperator
// 0x0078
struct FControlRigOperator
{
	EControlRigOpCode                                  OpCode;                                                   // 0x0000(0x0001) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0001(0x0007) MISSED OFFSET
	struct FString                                     PropertyPath1;                                            // 0x0008(0x0010) (ZeroConstructor, Deprecated)
	struct FString                                     PropertyPath2;                                            // 0x0018(0x0010) (ZeroConstructor, Deprecated)
	struct FCachedPropertyPath                         CachedPropertyPath1;                                      // 0x0028(0x0028) (Edit, EditConst)
	struct FCachedPropertyPath                         CachedPropertyPath2;                                      // 0x0050(0x0028) (Edit, EditConst)
};

// ScriptStruct ControlRig.ConstraintNodeData
// 0x00B0
struct FConstraintNodeData
{
	struct FTransform                                  RelativeParent;                                           // 0x0000(0x0030) (IsPlainOldData)
	struct FConstraintOffset                           ConstraintOffset;                                         // 0x0030(0x0060)
	struct FName                                       LinkedNode;                                               // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FTransformConstraint>                Constraints;                                              // 0x0098(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x8];                                       // 0x00A8(0x0008) MISSED OFFSET
};

// ScriptStruct ControlRig.AnimationHierarchy
// 0x0010 (0x0088 - 0x0078)
struct FAnimationHierarchy : public FNodeHierarchyWithUserData
{
	TArray<struct FConstraintNodeData>                 UserData;                                                 // 0x0078(0x0010) (ZeroConstructor)
};

// ScriptStruct ControlRig.AnimNode_ControlRigBase
// 0x0018 (0x0028 - 0x0010)
struct FAnimNode_ControlRigBase : public FAnimNode_Base
{
	TArray<struct FName>                               RigHierarchyItemNameMapping;                              // 0x0010(0x0010) (ZeroConstructor, Transient)
	TWeakObjectPtr<class UNodeMappingContainer>        NodeMappingContainer;                                     // 0x0020(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct ControlRig.AnimNode_ControlRig
// 0x0020 (0x0048 - 0x0028)
struct FAnimNode_ControlRig : public FAnimNode_ControlRigBase
{
	struct FPoseLink                                   Source;                                                   // 0x0028(0x0010) (Edit)
	class UClass*                                      ControlRigClass;                                          // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UControlRig*                                 ControlRig;                                               // 0x0040(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct ControlRig.AnimNode_ControlRig_ExternalSource
// 0x0008 (0x0030 - 0x0028)
struct FAnimNode_ControlRig_ExternalSource : public FAnimNode_ControlRigBase
{
	TWeakObjectPtr<class UControlRig>                  ControlRig;                                               // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct ControlRig.ControlRigBindingTemplate
// 0x0000 (0x00B0 - 0x00B0)
struct FControlRigBindingTemplate : public FMovieSceneSpawnSectionTemplate
{

};

// ScriptStruct ControlRig.ControlRigComponentInstanceData
// 0x0008 (0x0060 - 0x0058)
struct FControlRigComponentInstanceData : public FActorComponentInstanceData
{
	class UControlRig*                                 AnimControlRig;                                           // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.ControlRigExecuteContext
// 0x0018
struct FControlRigExecuteContext
{
	unsigned char                                      UnknownData00[0x18];                                      // 0x0000(0x0018) MISSED OFFSET
};

// ScriptStruct ControlRig.CRFourPointBezier
// 0x0030
struct FCRFourPointBezier
{
	struct FVector                                     A;                                                        // 0x0000(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     B;                                                        // 0x000C(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     C;                                                        // 0x0018(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     D;                                                        // 0x0024(0x000C) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.ControlRigSequenceObjectReference
// 0x0008
struct FControlRigSequenceObjectReference
{
	class UClass*                                      ControlRigClass;                                          // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.ControlRigSequenceObjectReferences
// 0x0010
struct FControlRigSequenceObjectReferences
{
	TArray<struct FControlRigSequenceObjectReference>  Array;                                                    // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct ControlRig.ControlRigSequenceObjectReferenceMap
// 0x0020
struct FControlRigSequenceObjectReferenceMap
{
	TArray<struct FGuid>                               BindingIds;                                               // 0x0000(0x0010) (ZeroConstructor)
	TArray<struct FControlRigSequenceObjectReferences> References;                                               // 0x0010(0x0010) (ZeroConstructor)
};

// ScriptStruct ControlRig.ControlRigSequencerAnimInstanceProxy
// 0x0170 (0x09C0 - 0x0850)
struct FControlRigSequencerAnimInstanceProxy : public FAnimSequencerInstanceProxy
{
	unsigned char                                      UnknownData00[0x170];                                     // 0x0850(0x0170) MISSED OFFSET
};

// ScriptStruct ControlRig.CRSimContainer
// 0x0018
struct FCRSimContainer
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	float                                              TimeStep;                                                 // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              AccumulatedTime;                                          // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TimeLeftForStep;                                          // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.CRSimLinearSpring
// 0x0010
struct FCRSimLinearSpring
{
	int                                                SubjectA;                                                 // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                SubjectB;                                                 // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Coefficient;                                              // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Equilibrium;                                              // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.CRSimPoint
// 0x0028
struct FCRSimPoint
{
	float                                              Mass;                                                     // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Size;                                                     // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              LinearDamping;                                            // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              InheritMotion;                                            // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     Position;                                                 // 0x0010(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     LinearVelocity;                                           // 0x001C(0x000C) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.CRSimPointConstraint
// 0x0024
struct FCRSimPointConstraint
{
	ECRSimConstraintType                               Type;                                                     // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                SubjectA;                                                 // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                SubjectB;                                                 // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     DataA;                                                    // 0x000C(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     DataB;                                                    // 0x0018(0x000C) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.CRSimPointForce
// 0x0018
struct FCRSimPointForce
{
	ECRSimPointForceType                               ForceType;                                                // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector                                     Vector;                                                   // 0x0004(0x000C) (ZeroConstructor, IsPlainOldData)
	float                                              Coefficient;                                              // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bNormalize;                                               // 0x0014(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0015(0x0003) MISSED OFFSET
};

// ScriptStruct ControlRig.CRSimSoftCollision
// 0x0050
struct FCRSimSoftCollision
{
	struct FTransform                                  Transform;                                                // 0x0000(0x0030) (IsPlainOldData)
	ECRSimSoftCollisionType                            ShapeType;                                                // 0x0030(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0031(0x0003) MISSED OFFSET
	float                                              MinimumDistance;                                          // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              MaximumDistance;                                          // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	EControlRigAnimEasingType                          FalloffType;                                              // 0x003C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
	float                                              Coefficient;                                              // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bInverted;                                                // 0x0044(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xB];                                       // 0x0045(0x000B) MISSED OFFSET
};

// ScriptStruct ControlRig.CRSimPointContainer
// 0x0060 (0x0078 - 0x0018)
struct FCRSimPointContainer : public FCRSimContainer
{
	TArray<struct FCRSimPoint>                         Points;                                                   // 0x0018(0x0010) (ZeroConstructor)
	TArray<struct FCRSimLinearSpring>                  Springs;                                                  // 0x0028(0x0010) (ZeroConstructor)
	TArray<struct FCRSimPointForce>                    Forces;                                                   // 0x0038(0x0010) (ZeroConstructor)
	TArray<struct FCRSimSoftCollision>                 CollisionVolumes;                                         // 0x0048(0x0010) (ZeroConstructor)
	TArray<struct FCRSimPointConstraint>               Constraints;                                              // 0x0058(0x0010) (ZeroConstructor)
	TArray<struct FCRSimPoint>                         PreviousStep;                                             // 0x0068(0x0010) (ZeroConstructor)
};

// ScriptStruct ControlRig.RigHierarchyRef
// 0x0018
struct FRigHierarchyRef
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	bool                                               bUseBaseHierarchy;                                        // 0x0008(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
	struct FName                                       Name;                                                     // 0x000C(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.MovieSceneControlRigInstanceData
// 0x00D0 (0x00D8 - 0x0008)
struct FMovieSceneControlRigInstanceData : public FMovieSceneSequenceInstanceData
{
	bool                                               bAdditive;                                                // 0x0008(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bApplyBoneFilter;                                         // 0x0009(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x000A(0x0006) MISSED OFFSET
	struct FInputBlendPose                             BoneFilter;                                               // 0x0010(0x0010)
	struct FMovieSceneFloatChannel                     Weight;                                                   // 0x0020(0x00A0)
	struct FMovieSceneEvaluationOperand                Operand;                                                  // 0x00C0(0x0014)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00D4(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit
// 0x0020
struct FRigUnit
{
	unsigned char                                      UnknownData00[0x8];                                       // 0x0000(0x0008) MISSED OFFSET
	struct FName                                       RigUnitName;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData)
	struct FName                                       RigUnitStructName;                                        // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData)
	EUnitExecutionType                                 ExecutionType;                                            // 0x0018(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0019(0x0007) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnitMutable
// 0x0018 (0x0038 - 0x0020)
struct FRigUnitMutable : public FRigUnit
{
	struct FControlRigExecuteContext                   ExecuteContext;                                           // 0x0020(0x0018) (Transient)
};

// ScriptStruct ControlRig.RigUnit_SimBase
// 0x0000 (0x0020 - 0x0020)
struct FRigUnit_SimBase : public FRigUnit
{

};

// ScriptStruct ControlRig.RigUnit_AccumulateVectorRange
// 0x0040 (0x0060 - 0x0020)
struct FRigUnit_AccumulateVectorRange : public FRigUnit_SimBase
{
	struct FVector                                     Value;                                                    // 0x0020(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     Minimum;                                                  // 0x002C(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     Maximum;                                                  // 0x0038(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     AccumulatedMinimum;                                       // 0x0044(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     AccumulatedMaximum;                                       // 0x0050(0x000C) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x005C(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_AccumulateFloatRange
// 0x0018 (0x0038 - 0x0020)
struct FRigUnit_AccumulateFloatRange : public FRigUnit_SimBase
{
	float                                              Value;                                                    // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Minimum;                                                  // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Maximum;                                                  // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              AccumulatedMinimum;                                       // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              AccumulatedMaximum;                                       // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_AccumulateTransformLerp
// 0x00D0 (0x00F0 - 0x0020)
struct FRigUnit_AccumulateTransformLerp : public FRigUnit_SimBase
{
	struct FTransform                                  TargetValue;                                              // 0x0020(0x0030) (IsPlainOldData)
	struct FTransform                                  InitialValue;                                             // 0x0050(0x0030) (IsPlainOldData)
	float                                              Blend;                                                    // 0x0080(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIntegrateDeltaTime;                                      // 0x0084(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xB];                                       // 0x0085(0x000B) MISSED OFFSET
	struct FTransform                                  Result;                                                   // 0x0090(0x0030) (IsPlainOldData)
	struct FTransform                                  AccumulatedValue;                                         // 0x00C0(0x0030) (IsPlainOldData)
};

// ScriptStruct ControlRig.RigUnit_AccumulateQuatLerp
// 0x0050 (0x0070 - 0x0020)
struct FRigUnit_AccumulateQuatLerp : public FRigUnit_SimBase
{
	struct FQuat                                       TargetValue;                                              // 0x0020(0x0010) (IsPlainOldData)
	struct FQuat                                       InitialValue;                                             // 0x0030(0x0010) (IsPlainOldData)
	float                                              Blend;                                                    // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIntegrateDeltaTime;                                      // 0x0044(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xB];                                       // 0x0045(0x000B) MISSED OFFSET
	struct FQuat                                       Result;                                                   // 0x0050(0x0010) (IsPlainOldData)
	struct FQuat                                       AccumulatedValue;                                         // 0x0060(0x0010) (IsPlainOldData)
};

// ScriptStruct ControlRig.RigUnit_AccumulateVectorLerp
// 0x0038 (0x0058 - 0x0020)
struct FRigUnit_AccumulateVectorLerp : public FRigUnit_SimBase
{
	struct FVector                                     TargetValue;                                              // 0x0020(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     InitialValue;                                             // 0x002C(0x000C) (ZeroConstructor, IsPlainOldData)
	float                                              Blend;                                                    // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIntegrateDeltaTime;                                      // 0x003C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
	struct FVector                                     Result;                                                   // 0x0040(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     AccumulatedValue;                                         // 0x004C(0x000C) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.RigUnit_AccumulateFloatLerp
// 0x0018 (0x0038 - 0x0020)
struct FRigUnit_AccumulateFloatLerp : public FRigUnit_SimBase
{
	float                                              TargetValue;                                              // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              InitialValue;                                             // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Blend;                                                    // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIntegrateDeltaTime;                                      // 0x002C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x002D(0x0003) MISSED OFFSET
	float                                              Result;                                                   // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              AccumulatedValue;                                         // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.RigUnit_AccumulateTransformMul
// 0x00D0 (0x00F0 - 0x0020)
struct FRigUnit_AccumulateTransformMul : public FRigUnit_SimBase
{
	struct FTransform                                  Multiplier;                                               // 0x0020(0x0030) (IsPlainOldData)
	struct FTransform                                  InitialValue;                                             // 0x0050(0x0030) (IsPlainOldData)
	bool                                               bFlipOrder;                                               // 0x0080(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIntegrateDeltaTime;                                      // 0x0081(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xE];                                       // 0x0082(0x000E) MISSED OFFSET
	struct FTransform                                  Result;                                                   // 0x0090(0x0030) (IsPlainOldData)
	struct FTransform                                  AccumulatedValue;                                         // 0x00C0(0x0030) (IsPlainOldData)
};

// ScriptStruct ControlRig.RigUnit_AccumulateQuatMul
// 0x0050 (0x0070 - 0x0020)
struct FRigUnit_AccumulateQuatMul : public FRigUnit_SimBase
{
	struct FQuat                                       Multiplier;                                               // 0x0020(0x0010) (IsPlainOldData)
	struct FQuat                                       InitialValue;                                             // 0x0030(0x0010) (IsPlainOldData)
	bool                                               bFlipOrder;                                               // 0x0040(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIntegrateDeltaTime;                                      // 0x0041(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xE];                                       // 0x0042(0x000E) MISSED OFFSET
	struct FQuat                                       Result;                                                   // 0x0050(0x0010) (IsPlainOldData)
	struct FQuat                                       AccumulatedValue;                                         // 0x0060(0x0010) (IsPlainOldData)
};

// ScriptStruct ControlRig.RigUnit_AccumulateVectorMul
// 0x0038 (0x0058 - 0x0020)
struct FRigUnit_AccumulateVectorMul : public FRigUnit_SimBase
{
	struct FVector                                     Multiplier;                                               // 0x0020(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     InitialValue;                                             // 0x002C(0x000C) (ZeroConstructor, IsPlainOldData)
	bool                                               bIntegrateDeltaTime;                                      // 0x0038(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	struct FVector                                     Result;                                                   // 0x003C(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     AccumulatedValue;                                         // 0x0048(0x000C) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_AccumulateFloatMul
// 0x0018 (0x0038 - 0x0020)
struct FRigUnit_AccumulateFloatMul : public FRigUnit_SimBase
{
	float                                              Multiplier;                                               // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              InitialValue;                                             // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIntegrateDeltaTime;                                      // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
	float                                              Result;                                                   // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              AccumulatedValue;                                         // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_AccumulateVectorAdd
// 0x0038 (0x0058 - 0x0020)
struct FRigUnit_AccumulateVectorAdd : public FRigUnit_SimBase
{
	struct FVector                                     Increment;                                                // 0x0020(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     InitialValue;                                             // 0x002C(0x000C) (ZeroConstructor, IsPlainOldData)
	bool                                               bIntegrateDeltaTime;                                      // 0x0038(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	struct FVector                                     Result;                                                   // 0x003C(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     AccumulatedValue;                                         // 0x0048(0x000C) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_AccumulateFloatAdd
// 0x0018 (0x0038 - 0x0020)
struct FRigUnit_AccumulateFloatAdd : public FRigUnit_SimBase
{
	float                                              Increment;                                                // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              InitialValue;                                             // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bIntegrateDeltaTime;                                      // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
	float                                              Result;                                                   // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              AccumulatedValue;                                         // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_AddBoneTransform
// 0x0048 (0x0080 - 0x0038)
struct FRigUnit_AddBoneTransform : public FRigUnitMutable
{
	struct FName                                       Bone;                                                     // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FTransform                                  Transform;                                                // 0x0040(0x0030) (IsPlainOldData)
	bool                                               bPostMultiply;                                            // 0x0070(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bPropagateToChildren;                                     // 0x0071(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0072(0x0002) MISSED OFFSET
	int                                                CachedBoneIndex;                                          // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0078(0x0008) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_HighlevelBaseMutable
// 0x0000 (0x0038 - 0x0038)
struct FRigUnit_HighlevelBaseMutable : public FRigUnitMutable
{

};

// ScriptStruct ControlRig.RigUnit_AimBone_Target
// 0x0028
struct FRigUnit_AimBone_Target
{
	float                                              Weight;                                                   // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     Axis;                                                     // 0x0004(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     Target;                                                   // 0x0010(0x000C) (ZeroConstructor, IsPlainOldData)
	EControlRigVectorKind                              Kind;                                                     // 0x001C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	struct FName                                       Space;                                                    // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.RigUnit_AimBone_DebugSettings
// 0x0040
struct FRigUnit_AimBone_DebugSettings
{
	bool                                               bEnabled;                                                 // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Scale;                                                    // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0008(0x0008) MISSED OFFSET
	struct FTransform                                  WorldOffset;                                              // 0x0010(0x0030) (IsPlainOldData)
};

// ScriptStruct ControlRig.RigUnit_AimBone
// 0x00C8 (0x0100 - 0x0038)
struct FRigUnit_AimBone : public FRigUnit_HighlevelBaseMutable
{
	struct FName                                       Bone;                                                     // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)
	struct FRigUnit_AimBone_Target                     Primary;                                                  // 0x0040(0x0028)
	struct FRigUnit_AimBone_Target                     Secondary;                                                // 0x0068(0x0028)
	bool                                               bPropagateToChildren;                                     // 0x0090(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0091(0x000F) MISSED OFFSET
	struct FRigUnit_AimBone_DebugSettings              DebugSettings;                                            // 0x00A0(0x0040)
	int                                                BoneIndex;                                                // 0x00E0(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FName                                       PrimaryCachedSpaceName;                                   // 0x00E4(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                PrimaryCachedSpaceIndex;                                  // 0x00EC(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FName                                       SecondaryCachedSpaceName;                                 // 0x00F0(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                SecondaryCachedSpaceIndex;                                // 0x00F8(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00FC(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.AimTarget
// 0x0050
struct FAimTarget
{
	float                                              Weight;                                                   // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0004(0x000C) MISSED OFFSET
	struct FTransform                                  Transform;                                                // 0x0010(0x0030) (Edit, IsPlainOldData)
	struct FVector                                     AlignVector;                                              // 0x0040(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_AimConstraint
// 0x0058 (0x0090 - 0x0038)
struct FRigUnit_AimConstraint : public FRigUnitMutable
{
	struct FName                                       Joint;                                                    // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	EAimMode                                           AimMode;                                                  // 0x0040(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	EAimMode                                           UpMode;                                                   // 0x0041(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0042(0x0002) MISSED OFFSET
	struct FVector                                     AimVector;                                                // 0x0044(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     UpVector;                                                 // 0x0050(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x005C(0x0004) MISSED OFFSET
	TArray<struct FAimTarget>                          AimTargets;                                               // 0x0060(0x0010) (Edit, ZeroConstructor)
	TArray<struct FAimTarget>                          UpTargets;                                                // 0x0070(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData02[0x10];                                      // 0x0080(0x0010) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_AnimBase
// 0x0000 (0x0020 - 0x0020)
struct FRigUnit_AnimBase : public FRigUnit
{

};

// ScriptStruct ControlRig.RigUnit_AnimEasing
// 0x0020 (0x0040 - 0x0020)
struct FRigUnit_AnimEasing : public FRigUnit_AnimBase
{
	float                                              Value;                                                    // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	EControlRigAnimEasingType                          Type;                                                     // 0x0024(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
	float                                              SourceMinimum;                                            // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              SourceMaximum;                                            // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TargetMinimum;                                            // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TargetMaximum;                                            // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Result;                                                   // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_AnimEasingType
// 0x0008 (0x0028 - 0x0020)
struct FRigUnit_AnimEasingType : public FRigUnit_AnimBase
{
	EControlRigAnimEasingType                          Type;                                                     // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_AnimEvalRichCurve
// 0x00A8 (0x00C8 - 0x0020)
struct FRigUnit_AnimEvalRichCurve : public FRigUnit_AnimBase
{
	float                                              Value;                                                    // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	struct FRuntimeFloatCurve                          Curve;                                                    // 0x0028(0x0088)
	float                                              SourceMinimum;                                            // 0x00B0(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              SourceMaximum;                                            // 0x00B4(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TargetMinimum;                                            // 0x00B8(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              TargetMaximum;                                            // 0x00BC(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Result;                                                   // 0x00C0(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00C4(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_AnimRichCurve
// 0x0088 (0x00A8 - 0x0020)
struct FRigUnit_AnimRichCurve : public FRigUnit_AnimBase
{
	struct FRuntimeFloatCurve                          Curve;                                                    // 0x0020(0x0088)
};

// ScriptStruct ControlRig.RigUnit_ApplyFK
// 0x0088 (0x00C0 - 0x0038)
struct FRigUnit_ApplyFK : public FRigUnitMutable
{
	struct FName                                       Joint;                                                    // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FTransform                                  Transform;                                                // 0x0040(0x0030) (IsPlainOldData)
	struct FTransformFilter                            Filter;                                                   // 0x0070(0x0009) (Edit)
	EApplyTransformMode                                ApplyTransformMode;                                       // 0x0079(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	ETransformSpaceMode                                ApplyTransformSpace;                                      // 0x007A(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x5];                                       // 0x007B(0x0005) MISSED OFFSET
	struct FTransform                                  BaseTransform;                                            // 0x0080(0x0030) (Edit, IsPlainOldData)
	struct FName                                       BaseJoint;                                                // 0x00B0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x00B8(0x0008) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_BeginExecution
// 0x0018 (0x0038 - 0x0020)
struct FRigUnit_BeginExecution : public FRigUnit
{
	struct FControlRigExecuteContext                   ExecuteContext;                                           // 0x0020(0x0018) (Edit, Transient)
};

// ScriptStruct ControlRig.BlendTarget
// 0x0040
struct FBlendTarget
{
	struct FTransform                                  Transform;                                                // 0x0000(0x0030) (Edit, IsPlainOldData)
	float                                              Weight;                                                   // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0034(0x000C) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_BlendTransform
// 0x0070 (0x0090 - 0x0020)
struct FRigUnit_BlendTransform : public FRigUnit
{
	struct FTransform                                  Source;                                                   // 0x0020(0x0030) (IsPlainOldData)
	TArray<struct FBlendTarget>                        Targets;                                                  // 0x0050(0x0010) (ZeroConstructor)
	struct FTransform                                  Result;                                                   // 0x0060(0x0030) (IsPlainOldData)
};

// ScriptStruct ControlRig.RigUnit_BoneHarmonics_BoneTarget
// 0x000C
struct FRigUnit_BoneHarmonics_BoneTarget
{
	struct FName                                       Bone;                                                     // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	float                                              Ratio;                                                    // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.RigUnit_BoneHarmonics
// 0x0080 (0x00B8 - 0x0038)
struct FRigUnit_BoneHarmonics : public FRigUnit_HighlevelBaseMutable
{
	TArray<struct FRigUnit_BoneHarmonics_BoneTarget>   Bones;                                                    // 0x0038(0x0010) (ZeroConstructor)
	struct FVector                                     WaveSpeed;                                                // 0x0048(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     WaveFrequency;                                            // 0x0054(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     WaveAmplitude;                                            // 0x0060(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     WaveOffset;                                               // 0x006C(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     WaveNoise;                                                // 0x0078(0x000C) (ZeroConstructor, IsPlainOldData)
	EControlRigAnimEasingType                          WaveEase;                                                 // 0x0084(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0085(0x0003) MISSED OFFSET
	float                                              WaveMinimum;                                              // 0x0088(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              WaveMaximum;                                              // 0x008C(0x0004) (ZeroConstructor, IsPlainOldData)
	EControlRigRotationOrder                           RotationOrder;                                            // 0x0090(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bPropagateToChildren;                                     // 0x0091(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0092(0x0006) MISSED OFFSET
	TArray<int>                                        BoneIndices;                                              // 0x0098(0x0010) (ZeroConstructor)
	struct FVector                                     WaveTime;                                                 // 0x00A8(0x000C) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00B4(0x0004) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_BoneName
// 0x0008 (0x0028 - 0x0020)
struct FRigUnit_BoneName : public FRigUnit
{
	struct FName                                       Bone;                                                     // 0x0020(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct ControlRig.RigUnit_ChainHarmonics_Reach
// 0x0028
struct FRigUnit_ChainHarmonics_Reach
{
	bool                                               bEnabled;                                                 // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector                                     ReachTarget;                                              // 0x0004(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     ReachAxis;                                                // 0x0010(0x000C) (ZeroConstructor, IsPlainOldData)
	float                                              ReachMinimum;                                             // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              ReachMaximum;                                             // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	EControlRigAnimEasingType                          ReachEase;                                                // 0x0024(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0025(0x0003) MISSED OFFSET
};

// ScriptStruct ControlRig.RigUnit_ChainHarmonics_Wave
// 0x0040
struct FRigUnit_ChainHarmonics_Wave
{
	bool                                               bEnabled;                                                 // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	struct FVector                                     WaveFrequency;                                            // 0x0004(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     WaveAmplitude;                                            // 0x0010(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     WaveOffset;                                               // 0x001C(0x000C) (ZeroConstructor, IsPlainOldData)
