#pragma once

// Fortnite (9.1) SDK
// Dumped with <3 by android#1337

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_MenusScreen_AnimBP.Fortnite_M_Avg_Player_MenusScreen_AnimBP_C
// 0x110C (0x6F7C - 0x5E70)
class UFortnite_M_Avg_Player_MenusScreen_AnimBP_C : public UFortPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x5E70(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_A674FFBF48506B9BA7EE8CBDBC8210BD;      // 0x5E78(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE;// 0x5E98(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B299A69E447E60EE4F7B6C8FBE368C16;// 0x5EC0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                // 0x5F38(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                             // 0x5F58(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult02;                              // 0x5FD0(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                               // 0x5FF0(0x00B0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt;                             // 0x60A0(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                           // 0x6140(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer02;                           // 0x6168(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DEF0FA8B424C71AC423D7F827E27D566;// 0x61E0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer03;                           // 0x6200(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C5353AF9471A1BD5399A9CA462567314;// 0x6278(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine02;                             // 0x6298(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FCD8E69443C0A585805514BA49F1D848;// 0x6348(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer04;                           // 0x6370(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A5671DD44544B7D8FE344C948A1F6D5F;// 0x63E8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer05;                           // 0x6408(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DCDAAE584818E91CC81A0BA12944C016;// 0x6480(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine03;                             // 0x64A0(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult02;                         // 0x6550(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer06;                           // 0x6578(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult03;                              // 0x65F0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer07;                           // 0x6610(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult04;                              // 0x6688(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FA4F2A1D4B990DE217B853803767EFEA;// 0x66A8(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D53EBE274630FE146FC57C9C40922FA4;// 0x6758(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CBF0067242E2BBE0B1BE1AAB460C3E97;// 0x6780(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FFC399704D92F63AF22597B83C150F11;// 0x67F8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer08;                           // 0x6818(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult05;                              // 0x6890(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine04;                             // 0x68B0(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DD721A434BAE1DC3B4791ABEF2973E96;// 0x6960(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer09;                           // 0x6988(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult06;                              // 0x6A00(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer10;                           // 0x6A20(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult07;                              // 0x6A98(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_DEEE76B9479CA855B13ACDB7B1ADD3DE;// 0x6AB8(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult03;                         // 0x6B68(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer11;                           // 0x6B90(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AFE7D68B41BDD2DFC8A938853BBACE1C;// 0x6C08(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F91BF94341E4790BEA4E0CAAE54C94B4;// 0x6C28(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult08;                              // 0x6CA0(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine05;                             // 0x6CC0(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult04;                         // 0x6D70(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer12;                           // 0x6D98(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult09;                              // 0x6E10(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E6363B3848E7E34F43DA088E680182A5;// 0x6E30(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F169FFA74713A776C1D5A4A712A655F2;// 0x6EA8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine06;                             // 0x6EC8(0x00B0)
	int                                                ClassNameInt;                                             // 0x6F78(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_MenusScreen_AnimBP.Fortnite_M_Avg_Player_MenusScreen_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_D53EBE274630FE146FC57C9C40922FA4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_DD721A434BAE1DC3B4791ABEF2973E96();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_FCD8E69443C0A585805514BA49F1D848();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
