#pragma once

// Fortnite (9.1) SDK
// Dumped with <3 by android#1337

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class FortniteUI.FortHUDElementWidget
// 0x0030 (0x0268 - 0x0238)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTag                                ElementTag;                                               // 0x0238(0x0008) (Edit)
	struct FGameplayTagContainer                       HUDElementTag;                                            // 0x0240(0x0020) (Edit, BlueprintVisible)
	ESlateVisibility                                   HiddenVisibility;                                         // 0x0260(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0261(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortHUDElementWidget");
		return ptr;
	}


	void OnVisibilitySetEvent(ESlateVisibility InVisibility);
	void HandleOnHUDResetToDefaults();
	void HandleOnHUDElementVisibilityChanged(struct FGameplayTagContainer HiddenHUDElementTags);
};


// Class FortniteUI.LTMWidgetBase
// 0x0008 (0x0270 - 0x0268)
class ULTMWidgetBase : public UFortHUDElementWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0268(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.LTMWidgetBase");
		return ptr;
	}


	void OnHandleSpectatingChanged(class AFortPlayerStateZone* SpectatingTarget);
	unsigned char GetViewingTeam();
};


// Class FortniteUI.AshtonWidgetBase
// 0x0018 (0x0288 - 0x0270)
class UAshtonWidgetBase : public ULTMWidgetBase
{
public:
	class AFortAthenaMutator_Ashton*                   AshtonMutatorRef;                                         // 0x0270(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0278(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AshtonWidgetBase");
		return ptr;
	}


	void UpdateAllUI(bool bFirstUpdate);
	void OnVillainRespawnsRemainingChanged();
	void OnVillainRespawnCountChanged(int NumRespawnsLeft, float RespawnPercentLeft);
	void OnStoneListChanged();
	void OnStoneChanged(EAshtonStoneType StoneType, EAshtonStoneStateType StoneState);
	void OnOpenWidget();
	void OnCloseWidget();
};


// Class FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys
// 0x0020 (0x0050 - 0x0030)
class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys : public UBlueprintAsyncActionBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0030(0x0010) UNKNOWN PROPERTY: MulticastInlineDelegateProperty FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys.Finished
	class UFortPlayerSurveyDispatcher*                 Dispatcher;                                               // 0x0040(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0048(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AsyncAction_FortPlayerSurveyDispatcherDisplaySurveys");
		return ptr;
	}


	void OnAllSurveysFinishedDelegate__DelegateSignature();
	void HandleAllSurveysFinished(class UObject* Source);
	class UAsyncAction_FortPlayerSurveyDispatcherDisplaySurveys* STATIC_DisplaySurveys(class UFortPlayerSurveyDispatcher* Dispatcher, int SurveyCount);
};


// Class FortniteUI.AthenaAccountContext
// 0x0000 (0x0030 - 0x0030)
class UAthenaAccountContext : public UBlueprintContextBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaAccountContext");
		return ptr;
	}


	void SimulateBattleBookPurchase(int NumLevelsToPurchase, int* BonusLevelsGranted, bool* bOverLimit);
	bool ShouldReplaceBattleStarsWithAlternateReward();
	bool IsAtMaxBattlePassTier();
	int GetCurrentSeasonNumber();
	struct FText GetCurrentSeasonName();
	class UAthenaSeasonItemDefinition* GetCurrentSeasonDefinition();
	void GetBattleBookPurchaseLimit(int* MaxNumLevelsPossibleToPurchase, int* BonusLevelsGranted);
};


// Class FortniteUI.AthenaAIKillsBase
// 0x0018 (0x0280 - 0x0268)
class UAthenaAIKillsBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                                  KillsText;                                                // 0x0268(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UObject*                                     KillsSource;                                              // 0x0270(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bCustomKillSource;                                        // 0x0278(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0279(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaAIKillsBase");
		return ptr;
	}


	void SetKillsSourcePlayerState(class AFortPlayerStateAthena* InPlayerState);
	void SetKillsSourcePlayerController(class AFortPlayerControllerAthena* InPlayerController);
};


// Class FortniteUI.AthenaAwardAlertBase
// 0x0008 (0x0238 - 0x0230)
class UAthenaAwardAlertBase : public UUserWidget
{
public:
	class UAthenaPlayerViewModel*                      PlayerVM;                                                 // 0x0230(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaAwardAlertBase");
		return ptr;
	}


	void SetDataSource(class UAthenaPlayerViewModel* PlayerViewModel);
	void OnAwardGranted(class UFortAwardItemDefinition* AwardDefinition);
};


// Class FortniteUI.FortActivatablePanel
// 0x0028 (0x0348 - 0x0320)
class UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                               bIsPushedOnToContentPanelStack;                           // 0x0320(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsAlreadyOnContentPanelStack;                            // 0x0321(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EInputPriority                                     InputPriority;                                            // 0x0322(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsClosableByPlayerInput;                                 // 0x0323(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x24];                                      // 0x0324(0x0024) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortActivatablePanel");
		return ptr;
	}


	void RestoreScrollWidget(class UWidget* FallbackWidget);
	void RestoreCenterWidget(class UWidget* FallbackWidget);
};


// Class FortniteUI.AthenaEventScreenBase
// 0x0000 (0x0348 - 0x0348)
class UAthenaEventScreenBase : public UFortActivatablePanel
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaEventScreenBase");
		return ptr;
	}


	void OnSquadDataAdded(class UAthenaRemoteSquadViewData* InPlayerData);
	void OnPlayerDataAdded(class UAthenaRemotePlayerViewData* InPlayerData);
};


// Class FortniteUI.AthenaBroadcastAllPlayersGridBase
// 0x0000 (0x0348 - 0x0348)
class UAthenaBroadcastAllPlayersGridBase : public UAthenaEventScreenBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastAllPlayersGridBase");
		return ptr;
	}


	void OnPlayerDataAdded_BP(class UAthenaRemotePlayerViewData* InPlayerData);
};


// Class FortniteUI.AthenaBroadcastFollowedPlayerInfoBase
// 0x0008 (0x0270 - 0x0268)
class UAthenaBroadcastFollowedPlayerInfoBase : public UFortHUDElementWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0268(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastFollowedPlayerInfoBase");
		return ptr;
	}


	void OnVehicleStateChanged(class UAthenaRemotePlayerViewData* PlayerData, class AActor* NewVehicle, class AActor* OldVehicle);
	void OnPipModeChanged(bool bPipModeEnabled);
	void OnFollowedPlayerDataChanged(class UAthenaRemotePlayerViewData* InFollowedPlayerData);
	void OnFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatingPC, class AFortPlayerState* FollowedPlayerState);
	void OnEliminatedStateChanged(class UAthenaRemotePlayerViewData* PlayerData, bool bIsEliminated);
};


// Class FortniteUI.FortUIStateWidget_NUI
// 0x0018 (0x0360 - 0x0348)
class UFortUIStateWidget_NUI : public UFortActivatablePanel
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0348(0x0008) MISSED OFFSET
	TArray<struct FContentPushState>                   StackStates;                                              // 0x0350(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortUIStateWidget_NUI");
		return ptr;
	}


	void SetFrontEndVisibility(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void RequestOpenSocialMenu();
	void PushContentWidgetInternal(class UWidget* Widget, struct FContentPushState State);
	void PushContentWidgetAdvanced(class UWidget* Widget, bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PushContentWidget(class UWidget* Widget);
	class UWidget* PopContentWidgetInternal(struct FContentPushState State);
	class UWidget* PopContentWidget();
	void PopAllContentWidgets();
	void OnLoadingScreenVisibilityChanged(bool IsVisible);
	void OnHUDScaleChanged(float HUDScale);
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void OnExitState(EFortUIState NextUIState);
	void OnEnterState(EFortUIState PreviousUIState);
	void DynamicHandleLoadingScreenVisibilityChanged(bool IsVisible);
};


// Class FortniteUI.AthenaHUDBase
// 0x0040 (0x03A0 - 0x0360)
class UAthenaHUDBase : public UFortUIStateWidget_NUI
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0360(0x0010) MISSED OFFSET
	class UAthenaPlayerViewModel*                      PlayerViewModel;                                          // 0x0370(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UOverlay*                                    ScalableOverlay;                                          // 0x0378(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UClass*                                      KairosHUDLayerClass;                                      // 0x0380(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0388(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaHUDBase");
		return ptr;
	}


	void ViewModelChanged(class UAthenaPlayerViewModel* ViewModel);
	void UpdateUIExtensions(class AFortPlayerState* ClientState, class AFortMinigame* Minigame);
	void SetQuickBarNative(bool bShouldDoQuickBarNative);
	void SetFullScreenMapVisibility(bool bIsVisible);
	void OnPlaylistExtensionWidgetCreated(EPlaylistUIExtensionSlot ExtensionSlot, class UUserWidget* Widget);
	void OnMinigameHideHUD(bool bLoading);
	void HandleVolumeUnloaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleVolumeStateChanged(EVolumeState NewState, class AFortVolume* Volume);
	void HandleVolumeLoaded(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleUpdateMinigameUIExtensions(class AFortMinigame* Minigame);
	void HandleExitVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleEnteredVolume(class APlayerState* ClientState, class AFortVolume* Volume);
	void HandleCursorModeChanging(bool bCursorModeEnabled);
	void ClearUIExtensions();
	void BindVolumeEvents();
};


// Class FortniteUI.AthenaSpectatorHUDBase
// 0x0008 (0x03A8 - 0x03A0)
class UAthenaSpectatorHUDBase : public UAthenaHUDBase
{
public:
	class UAthenaSpectatorNameplateLayerBase*          NameplateLayer;                                           // 0x03A0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaSpectatorHUDBase");
		return ptr;
	}


	void OnUnableToPerformAction(struct FGameplayTagContainer FailedReason, struct FText FailureText);
	void OnSpectatorViewTargetChanged();
	void OnPlayerTargetingChanged(bool bIsTargeting);
	void OnNameplatesEnabledChanged(bool bInNameplatesEnabled);
	void OnIndicatorModeChanged(bool bIndicatorsEnabled);
	void OnCursorModeChanged(bool bCursorModeEnabled, struct FName ActionName, class UUserWidget* CursorModeContentWidget);
};


// Class FortniteUI.AthenaBroadcastHUDBase
// 0x00E0 (0x0488 - 0x03A8)
class UAthenaBroadcastHUDBase : public UAthenaSpectatorHUDBase
{
public:
	class UAthenaSpectatorHUDControlsBase*             BroadcastHUDControls;                                     // 0x03A8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonWidgetSwitcher*                       EventMatchInfoSwitcher;                                   // 0x03B0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FDataTableRowHandle                         ToggleMatchStatusActionRowHandle;                         // 0x03B8(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ToggleSquadStatusActionRowHandle;                         // 0x03C8(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ToggleRemainingPlayersActionRowHandle;                    // 0x03D8(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ToggleActiveGridScreenActionRowHandle;                    // 0x03E8(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ToggleEliminatedGridScreenActionRowHandle;                // 0x03F8(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ToggleMatchStatusScreenActionRowHandle;                   // 0x0408(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ToggleScoreboardScreenActionRowHandle;                    // 0x0418(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ToggleKillFeedActionRowHandle;                            // 0x0428(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ToggleActionFeedScreenActionRowHandle;                    // 0x0438(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FDataTableRowHandle                         ToggleGotoTimeRowHandle;                                  // 0x0448(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FDataTableRowHandle                         ToggleAllPlayersGridActionRowHandle;                      // 0x0458(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         TogglePipModeActionRowHandle;                             // 0x0468(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ToggleFollowedPlayerInfoActionRowHandle;                  // 0x0478(0x0010) (Edit, DisableEditOnInstance)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastHUDBase");
		return ptr;
	}


	void OnToggleSquadStatusActionExecuted(bool* bPassThrough);
	void OnToggleScoreboardScreenActionExecuted(bool* bPassThrough);
	void OnToggleRemainingPlayersActionExecuted(bool* bPassThrough);
	void OnTogglePipModeActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusScreenActionExecuted(bool* bPassThrough);
	void OnToggleMatchStatusActionExecuted(bool* bPassThrough);
	void OnToggleKillFeedActionExecuted(bool* bPassThrough);
	void OnToggleGoToTimeScreen(bool* bPassThrough);
	void OnToggleFollowedPlayerInfoActionExecuted(bool* bPassThrough);
	void OnToggleEliminatedGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleAllPlayersGridActionExecuted(bool* bPassThrough);
	void OnToggleActiveGridScreenActionExecuted(bool* bPassThrough);
	void OnToggleActionFeedScreenActionExecuted(bool* bPassThrough);
	void OnPlaylistDataChanged(class UFortPlaylistAthena* PlaylistData);
	void OnNewGameState(class AFortGameState* NewGameState);
	void OnGameStateSet(class AFortGameState* NewGameState);
	void OnCurrentPlaylistChanged();
};


// Class FortniteUI.FortActorIndicatorWidget
// 0x0038 (0x02A0 - 0x0268)
class UFortActorIndicatorWidget : public UFortHUDElementWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0268(0x0008) MISSED OFFSET
	class AActor*                                      IndicatedActor;                                           // 0x0270(0x0008) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	class UPrimitiveComponent*                         IndicatedActorComponent;                                  // 0x0278(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FVector                                     RelativeLocation;                                         // 0x0280(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxDistance;                                              // 0x028C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bClampOnScreen;                                           // 0x0290(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bShowClampToScreenArrow;                                  // 0x0291(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseScreenSpacePosition;                                  // 0x0292(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0293(0x0001) MISSED OFFSET
	struct FVector2D                                   ScreenSpaceRelativeOffset;                                // 0x0294(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                ScreenPriority;                                           // 0x029C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortActorIndicatorWidget");
		return ptr;
	}

};


// Class FortniteUI.AthenaBroadcastHUDMenuStatusBase
// 0x0008 (0x02A8 - 0x02A0)
class UAthenaBroadcastHUDMenuStatusBase : public UFortActorIndicatorWidget
{
public:
	float                                              ZOffset;                                                  // 0x02A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x02A4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastHUDMenuStatusBase");
		return ptr;
	}


	void MapActivated();
	void InventoryActivated();
};


// Class FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase
// 0x0010 (0x0278 - 0x0268)
class UAthenaBroadcastHUDMenuStatusLayerBase : public UFortHUDElementWidget
{
public:
	class UClass*                                      HUDMenuStatusWidgetClass;                                 // 0x0268(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0270(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastHUDMenuStatusLayerBase");
		return ptr;
	}


	void RemoveHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
	void DeactivateHudMenuWidget();
	void AddHUDMenuStatus(class UAthenaBroadcastHUDMenuStatusBase* HUDMenuStatusWidget);
};


// Class FortniteUI.AthenaBroadcastKillFeedBase
// 0x0028 (0x0290 - 0x0268)
class UAthenaBroadcastKillFeedBase : public UFortHUDElementWidget
{
public:
	class UFortDynamicEntryBox*                        KillFeedEntryBox;                                         // 0x0268(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              TimeToShowEntry;                                          // 0x0270(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1C];                                      // 0x0274(0x001C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastKillFeedBase");
		return ptr;
	}


	void OnToggleShowKillFeed(bool bShowKillFeed);
	void OnTimelineScrubbed();
	void AddKillFeedEntry(struct FAthenaBroadcastKillFeedEntryInfo KillFeedEntryInfo);
};


// Class FortniteUI.AthenaBroadcastKillFeedItemBase
// 0x0008 (0x0270 - 0x0268)
class UAthenaBroadcastKillFeedItemBase : public UFortHUDElementWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0268(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastKillFeedItemBase");
		return ptr;
	}


	void SetKillFeedInfo(struct FAthenaBroadcastKillFeedEntryInfo KillFeedEntryInfo);
};


// Class FortniteUI.AthenaBroadcastMapPanelBase
// 0x0000 (0x0348 - 0x0348)
class UAthenaBroadcastMapPanelBase : public UFortActivatablePanel
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastMapPanelBase");
		return ptr;
	}


	void OnMapIconAdded(class UFortSpectateClickableMapIcon* MapIconIn);
};


// Class FortniteUI.AthenaBroadcastMatchStatusWidget
// 0x0008 (0x0270 - 0x0268)
class UAthenaBroadcastMatchStatusWidget : public UFortHUDElementWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0268(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastMatchStatusWidget");
		return ptr;
	}


	void OnStormPhaseChanged(int StormPhase);
};


// Class FortniteUI.AthenaBroadcastPlayerEventScoreWidget
// 0x0010 (0x0278 - 0x0268)
class UAthenaBroadcastPlayerEventScoreWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                            PlayerEventScoreText;                                     // 0x0268(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonWidgetSwitcher*                       PlayerEventScoreSwitcher;                                 // 0x0270(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastPlayerEventScoreWidget");
		return ptr;
	}


	void OnRemoteClientEventScoreChanged(int NewEventScore);
};


// Class FortniteUI.AthenaBroadcastPlayerLocationWidget
// 0x0008 (0x0270 - 0x0268)
class UAthenaBroadcastPlayerLocationWidget : public UFortHUDElementWidget
{
public:
	class UCommonTextBlock*                            PlayerLocationText;                                       // 0x0268(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastPlayerLocationWidget");
		return ptr;
	}


	void OnRemoteClientPoiTagIDChanged(int16_t RemoteClientPoiTagID);
};


// Class FortniteUI.AthenaEventMatchSquadWidgetBase
// 0x0008 (0x0240 - 0x0238)
class UAthenaEventMatchSquadWidgetBase : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class UAthenaRemoteSquadViewData>   SquadData;                                                // 0x0238(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaEventMatchSquadWidgetBase");
		return ptr;
	}


	void SetStormcapDamageVisible(bool InVisible);
	void SetSquadIdVisible(bool bSquadIdVisible);
	void OnSquadPlaceChanged(class UAthenaRemoteSquadViewData* InSquadData, int InSquadPlace);
	void OnSquadKillscoreChanged(class UAthenaRemoteSquadViewData* InSquadData, int InSquadKills);
	void OnSquadIdChanged(class UAthenaRemoteSquadViewData* InSquadData, unsigned char InSquadId);
	void OnSquadColorChanged(class UAthenaRemoteSquadViewData* InSquadData, struct FLinearColor InSquadColor);
	void OnPlayerAdded(class UAthenaRemoteSquadViewData* InSquadData, class UAthenaRemotePlayerViewData* InPlayerData);
};


// Class FortniteUI.AthenaBroadcastSquadStatusWidget
// 0x0028 (0x0268 - 0x0240)
class UAthenaBroadcastSquadStatusWidget : public UAthenaEventMatchSquadWidgetBase
{
public:
	struct FUniqueNetIdRepl                            FollowedPlayerUID;                                        // 0x0240(0x0028) (BlueprintVisible, BlueprintReadOnly)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaBroadcastSquadStatusWidget");
		return ptr;
	}


	void OnPipModeChanged(bool bPipModeEnabled);
	void OnFollowedPlayerChanged();
	void HandleFollowedPlayerChanged(class AFortPlayerControllerSpectating* SpectatorController, class AFortPlayerState* NewFollowedPlayer);
};


// Class FortniteUI.AthenaChallengeCountdownDisplay
// 0x0090 (0x02C0 - 0x0230)
class UAthenaChallengeCountdownDisplay : public UUserWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0230(0x0010) MISSED OFFSET
	ECountdownDisplay                                  DisplayType;                                              // 0x0240(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0241(0x0007) MISSED OFFSET
	struct FTimerDisplayData                           DisplayData[0x2];                                         // 0x0248(0x0038) (Edit, DisableEditOnInstance)
	class UCommonTextBlock*                            Text_TimeRemaining;                                       // 0x02B8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeCountdownDisplay");
		return ptr;
	}


	void OnChallengeSet(struct FTimerDisplayData DisplayStyle);
};


// Class FortniteUI.AthenaChallengeDetailBase
// 0x0010 (0x0248 - 0x0238)
class UAthenaChallengeDetailBase : public UCommonUserWidget
{
public:
	class UFortItemBaseWidget*                         ItemInfo_PreviewedItem;                                   // 0x0238(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class USizeBox*                                    SB_MainContent;                                           // 0x0240(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeDetailBase");
		return ptr;
	}

};


// Class FortniteUI.AthenaChallengeDetailImageGrid
// 0x00A0 (0x02E8 - 0x0248)
class UAthenaChallengeDetailImageGrid : public UAthenaChallengeDetailBase
{
public:
	unsigned char                                      UnknownData00[0x78];                                      // 0x0248(0x0078) MISSED OFFSET
	class UUniformGridPanel*                           Grid_Image;                                               // 0x02C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UClass*                                      EntryWidgetClass;                                         // 0x02C8(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                CurrentFocusedSlot;                                       // 0x02D0(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x02D4(0x0004) MISSED OFFSET
	TArray<struct FString>                             QuestIds;                                                 // 0x02D8(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeDetailImageGrid");
		return ptr;
	}


	void OnOwnedToCompleteTransitions(int Count, float TimeOffset, float AdditionalTime);
	void OnLockedToOwnedTransitions(int Count, float TimeOffset, float AdditionalTime);
};


// Class FortniteUI.AthenaChallengeDetailList
// 0x0020 (0x0268 - 0x0248)
class UAthenaChallengeDetailList : public UAthenaChallengeDetailBase
{
public:
	bool                                               bSkipItemDisplay;                                         // 0x0248(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x17];                                      // 0x0249(0x0017) MISSED OFFSET
	class UAthenaChallengeSetListView*                 ChallengeListView_SetContents;                            // 0x0260(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeDetailList");
		return ptr;
	}

};


// Class FortniteUI.AthenaChallengeDisplayData
// 0x0138 (0x0168 - 0x0030)
class UAthenaChallengeDisplayData : public UDataAsset
{
public:
	int                                                SoonDisplayMinuteThreshold;                               // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                PartyAssistFontColor;                                     // 0x0034(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                DifficultChallengeFontColor;                              // 0x0044(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
	class UTexture2D*                                  PartyAssistIcon;                                          // 0x0058(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  ExternalPartyAssistIcon;                                  // 0x0060(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FFortChallengeSetStyle                      DefaultChallengeStyle;                                    // 0x0068(0x0080) (Edit)
	struct FFortChallengeSetStyle                      DailyChallengeStyle;                                      // 0x00E8(0x0080) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeDisplayData");
		return ptr;
	}

};


// Class FortniteUI.AthenaChallengeDisplayLibrary
// 0x0000 (0x0028 - 0x0028)
class UAthenaChallengeDisplayLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeDisplayLibrary");
		return ptr;
	}


	struct FLinearColor STATIC_GetChallengeStyleLightAccentColor(struct FFortChallengeSetStyle DisplayStyle);
	void STATIC_ApplyChallengeSetStyleColorsToMaterial(struct FFortChallengeSetStyle DisplayStyle, class UMaterialInstanceDynamic* StyleMaterial);
	void STATIC_ApplyChallengeSetStyleColorsToImageMaterial(struct FFortChallengeSetStyle DisplayStyle, class UImage* ImageWidget);
};


// Class FortniteUI.ImageGridObject
// 0x0018 (0x0040 - 0x0028)
class UImageGridObject : public UObject
{
public:
	int                                                GridLocation;                                             // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	class UFortChallengeBundleItemDefinition*          BundleData;                                               // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData)
	class UFortQuestItem*                              QuestItem;                                                // 0x0038(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.ImageGridObject");
		return ptr;
	}

};


// Class FortniteUI.AthenaChallengeImageGridEntry
// 0x0048 (0x0B90 - 0x0B48)
class UAthenaChallengeImageGridEntry : public UCommonButton
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0B48(0x0018) MISSED OFFSET
	class UCommonLazyImage*                            Image_Brush;                                              // 0x0B60(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bSelected;                                                // 0x0B68(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0B69(0x0003) MISSED OFFSET
	int                                                GridLocation;                                             // 0x0B6C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                Column;                                                   // 0x0B70(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	int                                                Row;                                                      // 0x0B74(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x18];                                      // 0x0B78(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeImageGridEntry");
		return ptr;
	}


	void TransitionFromOwnedToCompletedState();
	void TransitionFromLockedToOwnedState();
	void SetupLockedToOwnState();
	void OnChallengeSet(bool bIsComplete, bool bIsLocked);
};


// Class FortniteUI.AthenaChallengeInfoPanelEntry
// 0x0028 (0x0260 - 0x0238)
class UAthenaChallengeInfoPanelEntry : public UCommonUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0238(0x0008) MISSED OFFSET
	class UImage*                                      Image_AssistIcon;                                         // 0x0240(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonRichTextBlock*                        RichText_AssistTarget;                                    // 0x0248(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonRichTextBlock*                        RichText_ChallengeDesc;                                   // 0x0250(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaChallengeProgressBar*                 ChallengeProgress_ObjectivesCompleted;                    // 0x0258(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeInfoPanelEntry");
		return ptr;
	}


	void OnLocalPlayerMissingAssistedChallenge();
	void OnChallengeInfoSet();
	void HandleQuestsUpdated();
};


// Class FortniteUI.AthenaChallengeInfoPanel
// 0x0058 (0x0290 - 0x0238)
class UAthenaChallengeInfoPanel : public UCommonUserWidget
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0238(0x0010) MISSED OFFSET
	EChallengeInfoPage                                 CurrentPage;                                              // 0x0248(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0249(0x0007) MISSED OFFSET
	struct FDataTableRowHandle                         CyclePagesInputAction;                                    // 0x0250(0x0010) (Edit)
	int                                                MaxSuggestedEntries;                                      // 0x0260(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0264(0x0004) MISSED OFFSET
	TArray<TWeakObjectPtr<class UFortPartyMember>>     PartyMembersWithAssistedChallenges;                       // 0x0268(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0278(0x0008) MISSED OFFSET
	class UCommonTextBlock*                            Text_DisplayedChallengeTypes;                             // 0x0280(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDynamicEntryBox*                            EntryBox_Challenges;                                      // 0x0288(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeInfoPanel");
		return ptr;
	}


	void HandleQuestsUpdatedInGame();
	void HandleCycleQuestsInputAction(bool* bPassThrough);
};


// Class FortniteUI.AthenaInGameChallengeInfoPanel
// 0x0020 (0x0258 - 0x0238)
class UAthenaInGameChallengeInfoPanel : public UCommonUserWidget
{
public:
	int                                                TotalMaxEntries;                                          // 0x0238(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x023C(0x0004) MISSED OFFSET
	class UAthenaChallengeInfoPanel*                   ChallengeInfo_PartyAssist;                                // 0x0240(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaChallengeInfoPanel*                   ChallengeInfo_Daily;                                      // 0x0248(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaChallengeInfoPanel*                   ChallengeInfo_Suggested;                                  // 0x0250(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaInGameChallengeInfoPanel");
		return ptr;
	}

};


// Class FortniteUI.AthenaChallengeRewardDisplayEntry
// 0x0010 (0x0240 - 0x0230)
class UAthenaChallengeRewardDisplayEntry : public UUserWidget
{
public:
	class UFortLazyImage*                              LazyImage_RewardIcon;                                     // 0x0230(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonTextBlock*                            Text_RewardQuantity;                                      // 0x0238(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeRewardDisplayEntry");
		return ptr;
	}

};


// Class FortniteUI.AthenaChallengeRewardDisplay
// 0x0010 (0x0240 - 0x0230)
class UAthenaChallengeRewardDisplay : public UUserWidget
{
public:
	class UDynamicEntryBox*                            EntryBox_Rewards;                                         // 0x0230(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      Image_CompletionIcon;                                     // 0x0238(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeRewardDisplay");
		return ptr;
	}

};


// Class FortniteUI.AthenaChallengeListEntryBase
// 0x0008 (0x0240 - 0x0238)
class UAthenaChallengeListEntryBase : public UCommonUserWidget
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0238(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeListEntryBase");
		return ptr;
	}


	void StartHighlight();
	void EndHighlight();
};


// Class FortniteUI.AthenaChallengeTreeEntry_ChallengeSet
// 0x0020 (0x0260 - 0x0240)
class UAthenaChallengeTreeEntry_ChallengeSet : public UAthenaChallengeListEntryBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0240(0x0010) MISSED OFFSET
	class UCommonTextBlock*                            Text_ChallengeSetName;                                    // 0x0250(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonTextBlock*                            Text_ChallengeSetContext;                                 // 0x0258(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeTreeEntry_ChallengeSet");
		return ptr;
	}


	void OnChallengeSetEstablished(struct FFortChallengeSetStyle DisplayStyle);
};


// Class FortniteUI.AthenaChallengeListEntry_Challenge
// 0x0028 (0x0268 - 0x0240)
class UAthenaChallengeListEntry_Challenge : public UAthenaChallengeListEntryBase
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0240(0x0010) MISSED OFFSET
	bool                                               bHideProgressBar;                                         // 0x0250(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0251(0x0007) MISSED OFFSET
	class UCommonRichTextBlock*                        RichText_ChallengeDesc;                                   // 0x0258(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaChallengeProgressBar*                 ChallengeProgress_ObjectivesCompleted;                    // 0x0260(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeListEntry_Challenge");
		return ptr;
	}


	void OnPartyAssistEnabledChanged(bool bIsPartyAssistEnabled);
	void OnChallengeInfoSet(bool bIsComplete, bool bIsLocked, bool bCompact, bool HideRewards);
	int GetChallengeWeight();
};


// Class FortniteUI.AthenaChallengeListEntry_DetailedChallenge
// 0x0068 (0x02D0 - 0x0268)
class UAthenaChallengeListEntry_DetailedChallenge : public UAthenaChallengeListEntry_Challenge
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0268(0x0010) MISSED OFFSET
	bool                                               bHasAnyOptionsAvailable;                                  // 0x0278(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bIsDisplayingChallengeActions;                            // 0x0279(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x027A(0x0006) MISSED OFFSET
	struct FDataTableRowHandle                         BackAction;                                               // 0x0280(0x0010) (Edit)
	struct FDataTableRowHandle                         CloseChallengeOptionsAction;                              // 0x0290(0x0010) (Edit)
	class UWidgetAnimation*                            BoundAnim_ShowChallengeOptions;                           // 0x02A0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UButton*                                     SimpleButton_TopClickArea;                                // 0x02A8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaChallengeRewardDisplay*               Reward_QuestReward;                                       // 0x02B0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonButton*                               Button_PartyAssist;                                       // 0x02B8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonButton*                               Button_ReplaceChallenge;                                  // 0x02C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonRichTextBlock*                        RichText_ActionInfo;                                      // 0x02C8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeListEntry_DetailedChallenge");
		return ptr;
	}


	void HandleUpperAreaClicked();
	void HandleCloseChallengeOptionsInputAction(bool* bPassThrough);
};


// Class FortniteUI.AthenaChallengeListEntry_Header
// 0x0008 (0x0248 - 0x0240)
class UAthenaChallengeListEntry_Header : public UAthenaChallengeListEntryBase
{
public:
	class UCommonTextBlock*                            Text_SectionTitle;                                        // 0x0240(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeListEntry_Header");
		return ptr;
	}


	void OnSectionTypeSet(EChallengeListSection SectionType);
};


// Class FortniteUI.AthenaChallengeListEntry_CompletionReward
// 0x0018 (0x0258 - 0x0240)
class UAthenaChallengeListEntry_CompletionReward : public UAthenaChallengeListEntryBase
{
public:
	class UAthenaChallengeRewardDisplay*               Reward_CompletionReward;                                  // 0x0240(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonRichTextBlock*                        RichText_Description;                                     // 0x0248(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaChallengeProgressBar*                 ChallengeProgress_ObjectivesCompleted;                    // 0x0250(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeListEntry_CompletionReward");
		return ptr;
	}


	void OnRewardInfoSet(bool bIsCompleted, struct FFortChallengeSetStyle DisplayStyle);
};


// Class FortniteUI.AthenaChallengeListEntry_StoreOffer
// 0x0048 (0x0288 - 0x0240)
class UAthenaChallengeListEntry_StoreOffer : public UAthenaChallengeListEntryBase
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0240(0x0028) UNKNOWN PROPERTY: SoftClassProperty FortniteUI.AthenaChallengeListEntry_StoreOffer.OfferDetailsWidgetClass
	class UFortStoreFrontOfferInfo*                    OfferInfo;                                                // 0x0268(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UButton*                                     SimpleButton_ClickArea;                                   // 0x0270(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonRichTextBlock*                        RichText_Description;                                     // 0x0278(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFortLazyImage*                              LazyImage_SpecialOffer;                                   // 0x0280(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeListEntry_StoreOffer");
		return ptr;
	}


	void OnOfferSet();
	void HandleClicked();
};


// Class FortniteUI.AthenaChallengeListViewBase
// 0x00E8 (0x02F0 - 0x0208)
class UAthenaChallengeListViewBase : public UListViewBase
{
public:
	unsigned char                                      UnknownData00[0xE0];                                      // 0x0208(0x00E0) MISSED OFFSET
	float                                              EntrySpacing;                                             // 0x02E8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x02EC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeListViewBase");
		return ptr;
	}

};


// Class FortniteUI.AthenaChallengeProgressBar
// 0x0010 (0x0240 - 0x0230)
class UAthenaChallengeProgressBar : public UUserWidget
{
public:
	class UProgressBar*                                ProgressBar_StepsCompleted;                               // 0x0230(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UCommonRichTextBlock*                        RichText_Progress;                                        // 0x0238(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeProgressBar");
		return ptr;
	}

};


// Class FortniteUI.ChallengeScreenCategoryTab
// 0x0010 (0x0B58 - 0x0B48)
class UChallengeScreenCategoryTab : public UCommonButton
{
public:
	class UCommonTextBlock*                            Text_TabName;                                             // 0x0B48(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0B50(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.ChallengeScreenCategoryTab");
		return ptr;
	}

};


// Class FortniteUI.AthenaChallengeScreen
// 0x00C0 (0x03E0 - 0x0320)
class UAthenaChallengeScreen : public UCommonActivatablePanel
{
public:
	class UClass*                                      DefaultDetailsWidgetClass;                                // 0x0320(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FDetailClassEntry>                   DetailWidgestClasses;                                     // 0x0328(0x0010) (Edit, ZeroConstructor)
	struct FDataTableRowHandle                         NextCategoryInputAction;                                  // 0x0338(0x0010) (Edit)
	struct FDataTableRowHandle                         PrevCategoryInputAction;                                  // 0x0348(0x0010) (Edit)
	TArray<class UAthenaChallengeSetBaseDetails*>      CreatedDetailWidgets;                                     // 0x0358(0x0010) (ExportObject, ZeroConstructor, Transient)
	class UAthenaChallengeSetBaseDetails*              ActiveDetailsWidget;                                      // 0x0368(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UAthenaChallengeScreenTileBase*              LastSelectedTile;                                         // 0x0370(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0378(0x0008) MISSED OFFSET
	class UCommonButtonGroup*                          TabButtonGroup;                                           // 0x0380(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x28];                                      // 0x0388(0x0028) MISSED OFFSET
	class UDynamicEntryBox*                            EntryBox_SectionTabs;                                     // 0x03B0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UScrollBox*                                  ScrollBox_Sections;                                       // 0x03B8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDynamicEntryBox*                            EntryBox_EventChallenges;                                 // 0x03C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UAthenaChallengeScreenTile_Daily*            ChallengeTile_Dailies;                                    // 0x03C8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDynamicEntryBox*                            EntryBox_WeeklyChallenges;                                // 0x03D0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UDynamicEntryBox*                            EntryBox_StyleChallenges;                                 // 0x03D8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.AthenaChallengeScreen");
		return ptr;
	}


	bool IsPartyAssistedChallengeSet();
	void HandleTabSelectionChanged(class UCommonButton* TabButton, int TabIdx);
	void HandleTabClicked(class UCommonButton* TabButton, int TabIdx);
	void HandlePrevCategoryAction(bool* bPassThrough);
	void HandleNextCategoryAction(bool* bPassThrough);
	void HandleDetailsDeactivated(class UCommonActivatablePanel* DetailsPanel);
};


// Class FortniteUI.FortActivatablePanelWithItemPreview
// 0x0110 (0x0458 - 0x0348)
class UFortActivatablePanelWithItemPreview : public UFortActivatablePanel
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0348(0x0008) MISSED OFFSET
	class UFortItemView*                               ItemViewObject;                                           // 0x0350(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FDataTableRowHandle                         ItemViewUnifiedSupportsCameraControlInputAction;          // 0x0358(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ItemViewUnifiedZoomInputAction;                           // 0x0368(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ItemViewZoomOutInputAction;                               // 0x0378(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ItemViewZoomInInputAction;                                // 0x0388(0x0010) (Edit, DisableEditOnInstance)
	struct FDataTableRowHandle                         ItemViewRotateInputAction;                                // 0x0398(0x0010) (Edit, DisableEditOnInstance)
	unsigned char                                      UnknownData01[0x88];                                      // 0x03A8(0x0088) MISSED OFFSET
	bool                                               AllowItemRotation;                                        // 0x0430(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AllowItemZooming;                                         // 0x0431(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AutomaticallyRegisterCameraView;                          // 0x0432(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0x5];                                       // 0x0433(0x0005) MISSED OFFSET
	class UDataTable*                                  ActionDataTable;                                          // 0x0438(0x0008) (ZeroConstructor, IsPlainOldData)
	class UWidgetAnimation*                            AnimationToHideItemInfo;                                  // 0x0440(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAutoShowDetails;                                         // 0x0448(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bItemDetailsHidden;                                       // 0x0449(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x044A(0x0002) MISSED OFFSET
	float                                              HideItemInfoHeaderDurationSecs;                           // 0x044C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x8];                                       // 0x0450(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FortniteUI.FortActivatablePanelWithItemPreview");
		return ptr;
	}


	void ShowItemDetails();
	void OnVaultItemsViewed(TArray<class UFortItem*> Items);
	void OnItemPreviewChanged(class AActor* NewPrefab, class UFortItem* NewItem);
