#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0x21 (0x21 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.NewStatUpdate1Pulse
struct UAthenaEventMatchStatusScreen_C_NewStatUpdate1Pulse_Params
{
public:
	class UAthenaEventMatchStatusText_C*         TargetWidget;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  InText;                                            // 0x8(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                         SkipTextUpdate;                                    // 0x20(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x21 (0x21 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.NewStatUpdate3Pulse
struct UAthenaEventMatchStatusScreen_C_NewStatUpdate3Pulse_Params
{
public:
	class UAthenaEventMatchStatusText_C*         TargetWidget;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  InText;                                            // 0x8(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                         SkipTextUpdate;                                    // 0x20(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x20 (0x20 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.NewTopScore
struct UAthenaEventMatchStatusScreen_C_NewTopScore_Params
{
public:
	class UAthenaEventMatchStatusText_C*         TargetWidget;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  InText;                                            // 0x8(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// 0x20 (0x20 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.NewTopPlayer
struct UAthenaEventMatchStatusScreen_C_NewTopPlayer_Params
{
public:
	class UAthenaMatchStatusTextPlayer_C*        TargetWidget;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  InText;                                            // 0x8(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateSupplyDropsLootedText
struct UAthenaEventMatchStatusScreen_C_UpdateSupplyDropsLootedText_Params
{
public:
	//class FText                                SupplyDropsLootedText;                             // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x0 (0x0 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.Construct
struct UAthenaEventMatchStatusScreen_C_Construct_Params
{
public:
};

// 0x30 (0x30 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateFastestKillText
struct UAthenaEventMatchStatusScreen_C_UpdateFastestKillText_Params
{
public:
	//class FText                                FastestKillText;                                   // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	//class FText                                FastestKillTime;                                   // 0x18(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateShotsFiredText
struct UAthenaEventMatchStatusScreen_C_UpdateShotsFiredText_Params
{
public:
	//class FText                                ShotsFiredText;                                    // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateMostKillsText
struct UAthenaEventMatchStatusScreen_C_UpdateMostKillsText_Params
{
public:
	//class FText                                MostKillsText;                                     // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdatePiecesDestroyedText
struct UAthenaEventMatchStatusScreen_C_UpdatePiecesDestroyedText_Params
{
public:
	//class FText                                PiecesDestroyedText;                               // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateCircleRadiusText
struct UAthenaEventMatchStatusScreen_C_UpdateCircleRadiusText_Params
{
public:
	//class FText                                CircleRadiusText;                                  // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdatePiecesBuiltText
struct UAthenaEventMatchStatusScreen_C_UpdatePiecesBuiltText_Params
{
public:
	//class FText                                PiecesBuiltText;                                   // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateMatchTimeText
struct UAthenaEventMatchStatusScreen_C_UpdateMatchTimeText_Params
{
public:
	//class FText                                MatchTimeText;                                     // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateLongestEliminationText
struct UAthenaEventMatchStatusScreen_C_UpdateLongestEliminationText_Params
{
public:
	//class FText                                LongestEliminationText;                            // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateDamageTakenText
struct UAthenaEventMatchStatusScreen_C_UpdateDamageTakenText_Params
{
public:
	//class FText                                DamageTakenText;                                   // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateDamageHealedText
struct UAthenaEventMatchStatusScreen_C_UpdateDamageHealedText_Params
{
public:
	//class FText                                DamageHealedText;                                  // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateDamageInflictedText
struct UAthenaEventMatchStatusScreen_C_UpdateDamageInflictedText_Params
{
public:
	//class FText                                DamageInflictedText;                               // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateChestsLootedText
struct UAthenaEventMatchStatusScreen_C_UpdateChestsLootedText_Params
{
public:
	//class FText                                ChestsLootedText;                                  // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateMostKillsScore
struct UAthenaEventMatchStatusScreen_C_UpdateMostKillsScore_Params
{
public:
	//class FText                                MostKillsScore;                                    // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateLongestEliminationScore
struct UAthenaEventMatchStatusScreen_C_UpdateLongestEliminationScore_Params
{
public:
	//class FText                                LongestEliminationScore;                           // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateGamePhaseTimeText
struct UAthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeText_Params
{
public:
	//class FText                                GamePhaseTimeText;                                 // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateGamePhaseTimeTitleText
struct UAthenaEventMatchStatusScreen_C_UpdateGamePhaseTimeTitleText_Params
{
public:
	//class FText                                GamePhaseTimeTitleText;                            // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdatePlayersRemainingText
struct UAthenaEventMatchStatusScreen_C_UpdatePlayersRemainingText_Params
{
public:
	//class FText                                PlayersRemainingText;                              // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateTimeSinceLastKillText
struct UAthenaEventMatchStatusScreen_C_UpdateTimeSinceLastKillText_Params
{
public:
	//class FText                                TimeSinceLastKillText;                             // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x18 (0x18 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.UpdateGamePhaseText
struct UAthenaEventMatchStatusScreen_C_UpdateGamePhaseText_Params
{
public:
	//class FText                                GamePhaseText;                                     // 0x0(0x18)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};

// 0x9 (0x9 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.OnPlayerDeadStateChanged_BP
struct UAthenaEventMatchStatusScreen_C_OnPlayerDeadStateChanged_BP_Params
{
public:
	//class UAthenaRemotePlayerViewData*         InPlayerData;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	//bool                                       bInIsDead;                                         // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2F9 (0x2F9 - 0x0)
// Function AthenaEventMatchStatusScreen.AthenaEventMatchStatusScreen_C.ExecuteUbergraph_AthenaEventMatchStatusScreen
struct UAthenaEventMatchStatusScreen_C_ExecuteUbergraph_AthenaEventMatchStatusScreen_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B12[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue;              // 0x8(0x18)()
	class FText                                  K2Node_Event_DamageHealedText;                     // 0x20(0x18)(ConstParm)
	class FText                                  K2Node_Event_DamageInflictedText;                  // 0x38(0x18)(ConstParm)
	int32                                        Temp_int_Loop_Counter_Variable;                    // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Array_Index_Variable;                     // 0x58(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B13[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Event_ChestsLootedText;                     // 0x60(0x18)(ConstParm)
	int32                                        Temp_int_Array_Index_Variable1;                    // 0x78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable1;                   // 0x7C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue1;                  // 0x80(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B14[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Event_DamageTakenText;                      // 0x88(0x18)(ConstParm)
	class FText                                  K2Node_Event_LongestEliminationText;               // 0xA0(0x18)(ConstParm)
	class FText                                  K2Node_Event_MatchTimeText;                        // 0xB8(0x18)(ConstParm)
	class FText                                  K2Node_Event_MostKillsScore;                       // 0xD0(0x18)(ConstParm)
	class FText                                  K2Node_Event_PiecesBuiltText;                      // 0xE8(0x18)(ConstParm)
	class FText                                  K2Node_Event_LongestEliminationScore;              // 0x100(0x18)(ConstParm)
	class FText                                  K2Node_Event_GamePhaseTimeText;                    // 0x118(0x18)(ConstParm)
	class FText                                  K2Node_Event_CircleRadiusText;                     // 0x130(0x18)(ConstParm)
	class FText                                  K2Node_Event_GamePhaseTimeTitleText;               // 0x148(0x18)(ConstParm)
	class FText                                  K2Node_Event_PiecesDestroyedText;                  // 0x160(0x18)(ConstParm)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue1;             // 0x178(0x18)()
	class FText                                  K2Node_Event_MostKillsText;                        // 0x190(0x18)(ConstParm)
	class FText                                  K2Node_Event_PlayersRemainingText;                 // 0x1A8(0x18)(ConstParm)
	class FText                                  K2Node_Event_TimeSinceLastKillText;                // 0x1C0(0x18)(ConstParm)
	class FText                                  K2Node_Event_GamePhaseText;                        // 0x1D8(0x18)(ConstParm)
	int32                                        Temp_int_Loop_Counter_Variable2;                   // 0x1F0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue2;                  // 0x1F4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaMatchStatusTextPlayer_C*> K2Node_MakeArray_Array;                            // 0x1F8(0x10)(ZeroConstructor, ReferenceParm)
	class FText                                  K2Node_Event_ShotsFiredText;                       // 0x208(0x18)(ConstParm)
	class UAthenaMatchStatusTextPlayer_C*        CallFunc_Array_Get_Item;                           // 0x220(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue;                 // 0x228(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Array_Index_Variable2;                    // 0x22C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_IntInt_ReturnValue;                  // 0x230(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3B15[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaRemotePlayerViewData*           K2Node_Event_InPlayerData;                         // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_Event_bInIsDead;                            // 0x240(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x241(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3B16[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CallFunc_GetPlayerName_ReturnValue;                // 0x248(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_StringToText_ReturnValue;            // 0x258(0x18)()
	class FText                                  K2Node_Event_FastestKillText;                      // 0x270(0x18)(ConstParm)
	class FText                                  K2Node_Event_FastestKillTime;                      // 0x288(0x18)(ConstParm)
	TArray<class UAthenaMatchStatusTextPlayer_C*> K2Node_MakeArray_Array1;                           // 0x2A0(0x10)(ZeroConstructor, ReferenceParm)
	class UAthenaMatchStatusTextPlayer_C*        CallFunc_Array_Get_Item1;                          // 0x2B0(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue1;                // 0x2B8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_IntInt_ReturnValue1;                 // 0x2BC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue;          // 0x2BD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3B17[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Event_SupplyDropsLootedText;                // 0x2C0(0x18)(ConstParm)
	TArray<class UAthenaEventMatchStatusText_C*> K2Node_MakeArray_Array2;                           // 0x2D8(0x10)(ZeroConstructor, ReferenceParm)
	int32                                        CallFunc_Array_Length_ReturnValue2;                // 0x2E8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B18[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAthenaEventMatchStatusText_C*         CallFunc_Array_Get_Item2;                          // 0x2F0(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_IntInt_ReturnValue2;                 // 0x2F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
