#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

namespace SDK
{
// 0x1720 (0x1B40 - 0x420)
// AnimBlueprintGeneratedClass Taker_AnimBP.Taker_AnimBP_C
class UTaker_AnimBP_C : public UFortAIAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x420(0x8)(Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_082798314030DE3ADC83F8BFBDF82566; // 0x428(0x40)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AB1968FA485DED492784FBAA44D0A1E2; // 0x468(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1C22CB6042C4ACE738B397BF0A769E69; // 0x4B0(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E8E5FB4F42C60B65BE04B4ADB41DDCC0; // 0x4F8(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_83B2C1F64258D21959A8A7AB6E6D2EE3; // 0x540(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_37AD8F234C1F6676446A4B87E5A69EDC; // 0x588(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3F394D2148E0AA26A12918A2BF8D3A6C; // 0x5D0(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7534B51C474595A7E43B13ABBFD64C92; // 0x618(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_62138F6D41FD47E4B091A987F65B9FFF; // 0x660(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CA5FAB9A443DFAA3403AC5A4DC6E9AF5; // 0x6A8(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_84F4C05B4EB44B368F15C2A7CB263C01; // 0x6F0(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C24F0C5C45985D1DE37BD987E65DB2FB; // 0x738(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_71F1304C4202A3C228F7C5ACF578B960; // 0x780(0x48)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9DA1AC5749F1BCF282CFF09CF9C15E1E; // 0x7C8(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B1307EAF4B36A5ECA8F203A314EBA756; // 0x810(0xA0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_E8835F914BDA37D92D2C2A9BD0CC7E51; // 0x8B0(0x40)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_526956A3469075583B291ABCDCFD61B7; // 0x8F0(0xA0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_BD8B6C7C4A7A1F57D0CF2A83E4E52094; // 0x990(0x40)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_5DD183DA454A3FA648D37583DB2732C2; // 0x9D0(0xE0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_8BFDA56D4310FC7E7ADAB7A1195A5CF1; // 0xAB0(0x40)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7CE326E146B92C62F0FFBB9C65813961; // 0xAF0(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3F6C1EB740A658BB0382CC8C4D532AD1; // 0xB38(0xA0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_DC0DC0FE4E16B286590B3E9DA9EDE26E; // 0xBD8(0x40)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_0401C841468F6FA1CDD2EBB5211879F4; // 0xC18(0x128)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_F1834F2345A439F8DDA126ABA8E0E159; // 0xD40(0x40)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3097796A41537D2807A93B81C8DB4147; // 0xD80(0xE0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_B5D00C784578EBBBAB905989F4A3D341; // 0xE60(0x40)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20D5258546E9A712D1D173ABFE336D7F; // 0xEA0(0xA0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_666A8E33485554E59E5684BF79196F43; // 0xF40(0x40)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0ED6257F493C4D50F519E6BB08CA6207; // 0xF80(0xA0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_D45ACEF64909D7A0E0CE649049D74A9A; // 0x1020(0x40)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A3DE956D488498157ECE789164689FF6; // 0x1060(0xA0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_4EC4851747233F066D31B0A1318773CF; // 0x1100(0x40)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B77264B64435B158CF01B5BAB9B72A42; // 0x1140(0xA0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_48BB50D44D4EB95F9C86D38AD61C2E06; // 0x11E0(0x40)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_76EB73E24CF8B38E78B3ED83A37BA680; // 0x1220(0x48)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_ACB6E68E4CD8809D8DFB92994CC36196; // 0x1268(0xA0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_5BE1FFE44FBAB0545D733694570344B5; // 0x1308(0x40)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_26E7129B45354DD811C95CAE5A809F1F; // 0x1348(0xA0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_A7AEE29E449BCCB9E25CABB38BE7762D; // 0x13E8(0x40)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_50BA35874D153B66A2EC479ABE631B0D; // 0x1428(0xE0)()
	struct FAnimNode_Root                        AnimGraphNode_StateResult_05CE871642AE940A56A25A83CA243DAB; // 0x1508(0x40)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_642E163D4DB3B3CFEAEF7AA4C89D7816; // 0x1548(0xE0)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_5F3E6AB94EDE21007A90139A6BABE189; // 0x1628(0x68)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_0A672CDA44838D47B63F9783E1696F29; // 0x1690(0xD8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4B1A1B9245586915A0D0179B03D0B0B1; // 0x1768(0x48)()
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_8BE7B37A49E801AE1CE909B6D4C11439; // 0x17B0(0xF8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_50D8A462467A44F737828F81AC7D8A60; // 0x18A8(0x48)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_836E043E49B8521592D08DAFE14101DB; // 0x18F0(0x68)()
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_313C0D2048DAF29EED46DFA9B7939785; // 0x1958(0x1E0)()
	float                                        LookAtAlpha;                                       // 0x1B38(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Time;                                              // 0x1B3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("Taker_AnimBP_C");
		return Clss;
	}

	void IsRunningFunc(bool* IsRunning, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void IsSprintingFunc(bool* IsSprinting, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_E8E5FB4F42C60B65BE04B4ADB41DDCC0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_83B2C1F64258D21959A8A7AB6E6D2EE3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_37AD8F234C1F6676446A4B87E5A69EDC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_3F394D2148E0AA26A12918A2BF8D3A6C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_7534B51C474595A7E43B13ABBFD64C92();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_62138F6D41FD47E4B091A987F65B9FFF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_CA5FAB9A443DFAA3403AC5A4DC6E9AF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_AB1968FA485DED492784FBAA44D0A1E2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_84F4C05B4EB44B368F15C2A7CB263C01();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_C24F0C5C45985D1DE37BD987E65DB2FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_71F1304C4202A3C228F7C5ACF578B960();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_9DA1AC5749F1BCF282CFF09CF9C15E1E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_7CE326E146B92C62F0FFBB9C65813961();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_1C22CB6042C4ACE738B397BF0A769E69();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_BlendSpacePlayer_0401C841468F6FA1CDD2EBB5211879F4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_TransitionResult_76EB73E24CF8B38E78B3ED83A37BA680();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Taker_AnimBP_AnimGraphNode_RotationOffsetBlendSpace_313C0D2048DAF29EED46DFA9B7939785();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_SleepingFullyBlended();
	void ExecuteUbergraph_Taker_AnimBP(int32 EntryPoint, bool CallFunc_NotEqual_FloatFloat_ReturnValue, float CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue, bool CallFunc_NotEqual_FloatFloat_ReturnValue1, float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue, bool CallFunc_BooleanOR_ReturnValue1, bool CallFunc_BooleanOR_ReturnValue2, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_NotEqual_FloatFloat_ReturnValue2, float CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue1, bool CallFunc_NotEqual_FloatFloat_ReturnValue3, float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1, bool CallFunc_BooleanOR_ReturnValue3, bool CallFunc_LessEqual_FloatFloat_ReturnValue1, bool CallFunc_BooleanOR_ReturnValue4, bool CallFunc_BooleanOR_ReturnValue5, bool CallFunc_NotEqual_FloatFloat_ReturnValue4, bool CallFunc_NotEqual_FloatFloat_ReturnValue5, bool CallFunc_Not_PreBool_ReturnValue1, bool CallFunc_BooleanOR_ReturnValue6, bool CallFunc_BooleanOR_ReturnValue7, bool CallFunc_BooleanOR_ReturnValue8, bool CallFunc_Greater_FloatFloat_ReturnValue1, bool CallFunc_Not_PreBool_ReturnValue2, float CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue2, float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue2, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue2, bool CallFunc_EqualEqual_ByteByte_ReturnValue1, bool CallFunc_Not_PreBool_ReturnValue3, bool CallFunc_Not_PreBool_ReturnValue4, float CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue3, bool CallFunc_BooleanAND_ReturnValue1, bool CallFunc_BooleanAND_ReturnValue2, float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue3, bool CallFunc_LessEqual_FloatFloat_ReturnValue3, bool CallFunc_EqualEqual_ByteByte_ReturnValue2, bool CallFunc_EqualEqual_ByteByte_ReturnValue3, bool CallFunc_Greater_FloatFloat_ReturnValue3, bool CallFunc_Not_PreBool_ReturnValue5, float CallFunc_GetInstanceTransitionCrossfadeDuration_ReturnValue4, bool CallFunc_EqualEqual_ByteByte_ReturnValue4, bool CallFunc_Not_PreBool_ReturnValue6, float CallFunc_GetRelevantAnimTimeRemaining_ReturnValue4, bool CallFunc_BooleanAND_ReturnValue3, bool CallFunc_LessEqual_FloatFloat_ReturnValue4, bool CallFunc_BooleanOR_ReturnValue9, bool CallFunc_EqualEqual_ByteByte_ReturnValue5, bool CallFunc_Not_PreBool_ReturnValue7, bool CallFunc_BooleanAND_ReturnValue4, bool CallFunc_EqualEqual_ByteByte_ReturnValue6, bool CallFunc_BooleanOR_ReturnValue10, bool CallFunc_BooleanAND_ReturnValue5, bool CallFunc_Not_PreBool_ReturnValue8, bool CallFunc_EqualEqual_ByteByte_ReturnValue7, bool CallFunc_Not_PreBool_ReturnValue9, bool CallFunc_BooleanAND_ReturnValue6, bool CallFunc_BooleanAND_ReturnValue7, float K2Node_Event_DeltaTimeX, class APawn* CallFunc_TryGetPawnOwner_ReturnValue, class AFortAIPawn* K2Node_DynamicCast_AsFort_AIPawn, bool K2Node_DynamicCast_bSuccess, float CallFunc_FInterpTo_ReturnValue, float CallFunc_FInterpTo_ReturnValue1);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
