#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

namespace SDK
{
// 0x108 (0x320 - 0x218)
// WidgetBlueprintGeneratedClass AthenaEventMatchStatus.AthenaEventMatchStatus_C
class UAthenaEventMatchStatus_C : public UAthenaEventMatchStatusBase
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x218(0x8)(Transient, DuplicateTransient)
	class UCommonTextBlock*                      ChestsLooted;                                      // 0x220(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      ChestsLootedTitleText;                             // 0x228(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      CircleRadius;                                      // 0x230(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      CircleRadiusTitleText;                             // 0x238(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      DamageHealed;                                      // 0x240(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      DamageHealedTitleText;                             // 0x248(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      DamageInflicted;                                   // 0x250(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      DamageInflictedTitleText;                          // 0x258(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      DamageTaken;                                       // 0x260(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      DamageTakenTitleText;                              // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      FastestElimination;                                // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      FastestEliminationTitleText;                       // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      GamePhase;                                         // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      GamePhaseTime;                                     // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      GamePhaseTimeTitleText;                            // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      GamePhaseTitleText;                                // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      LongestElimination;                                // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      LongestEliminationTitleText;                       // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      MatchTime;                                         // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      MatchTimeTitleText;                                // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      MostEliminations;                                  // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      MostEliminationsTitleText;                         // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      PiecesBuilt;                                       // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      PiecesBuiltTitleText;                              // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      PiecesDestroyed;                                   // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      PiecesDestroyedTitleText;                          // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      PlayersRemaining;                                  // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      PlayersRemainingTitleText;                         // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      ShotsFired;                                        // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      ShotsFiredTitleText;                               // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      SupplyDropsLooted;                                 // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                      SupplyDropsLootedTitleText;                        // 0x318(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("AthenaEventMatchStatus_C");
		return Clss;
	}

	void UpdateCircleRadiusText(class FText& CircleRadiusText);
	void Construct();
	void UpdateFastestKillText(class FText& FastestKillText);
	void UpdateSupplyDropsLootedText(class FText& SupplyDropsLootedText);
	void UpdateShotsFiredText(class FText& ShotsFiredText);
	void UpdatePiecesDestroyedText(class FText& PiecesDestroyedText);
	void UpdatePiecesBuiltText(class FText& PiecesBuiltText);
	void UpdateLongestEliminationText(class FText& LongestEliminationText);
	void UpdateDamageTakenText(class FText& DamageTakenText);
	void UpdateDamageHealedText(class FText& DamageHealedText);
	void UpdateDamageInflictedText(class FText& DamageInflictedText);
	void UpdateChestsLootedText(class FText& ChestsLootedText);
	void UpdateMostKillsText(class FText& MostKillsText);
	void UpdatePlayersRemainingText(class FText& PlayersRemainingText);
	void UpdateMatchTimeText(class FText& MatchTimeText);
	void UpdateGamePhaseTimeTitleText(class FText& GamePhaseTimeTitleText);
	void UpdateGamePhaseTimeText(class FText& GamePhaseTimeText);
	void UpdateGamePhaseText(class FText& GamePhaseText);
	void ExecuteUbergraph_AthenaEventMatchStatus(int32 EntryPoint, enum class ESlateVisibility Temp_byte_Variable, bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable1, enum class ESlateVisibility Temp_byte_Variable2, bool Temp_bool_Variable1, enum class ESlateVisibility Temp_byte_Variable3, enum class ESlateVisibility Temp_byte_Variable4, bool Temp_bool_Variable2, enum class ESlateVisibility Temp_byte_Variable5, enum class ESlateVisibility Temp_byte_Variable6, bool Temp_bool_Variable3, enum class ESlateVisibility Temp_byte_Variable7, enum class ESlateVisibility Temp_byte_Variable8, bool Temp_bool_Variable4, enum class ESlateVisibility Temp_byte_Variable9, enum class ESlateVisibility Temp_byte_Variable10, bool Temp_bool_Variable5, enum class ESlateVisibility Temp_byte_Variable11, enum class ESlateVisibility Temp_byte_Variable12, bool Temp_bool_Variable6, enum class ESlateVisibility Temp_byte_Variable13, enum class ESlateVisibility Temp_byte_Variable14, bool Temp_bool_Variable7, enum class ESlateVisibility Temp_byte_Variable15, enum class ESlateVisibility Temp_byte_Variable16, bool Temp_bool_Variable8, enum class ESlateVisibility Temp_byte_Variable17, enum class ESlateVisibility Temp_byte_Variable18, bool Temp_bool_Variable9, enum class ESlateVisibility Temp_byte_Variable19, enum class ESlateVisibility Temp_byte_Variable20, bool Temp_bool_Variable10, enum class ESlateVisibility Temp_byte_Variable21, enum class ESlateVisibility Temp_byte_Variable22, class FText K2Node_Event_CircleRadiusText, enum class ESlateVisibility Temp_byte_Variable23, bool CallFunc_TextIsEmpty_ReturnValue, bool Temp_bool_Variable11, enum class ESlateVisibility Temp_byte_Variable24, enum class ESlateVisibility Temp_byte_Variable25, bool Temp_bool_Variable12, enum class ESlateVisibility Temp_byte_Variable26, enum class ESlateVisibility Temp_byte_Variable27, class FText K2Node_Event_FastestKillText, class FText K2Node_Event_SupplyDropsLootedText, bool CallFunc_TextIsEmpty_ReturnValue1, bool CallFunc_TextIsEmpty_ReturnValue2, enum class ESlateVisibility K2Node_Select_Default, enum class ESlateVisibility K2Node_Select1_Default, bool Temp_bool_Variable13, enum class ESlateVisibility K2Node_Select2_Default, class FText K2Node_Event_ShotsFiredText, bool CallFunc_TextIsEmpty_ReturnValue3, enum class ESlateVisibility Temp_byte_Variable28, enum class ESlateVisibility K2Node_Select3_Default, class FText K2Node_Event_PiecesDestroyedText, bool CallFunc_TextIsEmpty_ReturnValue4, enum class ESlateVisibility K2Node_Select4_Default, enum class ESlateVisibility Temp_byte_Variable29, class FText K2Node_Event_PiecesBuiltText, bool CallFunc_TextIsEmpty_ReturnValue5, enum class ESlateVisibility K2Node_Select5_Default, bool Temp_bool_Variable14, class FText K2Node_Event_LongestEliminationText, bool CallFunc_TextIsEmpty_ReturnValue6, enum class ESlateVisibility K2Node_Select6_Default, enum class ESlateVisibility Temp_byte_Variable30, class FText K2Node_Event_DamageTakenText, bool CallFunc_TextIsEmpty_ReturnValue7, enum class ESlateVisibility K2Node_Select7_Default, enum class ESlateVisibility Temp_byte_Variable31, class FText K2Node_Event_DamageHealedText, bool CallFunc_TextIsEmpty_ReturnValue8, enum class ESlateVisibility K2Node_Select8_Default, bool Temp_bool_Variable15, class FText K2Node_Event_DamageInflictedText, bool CallFunc_TextIsEmpty_ReturnValue9, enum class ESlateVisibility K2Node_Select9_Default, enum class ESlateVisibility Temp_byte_Variable32, class FText K2Node_Event_ChestsLootedText, bool CallFunc_TextIsEmpty_ReturnValue10, enum class ESlateVisibility K2Node_Select10_Default, enum class ESlateVisibility Temp_byte_Variable33, bool Temp_bool_Variable16, class FText K2Node_Event_MostKillsText, class FText K2Node_Event_PlayersRemainingText, bool CallFunc_TextIsEmpty_ReturnValue11, bool CallFunc_TextIsEmpty_ReturnValue12, enum class ESlateVisibility K2Node_Select11_Default, enum class ESlateVisibility K2Node_Select12_Default, class FText K2Node_Event_MatchTimeText, class FText K2Node_Event_GamePhaseTimeTitleText, bool CallFunc_TextIsEmpty_ReturnValue13, bool CallFunc_TextIsEmpty_ReturnValue14, enum class ESlateVisibility K2Node_Select13_Default, enum class ESlateVisibility K2Node_Select14_Default, class FText K2Node_Event_GamePhaseTimeText, bool CallFunc_TextIsEmpty_ReturnValue15, enum class ESlateVisibility K2Node_Select15_Default, class FText K2Node_Event_GamePhaseText, bool CallFunc_TextIsEmpty_ReturnValue16, enum class ESlateVisibility K2Node_Select16_Default);
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
