#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
// 0xC (0xC - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.EndAnimations
struct UAthenaScoreboardPlayerWidget_C_EndAnimations_Params
{
public:
	float                                        CallFunc_GetEndTime_ReturnValue;                   // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetEndTime_ReturnValue1;                  // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetEndTime_ReturnValue2;                  // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.Construct
struct UAthenaScoreboardPlayerWidget_C_Construct_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.PlayerDied
struct UAthenaScoreboardPlayerWidget_C_PlayerDied_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.BndEvt__ScaleX_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature
struct UAthenaScoreboardPlayerWidget_C_BndEvt__ScaleX_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.BndEvt__Fade_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature
struct UAthenaScoreboardPlayerWidget_C_BndEvt__Fade_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.OnPlayerTakingDamage
struct UAthenaScoreboardPlayerWidget_C_OnPlayerTakingDamage_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.SetExtraInfoVisibility
struct UAthenaScoreboardPlayerWidget_C_SetExtraInfoVisibility_Params
{
public:
	//bool                                       bVisible;                                          // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.OnMovedToDeadList
struct UAthenaScoreboardPlayerWidget_C_OnMovedToDeadList_Params
{
public:
};

// 0x1 (0x1 - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.PreConstruct
struct UAthenaScoreboardPlayerWidget_C_PreConstruct_Params
{
public:
	//bool                                       IsDesignTime;                                      // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x4 (0x4 - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.UpdateScale
struct UAthenaScoreboardPlayerWidget_C_UpdateScale_Params
{
public:
	//float                                      Scale;                                             // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.OnPlayerStateChanged_BP
struct UAthenaScoreboardPlayerWidget_C_OnPlayerStateChanged_BP_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.OnScoreboardStateChanged
struct UAthenaScoreboardPlayerWidget_C_OnScoreboardStateChanged_Params
{
public:
};

// 0xAC (0xAC - 0x0)
// Function AthenaScoreboardPlayerWidget.AthenaScoreboardPlayerWidget_C.ExecuteUbergraph_AthenaScoreboardPlayerWidget
struct UAthenaScoreboardPlayerWidget_C_ExecuteUbergraph_AthenaScoreboardPlayerWidget_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EAthenaScoreboardPlayerState      Temp_byte_Variable;                                // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_50FE[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CallFunc_GetPlayerName_ReturnValue;                // 0x8(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_StringToText_ReturnValue;            // 0x18(0x18)()
	struct FLinearColor                          Temp_struct_Variable;                              // 0x30(0x10)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Temp_struct_Variable1;                             // 0x40(0x10)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Temp_struct_Variable2;                             // 0x50(0x10)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Temp_struct_Variable3;                             // 0x60(0x10)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Temp_struct_Variable4;                             // 0x70(0x10)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_Event_bVisible;                             // 0x80(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         K2Node_Event_IsDesignTime;                         // 0x81(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_50FF[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Conv_IntToFloat_ReturnValue;              // 0x84(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_Event_Scale;                                // 0x88(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue;           // 0x8C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable1;                               // 0x8D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESlateVisibility                  Temp_byte_Variable2;                               // 0x8E(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5100[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_MakeLiteralFloat_ReturnValue;             // 0x90(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue;            // 0x94(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESlateVisibility                  K2Node_Select_Default;                             // 0x98(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x99(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5101[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          K2Node_Select1_Default;                            // 0x9C(0x10)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
