#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x08)
#endif

namespace SDK
{
// 0x8068 (0x84F8 - 0x490)
// AnimBlueprintGeneratedClass B_MasterPetAnimBP.B_MasterPetAnimBP_C
class UB_MasterPetAnimBP_C : public UFortPetAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x490(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3508882A488C348C682D2AB4EE973C3F; // 0x498(0x20)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_867D04DC47BA94D7DEA91C96EFFE4566; // 0x4B8(0x108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7BF2D3A94E19F5372EBC608C6AB3509C; // 0x5C0(0x20)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_56A70D424F68916A2136839815AACD43; // 0x5E0(0xA0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_1A633F5A483AC2589FFBE8924C23B71A; // 0x680(0x1B0)()
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_30E6F08C447EE11B904754B74FD8BAE4; // 0x830(0x108)()
	uint8                                        Pad_6290[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_233E54E54DF3E18FC62070B8D8E7DDAF; // 0x940(0x1B0)()
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_959A256F4D79E3B3CAD12CA6BA507B29; // 0xAF0(0x1B0)()
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_D609AACB4566C6E5D4DF658CEC8DC957; // 0xCA0(0xF8)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3F25455949CD6D4F488639A7C0578DE9; // 0xD98(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9EEE7FF54BF3EF2379970C9DFB27B783; // 0xDC0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CC569A3A48D5BF6D7E9561809FB7507C; // 0xDE8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4E8F4F184D3020091816C48A32F29C20; // 0xE10(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A3E1B7004277B1DC316AD88B179D53A0; // 0xE38(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D0A001D146695ADA4F66A49BE450D2EF; // 0xE60(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4DBCC4D24F6EB54F49F3DE87DBBB287D; // 0xE88(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_82B475D4469BDC27A2946B99317CF493; // 0xEB0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_43F33C744F636208DF44F08C26811079; // 0xED8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1F9F78504C1289A6597D4E8B66079967; // 0xF00(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FDBCC58A4761ED438CF28D95DEC7ECB9; // 0xF28(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6C11FC3F435437BFF4FA2BA488B25B3C; // 0xF50(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5B6EEE81485CA97A56DAAC9FE53A35C1; // 0xF78(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A8C42C1C43870BCBE50539B831F2FC0A; // 0xFA0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4C9633984EA0D575EDBB6C8F26A46056; // 0xFC8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C8430A014E5B78AD85E06CBAB7B15914; // 0xFF0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7514C8CF49770043B15C23B4C927EF86; // 0x1018(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_82210A194B40E15FA43A619301B70453; // 0x1040(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E2459E454F3DBB082226D787DCD98246; // 0x1068(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F071BD8E401C5EF73B444E8FE6E1432E; // 0x1090(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_96918F294C70A605F5D518A4393C7A59; // 0x10B8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FBFDC612413FA58D3FBDBA8B345B3B4F; // 0x10E0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_EC2221094209FB5C379BA38F8E4E9616; // 0x1108(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4579C4A84242D4AD3B671AB822381564; // 0x1130(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F14A16914D858B30DE6581B858F96737; // 0x1158(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2E372EDF4F43D89B6F66A39B212693DB; // 0x1180(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FB1E810644AC9C9C92A8069A8447ACFE; // 0x11A8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9BB6CC2C45610DDD3462D3B7135EE985; // 0x11D0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C17FB2C042ED5148EE67BCBDE762EA8D; // 0x11F8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7CBEB93C4F2C6742FD47D6BF656222D8; // 0x1220(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6EBCC8244C820F4A0AFC9BA6D3C64A83; // 0x1248(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9957D07C4BCC5B4743E9F485CEF505EF; // 0x1270(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_778FAF8F4501FD9631EA048D36A2904C; // 0x1298(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0F6497A74BE60D6D042B129951EABCED; // 0x12C0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_56FA2D5849E5DA86D1F69B8E0D873B5B; // 0x12E8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E3D71B194C0824FFBAC5E18F8B3F9BEA; // 0x1310(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_30D56A7045F8386FC2A4749B09F888D9; // 0x1338(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C9627CB94B4E100465A51AA60F15A568; // 0x1360(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F96F5CF0431498E7FF27CA88020F48DF; // 0x1388(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F23BB46743AA2BDC4E2ECB9EF61C585F; // 0x13B0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_61954A0A4699492872CED699943DBDDA; // 0x13D8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_103E97084BEDC55077E09895F6311BC3; // 0x1400(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6A90FB6346D22C1F12EAE2A22A9E8B24; // 0x1428(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_DFC1CB4741240AFE69AF72AA3459328B; // 0x1450(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_87C0D8AC4172401A1A358A8C1625333A; // 0x1478(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_04F2E701473B58F01C9D34B22F26C78B; // 0x14A0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8D83DB1F4618A3FF1040318215B507F6; // 0x14C8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CB5DBC52483C8B156A128297A93A2148; // 0x14F0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1F60318943B0D4952850D69A3BE9EB68; // 0x1518(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8B8A639A4FF784B068E176B3C8AACD66; // 0x1540(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AAA7D5414ACA8EBF869794968CCEE36D; // 0x1568(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_88AF8A544D807BC727AC269CB84FDE87; // 0x1590(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_825EF8984AD291866212A3A2539657B2; // 0x15B8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_33878AF945936C2DCE99C7BE67A7C8A0; // 0x15E0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7114A146461635E27058C6826756B3A3; // 0x1608(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BE07B89C46CED3FA4C34328C2FC0915E; // 0x1630(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E69E14EB4D384F97622B8BBA160D7CEA; // 0x1658(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_435324E34B96F84AF62B34B21267C981; // 0x1680(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_EB9C430542CC317496516A8B140AB3C1; // 0x16A8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5E1B730D4144BCC759B50E813BCDA4A2; // 0x16D0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A3177200441F0C03F7B424BE621C49D8; // 0x16F8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3AF16AF044912646929AA6924172105B; // 0x1720(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E67109234544BC65EED30A9A1642AA40; // 0x1748(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3C816C0C48CA2CAFFBF09392A11667F5; // 0x1770(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6CAC1F174E39A8558A7873A2DC2E7413; // 0x1798(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_99F45175421EB3356E26B8A06E724D2E; // 0x17C0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F65B8F8B4EA13B381817A991C9BF82C3; // 0x17E8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_51E1D1F945DC3A5D3460FBB4728787C0; // 0x1810(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3E42652343F8DFC988AC80BFEC3EBD06; // 0x1838(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_79916F914C5245874C6F0DB872457DD9; // 0x1860(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AB8ED504480C940CA155CD9041710569; // 0x1888(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_31FE8CCE47D804C5C398BBB8BFEDDA10; // 0x18B0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8B18BAF7481968CD451812A261CA553A; // 0x18D8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_546302A7414F55FA4CD5E09590FB507A; // 0x1900(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3D40CC0844038BF414A5B39648510871; // 0x1928(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E0DEFD6D4A6F7885EF0C1ABF6CCDE727; // 0x1950(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4A84CC3044799396689AB3ADCB34CB39; // 0x1978(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_26F75DC34E25528CDE9BD68044889023; // 0x19A0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_018EA359483230BFE27EDEB87B180BF7; // 0x19C8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FE9887D54DE05D68FF6E8193A157347B; // 0x19F0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C92D4684474630F51E881A868D01004F; // 0x1A18(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AD3F8CF14BF25981B92FEDBD0BFD2EEC; // 0x1A40(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_91B3AB2449B3DF55BD1B94949AA87E5C; // 0x1A68(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1797A67541BF1D2A185033B66DD9A50B; // 0x1A90(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A5DFD59C40E28133906A00AFD5B5A463; // 0x1AB8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BAD5414A4E4B46AAD4C1E0B80695552A; // 0x1AE0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AE1E88ED4F598C7BB9533B8C261AD426; // 0x1B08(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FA414CAF4A591E3E1E04669DF6554028; // 0x1B30(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_94F014DA4AB0288AF41967ADD2885FBA; // 0x1B58(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8E22EA264F10A28D4352AE8A7E5DB66D; // 0x1B80(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16DD68AC4EA6A7F55D9C948EAC6ED5D5; // 0x1BA8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F4D8D0B645AA63A74801BE97D4F53E8D; // 0x1BD0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_317BAF5642F95B7FC01E98B718964F05; // 0x1BF8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E5B5AB244CD55AF7FB18CE844EA3BF78; // 0x1C20(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6371442F42E4B1D8484D98A29A006BAF; // 0x1C48(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8E0B96F741E011515D47A7A0C52B6374; // 0x1C70(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CFF8F5A84819691914207CA7A0C11E4B; // 0x1C98(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0B3B9A2D4BE0CBA7CBD64C93CAC407B9; // 0x1CC0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AC81C73244A224E684705297E1D7DE82; // 0x1CE8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9E2754D640022DD00B4C618375D7CDE8; // 0x1D10(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_77F7E6404230DEED3B6FC99E4C23388B; // 0x1D38(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_37AFD46B4436388CB73CBBB388C4B730; // 0x1D60(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5444B871493445CCD2D3F6A0906F2269; // 0x1D88(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_143B3ED1437CCE501DA31989B3D65447; // 0x1DB0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C4171D9B453D96AC61B864BB5BDC3504; // 0x1DD8(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_767C720C4B0F46C7B5E88CAC60B6CC27; // 0x1E00(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8D0871E44D0089411C1C57AE1D394F59; // 0x1E78(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_759AE1144059F1DDD9FCAF8F0D12CEB9; // 0x1EA8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_37D2853848C76D3BACA362852FE99E7F; // 0x1ED0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CDC32DFC4B34DC1305F257A181E171A1; // 0x1EF8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5517FFB44F2091618255689459128D34; // 0x1F20(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A3B89D5A405B50D8F8FDF1BADD169548; // 0x1F48(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D8F7C2FE45727625B471FB8B3F3F1B1E; // 0x1F70(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B26DBBED4B1DC722997A74AD6489AAC2; // 0x1F98(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F6A8C2C54FC607C07EEABFA90FFD6A03; // 0x2010(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4055AEEA4029D84353C7F69A08C48B84; // 0x2040(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7F99A2EA48EA40205095CF97F9D77D38; // 0x20B8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_ED0CD51E4B41C1CCC5D729B95A121C76; // 0x20E8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_B9AF436F4F751C860FCF1E95AF78A5EA; // 0x2160(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3DC22D454AE0F9A6A2E6D1B2E30E0B3C; // 0x2190(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_E60460D74B296392F4F52A8D473F2463; // 0x2208(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_77BD53804678888918A73BBFA6780B8E; // 0x2238(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F3EF14EF436EA16711108F8D5C732525; // 0x22B0(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_6A70C2A94AFAD18093D3F08A713BC55F; // 0x22E0(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_438F812641A5C6E0FEEC9FBCE017D6D8; // 0x2390(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_003A72F5448F0D2FFF7EFFBDF1B9C9A8; // 0x23C0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_D7FAE94041CEFC73601A60A2B9C51C7B; // 0x2438(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D5B3A00F48CA3C653F8831A2826F9539; // 0x2468(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7F057C054D590771EBD72D8CBE353D2F; // 0x24E0(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C0C432AF42E6D31C2BD8A8A06E3FA412; // 0x2510(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_430C390B461B5491A04B86BA18AD716E; // 0x2588(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3A4B96CB4F7C0C0D240ED580A17C0132; // 0x25B8(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_38E6BEEF4F58FE1C78E104BBD905A64E; // 0x2630(0x78)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_F073749E44356063C8B9A8BE43B3441D; // 0x26A8(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4B9EB06B4F3AF51B1AE62E9AB987ED5B; // 0x2770(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CBAA89FC405EAAE3ADC1D9AD6A454C86; // 0x27A0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3D39C01741A4E07019E7F696B7C268C9; // 0x27C8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2A9991354F4DD9552C9117B46106B9DB; // 0x2840(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E97DE0A04C9D25B8B9CC9AA5EADD82E0; // 0x2870(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_DD59A51741780FF3C6E3C7ADC04C4BF7; // 0x28E8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_49E621684BD77A9BE9EBF19555581061; // 0x2918(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_184808344C4FB360C041C3AAD6FBA756; // 0x2990(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D60EC2BD4C1A5B284A9CEA8EA5FDF73F; // 0x29C0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9F60C8DF45539AE8195DF9AECBB6FB6B; // 0x2A38(0x30)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_076145D841177FE702FF44AC029429D2; // 0x2A68(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FDF080EB48BE6C43B72DDEAC9F423EA1; // 0x2B30(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_797550C8473F18D27DAB7795081C9D00; // 0x2BA8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_D614B30348E903EBA7E0FEBF705DF35D; // 0x2C20(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5ECAC048431C2D961B7915A6FB57AF06; // 0x2C50(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5224940044727CE7EEBF04B8382EF4B5; // 0x2CC8(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B38EAB0C4D557D775DD2C288CA553A42; // 0x2CF8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_337AD4BD42461B7A716179B8D38E578E; // 0x2D20(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E23BF08048A8C1CEFBD5579E9B873083; // 0x2D48(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1D5DF91F4CDF4C7FFC4082938A20A8DD; // 0x2D70(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9016A59146ED25D6D669EF9B0FF57C19; // 0x2D98(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2343FEC94D496E1366D833A80D33907A; // 0x2DC0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0543C23146FEFF4573ED7FA91AEB42B1; // 0x2DE8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7FA5D7BF48964FBA07093E9B950C9BC6; // 0x2E60(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3B55535F499FD02CC6D69794614B7FD8; // 0x2E90(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1CB766F74C9A41AE6112D48FA6DD8ECB; // 0x2F08(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F294C20445338251E942AABAB891C1CA; // 0x2F38(0x78)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_EFDF482A45B50B16501522B6FBF9EBEF; // 0x2FB0(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8838C5AD48D9616F4BC4B0A8857E02DF; // 0x3078(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_60590863490D115EB63587B1F884E876; // 0x30F0(0x30)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_D95EB5AB4350EA6D5886779673635A4A; // 0x3120(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14416ED0420FF4E9A0EECAA6EA1C6315; // 0x31E8(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_00CBE43C44A964010B3806BF12959121; // 0x3260(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7F0F03F84DDBEBA0CF4E21829575DB4D; // 0x32D8(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_A69900AF499FF98AB4E444B906C697B3; // 0x3308(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_CCCAD31E43A3A5AB75A404B08C94329B; // 0x33B8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BEB46F4E403B886D8BD127B243D53201; // 0x33E8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8CC7992D4B1C7467CC319B8C03F72B87; // 0x3460(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2DF54CB340DD05A5CC7B53861D53F09F; // 0x3490(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_D5C9D48945DE543F1AE934A2BDC5817F; // 0x3508(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EA95D7614397C3E7B67B08BEE317633B; // 0x3538(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_D88C8AF448544C9657EC51A0974DC9CF; // 0x35B0(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5BC158314745659DD591F99676898FE2; // 0x35E0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4328A4F74AEEB4CCDC5552ABC03F9BBF; // 0x3658(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_782D16524EB383271A56568811EACC00; // 0x3688(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6D073FA240E82B3DDA2C4CB6B8D6E215; // 0x36B0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_604922BE4301607D4FABDB927C8D349A; // 0x36D8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_520D03D54D06BDE35D5229BA83812AD8; // 0x3750(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0F8BC8E64F992D9BCB82E4AB4D3C8860; // 0x3780(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8318D90D43CBDDD450734083ACBC100D; // 0x37A8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3A70705D47A491CD13CEAB81A7BC408D; // 0x37D0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9A12D7CD41B87BD06A7C67BA8AFFA9E6; // 0x37F8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8D6C0BC540CE31C962B8A88FC97C7215; // 0x3820(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_989D50E34C9AA3713BF5D0817C04B495; // 0x3848(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2D230A944A94E8D63EAB97AEBD4132C7; // 0x3870(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_78C4A455473378305B3468A77908A8EB; // 0x3898(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5E7D44724D6BB70202AAF59DD8441F52; // 0x38C0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CD32802F4AB92E458D1779B39E709F13; // 0x38E8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A11D0C064F1F915E76F6CF9404FCBCC2; // 0x3910(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_50FA14DB4401BFB1E138DDB83C324EE4; // 0x3938(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_46C18E1E4F91D8C511C6308B66CA84D7; // 0x3960(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4C2915A14EE6D4E124EE8D9F2403E393; // 0x39D8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9D6260614160FAC8A2EF5A89F6635C5C; // 0x3A08(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F68DB3594143FEFBBF9A588C386D5B63; // 0x3A80(0x30)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F90FC6574DD25092000D01A4D8DD4E8F; // 0x3AB0(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C4CFB14343D26BFA14031E895A0C6B2C; // 0x3AE0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_29CE63A24F06734C065425A17B4FACE6; // 0x3B08(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CB585D13434F85CC3F6DC0BA4565EAEE; // 0x3B30(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CA948E544639381918EC709138A4CD98; // 0x3B58(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2A91633B4854BB685B892393CE094D37; // 0x3B80(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3D86637B4906654792EEF99B1A159187; // 0x3BF8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_94D8C17B466EE6B6DD553B9F0953B9C0; // 0x3C28(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9B3B3194477D440B3D14CDA1169A4266; // 0x3CA0(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8AF0DE9143456542E15EEC82460E7D64; // 0x3CD0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_21CED2624E5E475BF8EF74BEFEC82E1D; // 0x3D48(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FD2DC75947DDFFD1B6775FAD4AAE4F0A; // 0x3D78(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F928D6A54975A4EA2817389C1B961EEC; // 0x3DA0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_91575AD24161FD6B4F5192B82906E955; // 0x3DC8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B35D90BE4B7DD42E2422FCBE34ED471D; // 0x3DF0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AA7A9C404CDA425634F318B526F92958; // 0x3E18(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5587236D42AA044D426D9690C583AF6B; // 0x3E40(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_317C21704A2A06793608B6B0B56FA6A0; // 0x3EB8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_22E76A884EF41F403265ED8704A1DD83; // 0x3EE8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_C997D61E4ED0727B2A5B70BC61965813; // 0x3F60(0x30)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_9DC343CD44ABA6EB0F2F7CB280AC85E9; // 0x3F90(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C6C351954EB2955C37DD2C9BE1AE3D73; // 0x4058(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5BC9CEB64D2961713BA757B10009E5CB; // 0x40D0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1D73652F4FDBDDC46725B0AD6008A566; // 0x4148(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4C222668449ABEA56E6C3FA24640502D; // 0x4178(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2549599A49A575EB17FF4ABEC382889A; // 0x41F0(0x78)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_D0A1A7CD4276F8E90AA172B8D4663297; // 0x4268(0xA0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_DCFFD576428EC8D8023A6DB0A23C975F; // 0x4308(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_AF8504474C6F37A0A8DAB4A6FA554952; // 0x43D0(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BB16EA7D4B3A31E2A51650967D61DE51; // 0x4448(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_00DABFE94DCECA72640F8FBC7C1B9D5D; // 0x44C0(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_65D2408A48D92F98E853C288A4269B69; // 0x44F0(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EA7F1256427A93E962DCC3B73CCC60C9; // 0x4568(0x78)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_02414D474C0482A2B8AD70BB63A2DEF6; // 0x45E0(0xA0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_FE66E9EF4E45F23D68EFE2B900A46F55; // 0x4680(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EEF763534F6E8DA7E93536A8303C962C; // 0x4748(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9DA1811442AC13FF38818F811D324F4A; // 0x47C0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6522890144F436A827751EB1070F77DB; // 0x4838(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_FA71139A41B1591ECD5326AE5DBA137F; // 0x4868(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_DE5D99844C1C0DCC037ADC95563D4EA6; // 0x4918(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_F94320514992441AD5CD0FAA4788EF8E; // 0x4948(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_542F93B1429058AAAFAF53AFAE7AAF0B; // 0x49F8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4B03AA96472FA4D96E7C7BB7E01DCCC7; // 0x4A28(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_55A7F0CB4948CECDC0B6B08C3F1DB753; // 0x4AA0(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8A25ED394F8F258CFF7AC3A875905411; // 0x4AD0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3D3D3BD240C0416165358D850E33F40E; // 0x4B48(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_5D4AA2FA47D8DF5ED37FEEA35E46CC8B; // 0x4B78(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13590AAF41E2981B202FF2ABCDB05F09; // 0x4C28(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1620EEE446A37C5D55D5328361A547E7; // 0x4C58(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5BAF8CAD4A9B49AEFE2F27978FAA9D59; // 0x4C80(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FEF157494EA8751993E38097A9F8E26C; // 0x4CA8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A2B5BF5549E9F25387E16BAB77F15657; // 0x4CD0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_EE02FE0F42C7A6893FB94097C1EE4A2C; // 0x4CF8(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_549FC1D5457225D5315AFBA7258C7E12; // 0x4D20(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7922255D4F10ADEE6292EF9B945BDF12; // 0x4D98(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18DA06A14B385B7D93D0CCACAAE9D9AF; // 0x4DC8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15A5B0184AAE5553D06FF3A81DFD6B97; // 0x4DF0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2D2864D44A048C6498DA658FFCDA126A; // 0x4E18(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E0A5B771464807E53D13EEA466E02F45; // 0x4E40(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6661B43D417070F420E59A84C3A4D9ED; // 0x4E68(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E4C44E6D4E2D8A619439FA89E6CA92F5; // 0x4E90(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B9AC3E484D9F97E2263E0FBDEEDD2FD0; // 0x4EB8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_FCC4420341D6DADC03A09FA00245CFAE; // 0x4F30(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A1579A9646FB51B3B5862EBAF4DC74D0; // 0x4F60(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13871D67435DF21CC66AFEBAC5DE0D0B; // 0x4FD8(0x30)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_53E91F1248E50AC05B7DC8B7EAAA5F74; // 0x5008(0xE0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4514519749677B475514A09B361323D8; // 0x50E8(0xE0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_175477E14920590FC098D082CD617328; // 0x51C8(0xC8)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_E36FF61A423588AAACE7B3BBCFC2479A; // 0x5290(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3214C6DA43E66CC040208EB620C39F84; // 0x5358(0xE0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9672D3404B7A84CC1DC3FA997EC44441; // 0x5438(0xA0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_A3DE744541BFFF27DA6EB98AC5E477BE; // 0x54D8(0xE0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_E3BABE004C82F449D313B9910C2BE2DC; // 0x55B8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_436E0E6F403868D13F05D5A27DF320C9; // 0x55E8(0x78)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_FF1E5CB24B24E8DABFF08DB15909DDD0; // 0x5660(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_22C4A1F040745F94A5B263B4FB3C6C53; // 0x5728(0x78)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_10065092452FE019388DFC9044CA6EC4; // 0x57A0(0xC8)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_6964C42A4CB02D3785DD99A384F1A6BF; // 0x5868(0xE0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5CC3C800457E0A1489FDEE9A78FD820D; // 0x5948(0xA0)()
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_08AB56F848E30F8C99DC29A97AA83887; // 0x59E8(0xE0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_462240E3493E6086FD9DC1AD96C1BF88; // 0x5AC8(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_7A4D16EF48F2FA6A576296B9AA03AF2B; // 0x5AF8(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_DFC59ADB40656AB18B4BDD8F9D753828; // 0x5BA8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_48DF3920482A4C16D0D01C8382745E30; // 0x5BD8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_0CAC9E864605DB19108FF585229BC83D; // 0x5C50(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0B18931E4679C4DE127BAB8C702DA330; // 0x5C80(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_04812B2E469C7AA8711A1886126AD576; // 0x5CF8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D14264A44E4D5479B1125AAC2B30A8F3; // 0x5D28(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_E74222104D7308A26E9346ABECD764F9; // 0x5DA0(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_15C9BB7E4509EB3F5F4273936E5A11EE; // 0x5DD0(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_93B7BEA84E5E5C4AAE49EBBCF9929084; // 0x5E80(0x30)()
	struct FAnimNode_RandomPlayer                AnimGraphNode_RandomPlayer_FA7FAE784B855154DFE99A8D6DDD20EE; // 0x5EB0(0x68)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_A193BFBA4C72EB6136317CAF9171C6DF; // 0x5F18(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_438D33AC48F2D66BA15A4EB14000331F; // 0x5F48(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_367092AF47A281215889368599B4480C; // 0x5FC0(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F2C2E821417774A32A2FE49101E0EE4F; // 0x5FF0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_CF3076374FF464B6BAF998AE0420CA4C; // 0x6068(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B9716ECD40F41A9FE87C69AD5EA4A8E2; // 0x6098(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1829F34143AF26EE8E9CBCB5B4435B85; // 0x6110(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_83B8581B4F7AFEAEF5C279BBD8CEA364; // 0x6140(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_C2D6A7654E3F8F3420BF37939DF10285; // 0x61B8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_AC2C8E214CFD1BD01433E9A2CA79FE96; // 0x61E8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7B6472C946E12D4E4C484C9368F34977; // 0x6260(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_49841A804E325AAC3147D8BF3FDDA898; // 0x6290(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_AE9A8FEA48F9BE221B9641970A3E0D72; // 0x6308(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E61F91DA46F161877125DCA1432D1952; // 0x6338(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FE10128C4FB682346377478F90602170; // 0x6360(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_817A329D4FDB2263D99680B80BB97D29; // 0x6388(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B16D816B4A281D11FB678D94B3226B1F; // 0x63B0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FFC977C54F71ED5D2632FA89AA87E14B; // 0x63D8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_028BFACA4460B46B547C829183EF3B87; // 0x6450(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_877F96094513306D639039B93407A31B; // 0x6480(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_45CD281F413A08E15F5051A33DA24D3A; // 0x64F8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_04F3F45940AB1A36FCA883A868ABA10E; // 0x6528(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_AE2788FC4083EE7C67F173B280ED7309; // 0x65A0(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_84D01AB54F136E4BF319E2BA24F85889; // 0x65D0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_F7E971754811B407490F978F89A7C50A; // 0x6648(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_05D6C9C74D5D00EFE1A9F783991D7DEF; // 0x6678(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4183A69B42A8F51F2EB238A7A0C5FB9C; // 0x6728(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_28104DDB45225A4F211849AA1823C56F; // 0x6758(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0367A605489EC7D0E6C72291725D06E1; // 0x67D0(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_E92DD060471C586862785DACF92BC5EC; // 0x6848(0xA0)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_460D128A442C1C341917D6AFAFC70729; // 0x68E8(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_652E81B84B75BC7C19769BAE3EF152AC; // 0x6988(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_88DF05E24B3216E74457D2B54C1ED947; // 0x6A00(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9176F67443D8AC0C77B1C1B74AEEFD3F; // 0x6A30(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_31CF916948A62AD8F13EFC9269C792B3; // 0x6AA8(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_F56E1314476DB82F6E865A9BE9A4A70E; // 0x6B20(0xA0)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_E21E6FC644654DC77A2D24A9258E37B3; // 0x6BC0(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_02DE35E740396768E53F1BA723DFC297; // 0x6C60(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_C9E5658844492C709C2123838788CFFD; // 0x6CD8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F892542F4FC9A6795447A9BC71FAA845; // 0x6D08(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7F8E88BC455C267005B22096A32B6F3B; // 0x6D80(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_B186104443C49AD6613579ABF0AB9107; // 0x6DF8(0xA0)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_4005BCAC4F56EB6DE41068BEEC852B34; // 0x6E98(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_289A6B11470FEDBADFA3EDA30547D62A; // 0x6F38(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_FD14AED644BFDB28210CC4B92275E83C; // 0x6FB0(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6F036EA74D4A2A171717E39057DD5DA8; // 0x6FE0(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FEC851A640A700CF0B9D9DA784726161; // 0x7058(0x78)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3966F8CE496CA8ECE20ED7AD67A7F571; // 0x70D0(0xA0)()
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_2931483548FDB52CAE368A87F87C4DC8; // 0x7170(0xA0)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6F4B7100409095FD562447AA0FA3988B; // 0x7210(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_39DF41B4481CCD3F1536B385E55EC196; // 0x7288(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_72037D974F0D8E15EE3B528FEBD2F9D7; // 0x72B8(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_43090805450CD3FADFBDAA82491912FD; // 0x7330(0x78)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_0942D42845E93B598CE59C9955DC9518; // 0x73A8(0xC8)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_77B944F64A58FE2967497A8C0B34E623; // 0x7470(0x30)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_753F3FFA43A915BB499E99BBC09111AB; // 0x74A0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CCE15CF84C7C4EEF85E404AF88D33C49; // 0x74C8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A020429A41FD196C7C62A78573DDD177; // 0x74F0(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19615E784E5D5E11074B5BB569D1F662; // 0x7518(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_787B95334C604FA1A5AA7FAED1620431; // 0x7540(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_82E6B4B94183028E3B07C2B54920A5CF; // 0x7568(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AFE2E35C45707BE7E8E2BF91643E0B06; // 0x7590(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_99E112B74695C302ED445B9FF9F18FF4; // 0x75B8(0x28)()
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0D64B7914FDEA964C484488AF2700280; // 0x75E0(0x28)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_557BACEA4C6D3E9A43BB45BDD5CC51BB; // 0x7608(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_61EC35B844A7A73F8EE81FBBD0B446A0; // 0x7680(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EACA82E843078F8A5F4E6FA821BC019A; // 0x76B0(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_A8C15D6346CBF17FC52ED39F292263C5; // 0x7728(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F5BBBE5F49713CEFAC7EC7973D9F08D5; // 0x7758(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_393D3C994788C4CB370CAE8640C735BC; // 0x77D0(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BC45A4F74893F3F3699704875597B230; // 0x7800(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_03C8572B471BB8BE760BD4B34B22D39B; // 0x7878(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2EE93562471D130CFB5DBBB2BE9363C9; // 0x78A8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_18FD1D444B6C758A7CFDD2BBE1D07F9F; // 0x7920(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C688CED5465A8D5C036613BB0D62253B; // 0x7950(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_C5C04610479FF7028BE2EDA921A23E54; // 0x79C8(0x30)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BC807D624F6DE86BA9672E899341573C; // 0x79F8(0x78)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_06961756433E91BE51B4449BABA74632; // 0x7A70(0x30)()
	struct FAnimNode_RandomPlayer                AnimGraphNode_RandomPlayer_1426EA744E1B21C5598193A769ECD881; // 0x7AA0(0x68)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9974C3004B6263EC28692398F25A215D; // 0x7B08(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_C5B8836B4CEBF6E9727863B6D0C995A5; // 0x7B38(0xB0)()
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_615996F44C39F84D868FEC93CE364D48; // 0x7BE8(0x30)()
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_9A4B5B7742463D79BF0CEB969D6F5F33; // 0x7C18(0xB0)()
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_018A99774427BDACA10E4BB4A2EF12E9; // 0x7CC8(0xC8)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CC361188451E74C19F0CFC96E33072FB; // 0x7D90(0x78)()
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_72D9F1F44750A7E5F1E62EB5B87A6FEB; // 0x7E08(0x78)()
	struct FAnimNode_Slot                        AnimGraphNode_Slot_B6AE7CCD4F0AE18F12F248B38A4E1B75; // 0x7E80(0x48)()
	struct FAnimNode_PoseBlendNode               AnimGraphNode_PoseBlendNode_F0398259433DAB3786573DA75A35C6BD; // 0x7EC8(0x98)()
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_764130A44B2A456992DE9CB30B10901D; // 0x7F60(0xF8)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_F9728D194EEEA7011495D68EF0A00CB5; // 0x8058(0xB8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_DF9B74E6493CA5871C3B6789693EE88F; // 0x8110(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_0B4043CE4209FBDE277F7CA7851EEF24; // 0x8138(0x28)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_8F44D9504941E8105FB3BFBD14102B06; // 0x8160(0xC0)()
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_E12D31DF4539E519454190A45372BBB1; // 0x8220(0xA0)()
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_BAEF3D4C41EAE5C7F7A6A28842196458; // 0x82C0(0xB8)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_A2FBC55E4E516FCFF755A5B7F85DC404; // 0x8378(0x28)()
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_63C35B654BC7E1DAE4C9CCA5884EAC62; // 0x83A0(0x28)()
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_466C5F1E42E645299620418DC91273B3; // 0x83C8(0xC0)()
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose_3498CA0746B77F635465CC9990828BD8; // 0x8488(0x18)()
	struct FAnimNode_Root                        AnimGraphNode_Root_4161E8E74D4248BA1D3883A241D64A25; // 0x84A0(0x30)()
	struct FVector                               PlayerLocation;                                    // 0x84D0(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bHasPlayerLocationBeenSet;                         // 0x84DC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bIsJumpLandComplete_0;                             // 0x84DD(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6291[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        JumpIndex;                                         // 0x84E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DownSightsToLocomotionTimeRemaining;               // 0x84E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RandomIdle;                                        // 0x84E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RandomIdle2;                                       // 0x84EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HandIKWeight;                                      // 0x84F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsMovingDuringJumpInitiated;                      // 0x84F4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bIsFox;                                            // 0x84F5(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bAllowSkippingIdleToCrouchTransition;              // 0x84F6(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bLobbySkyDive_IsDiving;                            // 0x84F7(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass()
	{
		static class UClass* Clss = UObject::FindClassFast("B_MasterPetAnimBP_C");
		return Clss;
	}

	void AnimGraph(struct FPoseLink* AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_B_MasterPetAnimBP_AnimGraphNode_TransitionResult_3C816C0C48CA2CAFFBF09392A11667F5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_B_MasterPetAnimBP_AnimGraphNode_TransitionResult_E0DEFD6D4A6F7885EF0C1ABF6CCDE727();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_B_MasterPetAnimBP_AnimGraphNode_TransitionResult_FE9887D54DE05D68FF6E8193A157347B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_B_MasterPetAnimBP_AnimGraphNode_LayeredBoneBlend_8F44D9504941E8105FB3BFBD14102B06();
	void AnimNotify_RollRandomIdle();
	void AnimNotify_RollRandomIdle2();
